{"name":"A very British Bolognese","description":"Get organised with this batch-cook beauty – Jamie’s British Bolognese made with pale ale and Cheddar cheese. And a great little pasta trick you won't want to miss… ","ingredients":["2 sprigs of fresh rosemary","olive oil","400 g chopped mixed onion, carrot & celery","250 g chestnut mushrooms","500 g lean beef mince , or pork mince (the best quality you can afford), or veggie mince","500 ml pale ale","2 x 400 g tins of quality plum tomatoes","250 g fresh lasagne sheets","20 g Cheddar cheese"],"instructions":"Put a large, shallow non-stick casserole pan on a medium-high heat. Pick and finely chop the rosemary leaves, then sprinkle into the pan with 1 tablespoon of olive oil to crisp up. Add the chopped mixed veg and cook for 10 minutes, stirring regularly, while you trim and finely chop the mushrooms. Stir them into the pan with the mince, breaking it up with your spoon. Cook for 15 minutes, or until golden and caramelized. Pour in the ale, let it cook away, then stir in the tomatoes and 1 tin’s worth of water, mashing it all with a potato masher. Simmer on a medium-low heat for 1 hour, mashing occasionally to thicken the texture. season to perfection. For 2 portions, either cut the lasagne sheets into 2cm slices or, for a bit of fun, stack up your sheets and cut 2cm slits into them at ½cm intervals all over. Cook in a large pan of boiling salted water for just 3 minutes, then scoop out and toss with 2 portions of Bolognese, loosening with a splash of pasta cooking water, if needed. Grate over the cheese, and serve right away. Batch up your leftover portions, cool, and pop into the fridge or freezer for another day. Happiness.","tags":["7 Ways","Beef","British","Pork","Mince","Minced beef"],"time":{"prep":"","cook":"Time 1 hour 30 minutes","active":"","inactive":"","ready":"","total":"Time 1 hour 30 minutes"},"servings":"Serves 2 + 6 Bolognese freezer portions","image":"https://cdn.jamieoliver.com/recipe-database/medium/109386584.jpg"}