{"name":"Abuelita’s Caldo de Res","description":"Rich in flavor and packed with vegetables, this comforting Mexican beef soup can easily be made and enjoyed year-round. Learn how to make caldo de res here.","ingredients":["1 large white onion, cut into 1\" pieces, plus more finely chopped for serving","1 head of garlic, halved crosswise","3 dried bay leaves","2 lb. bone-in beef short ribs, rinsed","1 lb. beef marrow bones, rinsed (optional)","2 ears of corn, husked, cut crosswise into 2\"-thick rounds","2 large zucchini (about 1 lb.), halved lengthwise, cut into 1\"-thick half-moons","1 large chayote (about 11 oz.), halved lengthwise, seeds removed, cut into 1\" pieces","2 large carrots (about 8 oz.), scrubbed, cut into 1\" pieces","2 Tbsp. double-concentrated tomato paste","½ small head of green cabbage (about 8 oz.), cored, cut into 1\" pieces","1 bunch cilantro, tied together with kitchen twine (optional), plus more finely chopped for serving","1 bunch mint, tied together with kitchen twine (optional)","2 Tbsp. Diamond Crystal or 1 Tbsp. plus ½ tsp. Morton kosher salt, plus more"," Sliced jalapeños, warm corn tortillas, and lime wedges (for serving)"],"instructions":"Combine 1 large white onion, cut into 1\" pieces, 1 head of garlic, halved crosswise, 3 dried bay leaves, 2 lb. bone-in beef short ribs, rinsed, 1 lb. beef marrow bones, rinsed (if using), and 8 cups water in a large Dutch oven or other heavy pot, making sure beef is fully submerged. Bring to a boil over medium-high heat, then reduce heat to medium-low and simmer, using a ladle to skim any dark foam from surface as needed, 12–14 minutes. Cover pot and cook, adjusting heat as needed to maintain a simmer, until beef is tender, 1–1½ hours. Using tongs, remove garlic and bay leaves from pot. Discard bay leaves and let garlic cool slightly. Squeeze garlic cloves from skins into a small bowl; discard skins. Smash garlic into a paste with a spoon. Add garlic paste, 2 ears of corn, husked, cut crosswise into 2\"-thick rounds, 2 large zucchini (about 1 lb.), halved lengthwise, cut into 1\"-thick half-moons, 1 large chayote (about 11 oz.), halved lengthwise, seeds removed, cut into 1\" pieces, 2 large carrots (about 8 oz.), scrubbed, cut into 1\" pieces, and 2 Tbsp. double-concentrated tomato paste to pot. If liquid level is low, add up to 2 cups water, 1 cup at a time. Increase heat to medium, cover pot, leaving lid slightly askew, and cook until carrots are tender, 20–30 minutes. Add ½ small head of green cabbage (about 8 oz.), cored, cut into 1\" pieces, pushing down into soup to submerge. If using, add 1 bunch cilantro, tied together with kitchen twine, and 1 bunch mint, tied together with kitchen twine, and cook until cabbage is softened, 10–15 minutes. Remove cilantro and mint; discard. Skim fat from surface of soup. Stir in 2 Tbsp. Diamond Crystal or 1 Tbsp. plus ½ tsp. Morton kosher salt; taste and season with more salt if needed. Ladle soup into bowls and top with finely chopped white onion, finely chopped cilantro, and sliced jalapeños. Serve with warm corn tortillas and lime wedges for squeezing over.","tags":["main","dinner","mexican","soup","dairy-free","gluten-free","nut-free","short rib","corn","zucchini","carrot","green cabbage","cilantro"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":""},"servings":"","image":"https://assets.bonappetit.com/photos/6695353987262fa45339cbad/16:9/w_1280,c_limit/Caldo-de-Res_Web.jpg"}