{"name":"BA's Best Eggplant Parmesan","description":"This showstopping eggplant Parmesan recipe features homemade marinara layered with breaded eggplant and plenty of Parmesan and mozzarella cheese.","ingredients":["¼ cup extra-virgin olive oil","1 head of garlic, cloves crushed","1 large red onion, chopped","3 oil-packed anchovy fillets (optional)","½ tsp. crushed red pepper flakes","1 Tbsp. tomato paste","¼ cup dry white wine","2 (28-oz.) cans whole peeled tomatoes","¼ cup torn basil leaves","½ tsp. dried oregano"," Kosher salt","4 lb. Italian eggplants (about 4 medium eggplants), peeled, sliced lengthwise ½\"–¾\" thick"," Kosher salt","3 cups panko breadcrumbs","1½ tsp. dried oregano","1 tsp. freshly ground black pepper","1½ cups finely grated Parmesan, divided","1½ cups (187.5 g) all-purpose flour","5 large eggs, beaten to blend","1⅓ cups extra-virgin olive oil, divided","½ cup finely chopped basil and parsley, plus basil leaves for serving","6 oz. low-moisture mozzarella cheese, grated (about 1⅓ cups)","8 oz. fresh mozzarella cheese, thinly sliced"],"instructions":"Preheat oven to 350°. Place a Dutch oven or other large heavy ovenproof pot over medium heat. Add ¼ cup extra-virgin olive oil and 1 head of garlic, cloves crushed, and cook, stirring often, until garlic is golden, about 4 minutes. Add 1 large red onion, chopped, 3 oil-packed anchovy fillets (if using), and ½ tsp. crushed red pepper flakes and cook, stirring often, until onion is translucent, about 5 minutes. Stir in 1 Tbsp. tomato paste and cook, stirring often, until slightly darkened, about 2 minutes. Add ¼ cup dry white wine, bring to a boil, and cook until almost completely evaporated, about 1 minute. Add two 28-oz. cans whole peeled tomatoes, breaking up with your hands, and their juices; add ¼ cup torn basil leaves and ½ tsp. dried oregano and stir to combine. Swirl 1½ cups water into one tomato can, then the other, to rinse, and add to pot; season with kosher salt. Transfer pot to oven; roast sauce, stirring halfway through, until thick and tomatoes are browned on top and around edges of pot, 2–2½ hours. Let sauce cool slightly. Pass through the large holes of a food mill or process in a food processor until mostly smooth. Taste and season with salt. Do Ahead: Sauce can be made 2 days ahead. Cover and chill. Lightly season 4 lb. Italian eggplants (about 4 medium eggplants), peeled, sliced lengthwise ½\"–¾\" thick, all over with kosher salt; place in a single layer on several layers of paper towels inside a rimmed baking sheet. Top with another layer of paper towels and more slices; repeat as needed. Top with a final layer of paper towels, then another rimmed baking sheet; weigh down with a heavy pot. Let sliced eggplant sit until it has released excess liquid, 45–60 minutes. This step gives the eggplant a creamy texture when baked. Meanwhile, pulse 3 cups panko breadcrumbs, 1½ tsp. dried oregano, 1 tsp. freshly ground black pepper, and ¾ cup finely grated Parmesan cheese in a food processor until very finely ground. Transfer to a shallow bowl. Preheat oven to 350°. Place 1½ cups (187.5 g) all-purpose flour in another shallow bowl and 5 large eggs, beaten to blend, in a third shallow bowl. Working one at a time, dredge eggplant slices in flour, then dip in egg, allowing excess to drip off. Coat in breadcrumb mixture, packing all around, then shaking off excess. Place on wire racks. Heat ⅔ cup extra-virgin olive oil in a large skillet, preferably cast iron, over medium-high. Cook as many eggplant slices as will comfortably fit in pan, turning once, until deep golden brown, about 5 minutes. Transfer to paper towels and immediately press with more paper towel to absorb oil. Working in batches, repeat with remaining eggplant, adding remaining ⅔ cup extra-virgin olive oil and wiping out skillet as needed. Let cool. Taste and season with more salt if needed. Toss ½ cup finely chopped basil and parsley, 6 oz. low-moisture mozzarella cheese, grated (about 1⅓ cups), and remaining ¾ cup finely grated Parmesan cheese in a medium bowl. Spread 1 cup sauce over the bottom of a 13x9\" baking pan or casserole dish; top with a layer of roasted eggplant slices (trim as needed). Drizzle 1 cup sauce over and sprinkle with one third of cheese mixture. Add another layer of eggplant, followed by 1 cup sauce and half of remaining cheese mixture. Repeat layers with remaining slices, sauce, and cheese mixture. Cover with foil and bake on a rimmed baking sheet until eggplant is custardy, 45–60 minutes. Remove from oven and arrange 8 oz. fresh mozzarella cheese, thinly sliced, over eggplant. Increase oven temperature to 425° and bake, uncovered, until cheese is bubbling and browned in spots, 15–20 minutes longer. Let rest 30 minutes. Top with basil leaves just before slicing. Do Ahead: Eggplant Parmesan can be baked 2 days ahead. Let cool; cover with foil and chill. Reheat in a 350° oven, uncovering halfway through, until bubbling gently at edges. Editor’s note: This eggplant parm recipe was first printed in our October 2016 issue. Head this way for more of our favorite casserole recipes →","tags":["dinner","casserole","eggplant","parmesan","main","nut-free","italian american"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":""},"servings":"","image":"https://assets.bonappetit.com/photos/667ec1acfef9fe35ab3ae756/16:9/w_1280,c_limit/best-eggplant-parmesan_LEDE_V4_062524_0674_VOG_final.jpg"}