{"name":"Baked ricotta & veg pasta","description":"Simple, versatile and oh-so-tasty, this vegetarian pasta dish goes down a treat with both kids and adults alike. Midweek family meal, sorted.","ingredients":["1 bunch of fresh basil , (30g)","2 cloves of garlic","extra virgin olive oil","500 g ripe mixed-colour cherry tomatoes","1 yellow pepper","1 courgette","250 g ricotta cheese","1 lemon","300 g dried wholewheat pasta – fusilli, rigatoni or penne","1 large handful of baby spinach","balsamic vinegar , to serve (optional)","Parmesan cheese , to serve (optional)","Pangrattato topping","1 clove of garlic","1 sprig of rosemary","olive oil","2 handfuls of coarse stale breadcrumbs , (approx. 50g)"],"instructions":"Preheat the oven to 180°C/350°F/gas 4. Pick a handful of basil leaves and keep to one side, then pick the rest and pound to a paste in a pestle and mortar with a small pinch of sea salt. Peel and bash in the garlic, muddle in 2 to 3 tablespoons of extra virgin olive oil, then season with black pepper. Halve the cherry tomatoes, halve, deseed and roughly chop the pepper, and trim and cut the courgette into half lengthways then into 2cm chunks. Add it all to a large roasting tray, making a little well in the middle of the veg. Drain the ricotta and place it in the middle, with the largest side facing down. Zest ½ a lemon over the ricotta and pour over half of the flavoured oil. Toss the rest of the oil with the mixed veggies. Add a splash of water to the tray, then roast for 30 to 40 minutes, or until the tomatoes and veg are soft and just starting to caramelise. Meanwhile, to make your pangrattato topping, peel the garlic, strip the rosemary leaves, then finely chop them both. Drizzle a little oil into a frying pan on a medium heat, add the breadcrumbs, garlic and rosemary and fry for 3 minutes, or until golden and smelling delicious. Tip into a bowl and set aside. Ten minutes before the veg is ready, cook the pasta in a pan of boiling salted water according to the packet instructions, then drain in a colander, reserving a mug of the starchy pasta water, and leave to steam dry. Remove the veg tray from the oven, add the spinach and gently mix everything together, breaking up the ricotta a little. Tip the drained pasta into the tray, adding a little splash of the pasta water and gently shake to loosen all the sticky goodness from the bottom. Toss everything together, taste then add a squeeze of lemon, if you like. Divide the pasta between your plates, pick over the remaining basil leaves and a little balsamic vinegar, if you like. Grate over a little Parmesan, if using, and serve.","tags":["Italian","Spinach","Tomato","Courgette","Lunch & dinner recipes","Mains"],"time":{"prep":"","cook":"Time 50 minutes","active":"","inactive":"","ready":"","total":"Time 50 minutes"},"servings":"Serves 4","image":"https://cdn.jamieoliver.com/recipe-database/medium/127199606.jpg"}