{"name":"Black bean burgers","description":"A black bean veggie burger recipe that shows you how to make black bean burger patties. This is a really flavour-packed veggie burger with a crunchy slaw.","ingredients":["½ a red onion","1 tablespoon balsamic vinegar","1 fresh red chilli","2 spring onions","1 x 400 g tin black beans","100 g fresh breadcrumbs","1 lemon","extra virgin olive oil","2 tablespoons natural yoghurt","80 g baby kale","30 g rocket","olive oil","1 ripe beef tomato","75 g mozzarella cheese","2 wholemeal buns"],"instructions":"Peel the onion, finely slice into rounds and place in a small bowl with the balsamic and a pinch of sea salt. Set aside. Halve, deseed and finely chop the chilli. Trim and finely chop the spring onions. Place both in a mixing bowl. Drain the beans and pat dry with kitchen paper. Add to the bowl, along with the breadcrumbs. Season, then scrunch the bean mixture together with clean hands. Divide into 3 balls, flatten into patties and place 2 in the fridge to chill for 10 minutes (wrap and freeze the spare for another day). In a small bowl, combine half the lemon juice, 1 tablespoon of extra virgin olive oil and the yoghurt. Season well. Trim the kale and mix into the dressing with the rocket. Put aside. Heat 1 tablespoon of olive oil in a non-stick pan over a medium heat. When the pan is hot, fry the burgers for 4 minutes on each side, or until golden. If they colour too quickly, reduce the heat. Slice the tomato and mozzarella into rounds and open the buns. When the burgers are almost cooked, top each one with mozzarella. Cover the burgers with a lid for 2 minutes to melt the cheese. Set another pan over a high heat and warm the bun halves, cut-side down, for 2 minutes or until toasted. Lift the onions out of the balsamic with a fork. Pop slices of tomato on each bun base, and a burger on top. Top with the balsamic onions and the bun lid. Serve the kale salad alongside.","tags":["Beef","Lunch & dinner recipes","Mains"],"time":{"prep":"","cook":"Time 40 minutes","active":"","inactive":"","ready":"","total":"Time 40 minutes"},"servings":"Serves 2","image":"https://cdn.jamieoliver.com/recipe-database/medium/52011149.jpg"}