{"name":"Black Bean and Vegetable Bake","description":"Make a deep skillet of your favorite taco or burrito filling, cover it with cheese and broil it until charred and gooey on top, then scoop it up with chips.","ingredients":["2 tablespoons olive or vegetable oil","1 large onion, diced small","4 cloves of garlic, minced","1 fresh jalapeño or habanero pepper, minced","1 bell pepper, diced","1 teaspoon ground cumin","2 to 3 teaspoons ground chili powder (to taste)","2 tablespoons tomato paste","1 (28-ounce) can diced tomatoes, or 2 to 3 cans Rotel","Kosher salt","2 (15.5-ounce) cans black beans, drained and rinsed","Kosher salt","1 cup corn kernels, fresh (from 1 ear), canned and drained, or frozen (no need to thaw)","4 ounces baby spinach, roughly chopped","1 lime, halved","3/4 cup crumbled cotija cheese","6 to 8 ounces (1 1/2 to 2 cups) coarsely grated monterey jack or pepper jack cheese","Tortilla chips"],"instructions":"Heat your largest ovenproof skillet or sauté pan over medium-high heat. Once hot, add oil, and once the oil is hot, add the onion, garlic, jalapeño, and bell pepper and cook until the the ingredients begin to soften, 4 to 5 minutes. Add the cumin, first 2 teaspoons chili powder, and tomato paste, and cook for 1 minute. Add diced tomatoes and let simmer for 1 minute, then add the beans and simmer for 2 to 3 minutes. Taste the mixture and add salt; I find I need between 2 to 3 teaspoons of kosher salt (Diamond brand) to get the level right but adjust it to your taste. Add last 1 teaspoon chili powder if needed for your desired heat level. Add the corn and spinach and stir until the spinach has wilted and everything is warm. Taste for seasoning again and adjust as needed. Squeeze juice of half a lime over. Meanwhile, heat your oven’s broiler, and if it doesn’t have a broiler, heat it as hot as it goes. If your skillet isn’t ovenproof, pour mixture into a baking dish. Mix jack and cotija cheeses and sprinkle mixture over the beans. [The smaller amount of jack cheese covers the pan less thickly than shown here, and allows more sauce to bubble through. The larger amount is never unwelcome.] Transfer to broiler and cook until cheese is melted and browned on top. Eat right away with tortilla chips, hot sauce of your choice, and if you’re me, a squeeze of juice from the second half of the lime. Do ahead: While the whole dish reheats well in a 350°F oven, if you’re planning to eat it later, I’d wait to put the cheese on until right before you serve it because cheese is at its most stretchy/gooey the first time it melts.","tags":["Beans","Budget","Dinner","Recipe","Spinach","Tex-Mex","Vegetarian","Weeknight Favorite"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":"45 to 50 minutes"},"servings":"8","image":"https://i0.wp.com/smittenkitchen.com/wp-content/uploads/2024/05/black-bean-vegetable-bake-6-scaled.jpg?fit=1200%2C800&ssl=1"}