{"name":"Blackcurrant ombré cheesecake","description":"This fruity blackcurrant cheesecake recipe makes a brilliant alternative Christmas pudding showstopper – what a treat!","ingredients":["100 g unsalted butter , plus extra for greasing","300 g oaty biscuits","1 vanilla pod","500 g light cream cheese","300 ml double cream","1½ x 340 g jars of Tiptree blackcurrant jam","4 sheets of gelatine","200 g blackcurrants and blackberries , plus extra to decorate"],"instructions":"Grease the sides of a 23cm loose-bottomed cake tin and line the base with greaseproof paper. In a large saucepan, melt the butter over a low heat. Blitz the biscuits in a food processor until finely ground, then stir into the butter. Press the crumbs evenly into the tin, then leave in the fridge for 20 minutes to firm up. Halve the vanilla pod lengthways, scrape the seeds into a large bowl and whisk in the cream cheese. In a separate bowl, whisk the cream to soft peaks, then fold into the cream cheese with 1 heaped teaspoon of jam. Spoon a 1cm-thick layer over the biscuit base. Add 1 heaped tablespoon of jam to the rest of the mixture, and add another layer to the cheesecake. Keep doing this, adding more jam each time – so the layers get darker as you go – until you have used a whole jar of jam, leaving a 1cm gap at the top. Place the cheesecake in the fridge for 1 hour to firm up. Meanwhile, make the jelly. Soak the gelatine in cold water for 5 minutes, then drain. Spoon the remaining ½ jar of jam in a saucepan over a low heat along with 100ml of water and 50g of berries, and gently simmer for 3 minutes. Stir in the gelatine until dissolved, then pour into a glass jug and cool for 30 minutes. Once cooled, pour the jelly over the cheesecake, carefully spreading over the surface. Let it sit in the fridge for 1 more hour, until the jelly is firm to the touch. The cheesecake will keep in the fridge for up to 3 days – serve garnished with the remaining blackcurrants and blackberries.","tags":["Jamie Magazine","Fruit","Desserts","Puddings & desserts"],"time":{"prep":"","cook":"Time 45 minutes plus chilling","active":"","inactive":"","ready":"","total":"Time 45 minutes plus chilling"},"servings":"Serves 12","image":"https://cdn.jamieoliver.com/recipe-database/medium/60160882.jpg"}