{"name":"Blistered Peas-in-the-Pod with Lemon and Salt","description":"Have you ever grilled fresh peas in their pod until blistered, finished them with some salt and lemon, and eaten them like edamame? If not, you’re in for a treat.","ingredients":["1 pound fresh English or sweet peas, still in their pods","Olive oil","Salt","Freshly ground black pepper or red pepper flakes","Finely grated zest and a few wedges of one lemon","Handful mint leaves, chopped (optional)","1/2 cup crumbled ricotta salata or feta (optional)"],"instructions":"Wash and pat dry the fresh peas in their pods. Toss in a bowl with a drizzle of olive oil. Heat your grill to a medium-high temperature. Use tongs to arrange the pea pods across grill grates so they don’t fall in. Grill for about 5 minutes on the first side, until blistered and dark in spots underneath. Flip pea pods over and repeat on second side, another 5 minutes, adding another minute or two if needed. [Note: My grill is small and fairly weak. This might take less time on a more robust grill. Look for blistering, not a measured amount of time.] Transfer grilled peas to a serving plate. Season with salt, pepper, and lemon zest; nestle lemon wedges on the plate for those who want fresh juice on theirs. There are two ways to serve these:Edamame-style: Serve in the closed pods, just like this, to be eaten “edamame-style” — i.e. holding the pod in your hand and popping the peas into your mouth, discarding the pod.Raft-style: Alternatively, you can peel open the pods, exposing the row of peas inside. With this method, I season the insides as well with salt, pepper, and zest. Add the optional extras of mint and crumbled cheese. Serve hot or warm. There will be no leftovers.Edamame-style: Serve in the closed pods, just like this, to be eaten “edamame-style” — i.e. holding the pod in your hand and popping the peas into your mouth, discarding the pod.Raft-style: Alternatively, you can peel open the pods, exposing the row of peas inside. With this method, I season the insides as well with salt, pepper, and zest. Add the optional extras of mint and crumbled cheese.","tags":["5 Ingredients or Fewer","Appetizers","Grilling","Peas","Recipe","Summer","Vegetarian"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":"15 minutes"},"servings":"4 as a side; 8 as an appetizer","image":"https://i0.wp.com/smittenkitchen.com/wp-content/uploads/2024/06/blistered-peas-in-the-pod-8-scaled.jpg?fit=1200%2C800&ssl=1"}