{"name":"Bolognese ravioli","description":"Jamie's Bolognese ravioli recipe is the epitome of comfort food; deliciously hearty homemade ravioli filled with a  beautiful Bolognese sauce. Perfect.","ingredients":["FILLING","400 g higher-welfare minced pork","400 g higher-welfare minced veal , or beef","olive oil","2 cloves of garlic","2 onions","2 carrots","2 sticks of celery","200 ml Chianti Classico","2 x 400 g tins of quality plum tomatoes","100 g Parmesan cheese , plus extra to serve","PASTA","1 x Royal pasta dough","fine semolina","SAUCE","4 cloves of garlic","1-2 fresh red chillies","3 x 400 g tins of quality plum tomatoes","a few sprigs of fresh basil"],"instructions":"Put all the minced meat into your largest pan on a high heat with a good lug of oil and a pinch of sea salt and pepper. Cook for 20 minutes, or until golden, stirring regularly. Meanwhile, peel and finely chop the garlic, onions, carrots and celery. When the mince has got a good colour, add all the chopped veg and cook for a further 10 minutes, then add the Chianti and cook it away. Pour in the tomatoes, breaking them up with a spoon, and add half a tin’s worth of water. Bring to the boil, then simmer gently for 1 hour, or until the meat is tender and the sauce is super-thick. Remove from the heat to cool, then finely grate and stir in the Parmesan. Now it’s time to assemble your pasta. Following the instructions for making the pasta dough, roll out your dough to 1mm thick, then make your ravioli about 7cm square. I work with a quarter of the pasta at a time to give more control. Use a heaped teaspoon of filling in the centre of each one, sealing the edges with a light brushing of water and pushing out the air – you should get about 50 to 60 ravioli from this amount of pasta. Place them on a semolina-dusted tray as you go. Freeze the remaining Bolognese (you’ll have roughly half left) for a rainy day, or make a double batch of pasta and freeze as ravioli – you can cook them from frozen in the sauce. Put a pan of salted water on to boil for the pasta. For the sauce, peel and roughly chop the garlic and deseed and finely chop the chillies. Place a pan on a medium heat, add a lug of oil and the garlic and chilli, and fry for a few minutes, or until very lightly golden. Add the tomatoes and simmer for 10 minutes, or until thickened and reduced, then remove from the heat and blitz until smooth with a stick blender. Taste and season to perfection, then place back on a very low heat. Cook the ravioli in the boiling salted water for 3 minutes, or until tender, then use a slotted spoon to transfer them to the sauce. Gently toss together and simmer for another couple of minutes, then divide between warm bowls, scatter with baby basil leaves and serve with a few extra gratings of Parmesan, if you like.","tags":["Jamie's Comfort Food","Dinner Party","Italian","Beef","Pork","Tomato"],"time":{"prep":"","cook":"Time 2 hours 30 minutes plus cooling","active":"","inactive":"","ready":"","total":"Time 2 hours 30 minutes plus cooling"},"servings":"Serves 8","image":"https://cdn.jamieoliver.com/recipe-database/medium/46342145.jpg"}