{"name":"Broccoli salad","description":"This broccoli bacon salad recipe is great for feeding a crowd. This is lovely served buffet-style, or just alongside some simple grilled chicken or fish.","ingredients":["2 large heads of broccoli","6 rashers of higher-welfare smoked streaky bacon","olive oil","3 firm red tomatoes","½ a bunch of fresh chives (15g, with flowers if you can get them)","Dressing","½ a clove of garlic","2 teaspoons Dijon mustard","6 tablespoons extra virgin olive oil","2 tablespoons white wine vinegar"],"instructions":"Use a small knife to remove the broccoli florets and cut them up into smaller ones. Basically, this is your opportunity to make the broccoli really delicate and more salady-looking, so spend a bit of time doing this. You’ll be left with the stalk, so discard the thick dry base, then cut the remaining stalk in half lengthways and finely slice. Blanch your broccoli florets and sliced stalks really quickly in boiling salted water for 60 seconds, just long enough to soften the broccoli but still leave it with a bit of a bite. Drain it in a colander, then spread it around a clean tea towel to steam dry (this is important because it will help the dressing cling to the broccoli). Once completely dry, transfer to a serving dish. Finely slice the bacon and fry on a medium heat with a small splash of olive oil until crisp and golden, then spoon most of the bacon bits over your broccoli. Any leftover fat in the pan can be used in your salad dressing. Pour it into a mixing bowl, then peel and finely grate in the garlic. Add all the other dressing ingredients, season with sea salt and black pepper, and whisk. Halve, deseed and finely slice the tomatoes and chop the chives, reserving the flowers. Add to your broccoli and bacon bits. Dress it all really well, and check the seasoning. If it needs pimping up, add a splash more vinegar. If you’ve got any chive flowers, sprinkle those over the top and serve straight away. It’s beautiful on its own or served next to any grilled or roasted meat or fish.","tags":["Jamie's America","Vegetables","Alfresco","Aussie Christmas","American","Pork"],"time":{"prep":"","cook":"Time 25 minutes","active":"","inactive":"","ready":"","total":"Time 25 minutes"},"servings":"Serves 6","image":"https://cdn.jamieoliver.com/recipe-database/oldImages/medium/98_1_1433952510.jpg"}