{"name":"Brown Butter Strawberry Baked Oatmeal","description":"Beautiful brown butter strawberry baked oatmeal with a light strawberry glaze. The perfect nourishing breakfast for spring and summer!","ingredients":["Nonstick cooking spray","Wet Ingredients:","4 tablespoons (56 grams) salted butter, sliced","2 large eggs","1 ½ cups (360 grams) milk of choice","¼ cup (78 grams) pure maple syrup","1 teaspoon vanilla extract","¼ teaspoon almond extract","Dry Ingredients:","2 cups (180 grams) rolled oats (gluten-free if desired)","1 teaspoon baking powder","¼ teaspoon kosher salt","1½ cups (225 grams) sliced fresh strawberries, divided","Strawberry Glaze:","¼ cup (7 grams) freeze-dried strawberries","¼ cup (30 grams) powdered sugar","1 tablespoon salted butter, melted","1 to 2 tablespoons milk of choice, as needed","Serving:","Milk or yogurt of choice"],"instructions":"Preheat the oven: Preheat the oven to 350°F. Grease an 8-inch square pan with cooking spray. Brown the butter: Add the butter to a small saucepan and melt over medium heat. Once melted, whisk constantly: the butter will begin to crackle, then foam. After a few minutes, the butter will begin to turn a golden amber color. As soon as the butter turns brown and gives off a nutty aroma, 5 to 8 minutes, remove from heat and set aside to cool for 5 minutes. Mix the wet ingredients: In a large bowl, whisk the eggs, milk, maple syrup, vanilla extract, and almond extract until smooth and combined. Mix in the dry ingredients: Add the oats, baking powder, and salt, and mix with a wooden spoon until combined. Stir in the cooled brown butter until well combined. Next, fold in HALF of the strawberries. Bake the oatmeal: Pour mixture into the prepared pan and smooth the top. Top with the remaining half of the strawberries. Bake until the edges are slightly golden brown and the center is set and a knife comes out mostly clean with just a few crumbs attached, 35 to 45 minutes. Remove from the oven and cool for at least 10 minutes. Make the glaze: Just before serving, add the freeze-dried strawberries to a blender (a small handheld blender works best!) and blend to a fine powder, about 30 seconds. In a small bowl, mix together the strawberry powder, powdered sugar, melted butter, and 1 tablespoon of the milk until smooth, adding the additional tablespoon if necessary to reach a pourable consistency. Drizzle the glaze back and forth over the oatmeal. Cut into 6 slices. Serve warm in a bowl, with a little milk poured on top or with yogurt, if desired.. To store: Allow baked oatmeal to cool completely then cover the pan with foil before transferring it to the fridge. Oatmeal will keep well for up to 4 days, and you can reheat individual slices in the microwave for 30 to 60 seconds. You can also store individual slices in airtight glass containers or reusable silicone bags for quick, on-the-go breakfasts. For oatmeal cups, remove them from your muffin tin and store oatmeal cups in airtight glass containers or reusable silicone bags in the fridge for up to  3 to 4 days. Reheat in the microwave for 30 to 60 seconds.","tags":[],"time":{"prep":"20 minutes minutes","cook":"35 minutes minutes","active":"","inactive":"","ready":"","total":"55 minutes minutes"},"servings":"6","image":"https://www.ambitiouskitchen.com/wp-content/uploads/2024/04/Brown-Butter-Strawberry-Baked-Oatmeal-5long.jpg"}