{"name":"Buddy's Bolognese","description":"This super tasty Bolognese recipe by Jamie's son Buddy is sure to be a hit on the flavour front and is a great option to cook up together. Serves 6 adults. ","ingredients":["2 higher-welfare pork sausages","olive oil","500 g higher-welfare lean minced beef","2 onions","2 cloves of garlic","1 large carrot","1 celery stick","1 courgette","2 tablespoons thick balsamic vinegar","2 x 400 g tins of plum tomatoes","1 heaped teaspoon tomato purée","450 g your favourite dried pasta","Parmesan cheese , to serve"],"instructions":"Place a large casserole pan on a medium-high heat to warm up. Squeeze the sausagemeat out of the skins. Drizzle 1 tablespoon of olive oil into the pan, add the minced beef and sausagemeat, breaking everything up with a spoon as you go, then cook for 5 minutes, stirring regularly. Peel the onions and garlic, trim the carrot, celery and courgette, then coarsely grate all the vegetables on a box grater, finely grating the garlic. Scrape into the pan, then reduce the heat to medium-low and cook for 10 minutes, or until soft and sweet, stirring occasionally. Add the balsamic vinegar, then scrunch in the tomatoes (or tip in and break up with a spoon as you go). Half-fill each tin with water, swirl around to pick up the last bits of tomato and pour it into the pan. Stir in the tomato purée and a pinch of black pepper, mash everything up with the spoon, then reduce the heat to low and leave to cook for 1 hour, or until thickened slightly. About 15 minutes before you’re ready to serve, cook the pasta in a large pan of boiling salted water according to the packet instructions, then drain, reserving a mugful of starchy cooking water. Carefully add the pasta to the sauce and stir well over the heat, loosening with a splash of pasta water, if needed. Divide between serving bowls, and finish with a good grating of Parmesan.","tags":["Beef","Pasta & risotto"],"time":{"prep":"","cook":"Time 1 hour 20 minutes","active":"","inactive":"","ready":"","total":"Time 1 hour 20 minutes"},"servings":"Serves 6","image":"https://cdn.jamieoliver.com/recipe-database/medium/159045334.jpg"}