{"name":"Cajun White Chicken Chili","description":"A creamy white chicken chili with a cajun flavour theme!","ingredients":["1 tablespoon oil","1 pound andouille sausage, sliced or diced","1 pound boneless and skinless chicken breasts or thighs","1 teaspoon cajun seasoning","1 tablespoon butter","1 cup onion, diced","1 cup celery, diced","1 cup bell pepper, diced","1 jalapeno pepper, finely diced*","4 cloves garlic, chopped","1 teaspoon ground cumin","1 tablespoon cajun seasoning","4 cups chicken broth","2 (14.5 ounce) cans white beans, rinsed and drained","1/2 cup salsa verde","1/2 cup sour cream (or crema or heavy cream or 4 ounces cream cheese)","1/4 cup parmigiano reggiano (parmesan cheese) (or cotija), grated","1 tablespoon lime juice (optional)","2 tablespoons cilantro (or parsley), chopped (optional)","2 green onions, thinly sliced (optional)","salt and pepper to taste"],"instructions":"Heat the oil in a large saucepan over medium heat, add the sausage and cook, about 5-7 minutes, before setting aside. Add the chicken, seasoned with cajun seasoning, and cook until lightly golden brown, about 5-7 minutes, before setting aside. Add the butter, let it melt, add the onion, celery, bell pepper and jalapeno, and cook until tender, about 7-10 minutes. Add the garlic, cumin, and cajun seasoning, and cook until fragrant, about a minute. Add the broth, beans, salsa verde, sausage, and chicken, bring to a boil, reduce the heat and simmer for 15 minutes. Turn off the heat, remove the chicken and shred or slice it before returning it to the pot. Add the sour cream and parmesan and let it melt. Add the lime juice, cilantro, and green onion before seasoning with salt and pepper to taste.","tags":["American","Avocado","Cajun and Creole","Chicken","Food","Gluten-free","Main Course","Meal Prep","One-Pan","One-Pot","Pork","Recipe","Soup","Stew","Texmex"],"time":{"prep":"15 minutes","cook":"45 minutes","active":"","inactive":"","ready":"","total":"1 hour"},"servings":"6","image":"https://www.closetcooking.com/wp-content/uploads/2023/02/Cajun-White-Chicken-Chili-1200-1837.jpg"}