{"name":"Caprese Sandwich","description":"This Caprese sandwich recipe is perfect for picnics! This vegetarian sandwich features tomatoes, fresh mozzarella and creamy basil sauce.","ingredients":["Two large or 4 smaller sandwiches","1 baguette (16 ounces)","1 tablespoon thick balsamic vinegar or balsamic glaze*","1 tablespoon extra-virgin olive oil","1 ½ cups baby arugula","1 mozzarella ball (8 ounces)","2 medium ripe tomatoes, sliced into ¼-inch thick rounds","Flaky sea salt or kosher salt","Creamy basil sauce (this makes extra**)","1 small or ½ medium clove garlic, roughly chopped","½ cup mayonnaise","½ cup (1 ounce) lightly packed fresh basil","¼ teaspoon fine sea salt","Lots of freshly ground black pepper, to taste"],"instructions":"\nPreheat the oven to 400 degrees Fahrenheit. Slice the bread in half lengthwise, then stack it back together and slice it down the middle to form two large sandwiches, or again to make 4 small. Place the sliced bread on a baking sheet with the cut sides facing up. Bake for 5 minutes, or until warmed through and turning lightly golden around the edges.\n \nIn the meantime, prepare the creamy basil sauce*: In a food processor, blitz the roughly chopped garlic to chop it more finely. Scrape down the sides, then add the mayo, basil, salt and pepper. Blend until smooth, then set aside.\n \n To assemble the sandwiches, lightly drizzle balsamic and olive oil over half of the cut sides of bread. Layer some arugula on top, then weigh it down with rounds of mozzarella. Top with the sliced tomato, then sprinkle the tomato lightly with flaky salt.\n \nSpread the basil sauce generously over the cut side of the remaining slices of bread. Place them face down over the tomatoes. Enjoy.\n","tags":["egg free","fall","Independence Day","Italian","main dishes","Mediterranean","nut free","pack for lunch","recipes","soy free","spring","summer"],"time":{"prep":"15 minutes","cook":"5 minutes","active":"","inactive":"","ready":"","total":"20 minutes"},"servings":"4 sandwiches","image":"https://cookieandkate.com/images/2020/10/sandwich-with-tomatoes-mozzarella.jpg"}