{"name":"Chicken wings, agrodolce-style","description":"Sticky, sweet and oh-so-delicious chicken wings – a cheap but tasty part of the bird. This is a very simple dish that invests in big flavours – great for a sharing starter or party food. ","ingredients":["4 cloves of garlic","3 large red onions","1 fresh red chilli","16 free-range chicken wings","1 small handful of raisins","olive oil","1 x 400 g tin of quality plum tomatoes","balsamic vinegar","runny honey","2 sprigs of fresh rosemary"],"instructions":"Preheat the oven to 170ºC/325ºF/gas 3. Peel and finely slice the garlic and onions, then deseed and finely slice the chilli. Layer up 2 large sheets of tin foil and pile the chicken wings in the middle. Season with a good pinch of sea salt and black pepper, gather up the sides of the foil to make a big bowl, add a splash of water then scrunch all of the edges of the foil to make a parcel. Pop the parcel onto a baking tray and cook in the oven for 45 minutes, or until the chicken is beautifully tender and the meat pulls away easily from the bone. Meanwhile, make your glaze. Soak the raisins in a cup of boiling water and set aside. Heat a lug of oil in a large frying pan over a medium heat, add the garlic, chilli and most of the sliced onion, saving a small handful for later. Cook for 10 to 15 minutes, or until everything is soft and sticky. Tip in the raisins, their soaking water and the tinned tomatoes, breaking them up with a spoon. Allow to bubble away for 10 to 15 minutes, or until thickened, then add 4 tablespoons each of the balsamic vinegar and honey. Take your time with it and don’t be tempted to cook it too quickly – it will be worth it! Season with salt and pepper, then add the mixture to a blender (or use a stick blender) to smooth the glaze. Don’t go mad as a bit of texture in the glaze is good. In a bowl, scrunch up the remaining onion slices with a pinch of salt and a good splash of vinegar and set aside – this will mellow the onions and they will add an incredible sharpness to cut through the sweetness of the deliciously dark, sticky, shiny glaze. Check the chicken wings are as tender as you like them. Heat a lug of oil in a large frying pan over a high heat, pick in the rosemary leaves and fry until crispy, then transfer to a small dish for later. Keep the pan hot, add the wings and fry until golden. Add the glaze and keep turning the wings to coat them (at this point you can add an extra drizzle of honey, if you like your wings extra sticky). Scatter with the quick-pickled onions and crispy rosemary, then get stuck in! Delicious served with griddled bruschetta, if you like.","tags":["Jamie Magazine","Chicken","Australia day","Mains","Starters"],"time":{"prep":"","cook":"Time 1 hour 15 minutes","active":"","inactive":"","ready":"","total":"Time 1 hour 15 minutes"},"servings":"Serves 4 - 6","image":"https://cdn.jamieoliver.com/recipe-database/medium/46257851.jpg"}