{"name":"Chicken Caesar Pasta Salad","description":"This Chicken Caesar Pasta Salad recipe is tossed with the best Caesar dressing, lots of Parmesan, and the yummiest garlicky breadcrumbs.","ingredients":["1 pound boneless skinless chicken breasts","fine sea salt and freshly-ground black pepper","1 tablespoon olive oil","1 pound uncooked pasta (I used farfalle)","3 Romaine lettuce hearts (12 ounces), roughly chopped","1 1/2 cups Caesar dressing*","Parmesan cheese, for topping","1 tablespoon butter","2 cloves garlic, pressed or minced","1/2 cup Panko breadcrumbs","fine sea salt and freshly-ground black pepper"],"instructions":"Prep the pasta water. Bring a large pot of generously-salted water to a boil over high heat. Cook the garlic breadcrumbs. Meanwhile, melt the butter over medium heat in a large sauté pan. Add the garlic and sauté for 1 minute, stirring frequently. Add the breadcrumbs along with a generous pinch of salt and pepper and sauté for 2-3 minutes, stirring frequently, until golden. Transfer the breadcrumbs to a bowl and set aside. Wipe down the sauté pan briefly until clean. Cook the chicken. Season the chicken generously on both sides with salt and pepper. Using the same sauté pan, heat the oil over medium-high heat until shimmering. Add the chicken and cook for 4-5 minutes per side until cooked through and no longer pink inside. Transfer the chicken to a clean cutting board and let it rest for 5-10 minutes, then thinly slice it into bite-sized pieces. Cook the pasta. Cook the pasta in the salted water until just al dente. Strain the pasta through a colander, then rinse it with cold water until chilled. Toss the pasta salad. Add the pasta, lettuce, chicken and Caesar dressing to a large mixing bowl and gently toss until evenly combined.  Serve. Serve immediately, garnished with the garlic breadcrumbs, lots of Parmesan cheese, and a few extra twists of black pepper. Or refrigerate in a sealed container for up to 4 hours and then serve chilled.","tags":["Main Dishes","Pastas"],"time":{"prep":"30 minutes","cook":"15 minutes","active":"","inactive":"","ready":"","total":"45 minutes"},"servings":"6-8 servings","image":"https://www.gimmesomeoven.com/wp-content/uploads/2015/08/Caesar-Pasta-Salad-Recipe-9.jpg"}