{"name":"Chicken Spaghetti","description":"This creamy Chicken Spaghetti recipe is made with a cheesy, luscious, cream sauce and baked to perfection. A pasta lover’s dream!","ingredients":["2 boneless, skinless chicken breasts (about 1.5 lb total)","1 Tbsp olive oil","1/2  Tbsp salt (for the pasta water)","8 oz spaghetti","1/4 cup salted butter","1 onion, diced","2 cloves garlic, minced","1/4 cup all-purpose flour","2 cups chicken broth","1/2 tsp salt","1/4 tsp  freshly cracked black pepper","1/2 tsp Italian seasoning","1 cup shredded cheddar cheese, divided","1 cup shredded mozzarella cheese, divided","1 cup heavy cream","1 10oz. can diced tomatoes with green chiles, drained (Rotel)"],"instructions":"Preheat the oven to 375°F. Using a sharp knife, carefully fillet each chicken breast into two thinner cutlets. Heat a large deep skillet over medium heat and add the olive oil. Add the four chicken cutlets to the skillet and cook on each side until golden brown and cooked through (about 7-10 minutes total). Remove the chicken to a clean cutting board, and allow it to rest. While the chicken is cooking, bring a large pot of water to a boil over high heat. Add 1/2 Tbsp of salt to the water then add the spaghetti pasta and boil until the pasta is tender (or al dente). Drain the pasta in a colander. While the pasta is cooking, start making the sauce. In the same skillet that the chicken was cooked in, heat the butter over medium-high heat. Add the diced onion and minced garlic. Sauté for 3-4 minutes or until onion is translucent. Sprinkle the flour into the skillet and stir with the onion and garlic. Cook for 2-3 minutes, stirring occasionally, until flour starts to turn golden brown. Slowly pour the chicken broth into the skillet and stir to fully dissolve the flour from the bottom of the skillet. The flour will start to thicken the sauce when it returns to a simmer. Add 1/2 tsp of salt, black pepper, Italian seasoning, 1/2 cup cheddar cheese, 1/2 cup mozzarella cheese, and the heavy cream to the skillet. Stir until the cheese is melted and the sauce is smooth. After the chicken breasts have rested, chop them into smaller ½ inch pieces.  Turn the heat off the skillet and add the drained diced tomatoes with green chiles, the chopped chicken, and the cooked spaghetti to the pan. Mix until combined. Add the chicken spaghetti mixture to a 9×13” casserole dish. Top with the remaining 1/2 cup of cheddar cheese and 1/2 cup of mozzarella cheese. Bake the casserole in the preheated oven for 25 minutes or until bubbly around the edges and cheese is melted. ","tags":[],"time":{"prep":"10 minutes mins","cook":"50 minutes mins","active":"","inactive":"","ready":"","total":"1 hour hr"},"servings":"6","image":"https://www.budgetbytes.com/wp-content/uploads/2023/11/Chicken-Spaghetti-Scoop.jpg"}