{"name":"Chicken & chorizo paella","description":"This is a quick and easy chicken paella recipe, featuring chicken thighs, chorizo, and flavourful paella rice—all cooked in one pot for a great-value meal.","ingredients":["2 cloves of garlic","1 onion","1 carrot","½ a bunch of fresh flat-leaf parsley , (15g)","70 g quality chorizo","2 free-range chicken thighs , skin off, bone out","olive oil","1 teaspoon sweet smoked paprika","1 red pepper","1 tablespoon tomato purée","1 organic chicken stock cube","300 g paella rice","100 g frozen peas","200 g frozen peeled cooked prawns , from sustainable sources","1 lemon"],"instructions":"Peel and finely slice the garlic, peel and roughly chop the onion and carrot. Finely chop the parsley stalks, then roughly chop the chorizo and chicken thighs. Put a lug of oil into a large lidded shallow casserole or paella pan on a medium heat, add the garlic, onion, carrot, parsley stalks, chorizo, chicken and paprika, and fry for around 5 minutes, stirring regularly. Deseed and chop the pepper, then add to the pan for a further 5 minutes. Stir through the tomato purée and crumble in the stock cube, then add the rice and stir for a couple of minutes so it starts to suck up all that lovely flavour. Pour in 750ml of boiling water and add a pinch of sea salt and black pepper. Pop the lid on and bring to the boil, then reduce to a simmer for 15 minutes, stirring regularly from the outside in and from the inside out, and adding a splash of water if needed. Stir in the peas and prawns, replace the lid, and cook for a further 5 minutes, or until hot through. Season to perfection, then chop the parsley leaves, scatter them over the paella, and serve with lemon wedges on the side for squeezing over.","tags":["Save with Jamie","Dinner Party","Spanish","Chicken","Pork","Seafood"],"time":{"prep":"","cook":"Time 50 minutes","active":"","inactive":"","ready":"","total":"Time 50 minutes"},"servings":"Serves 4","image":"https://cdn.jamieoliver.com/recipe-database/oldImages/medium/1083_1_1433953110.jpg"}