{"name":"Chocolate Zucchini Cake (healthy + gluten free)","description":"Fudgy chocolate zucchini cake that’s moist & naturally sweetened. This gluten free chocolate zucchini cake is the best summer dessert!","ingredients":["Wet ingredients:","1 medium zucchini, shredded and squeezed of excess moisture with a paper towel (1 cup shredded zucchini)","2 eggs","½ cup coconut sugar (or sub brown sugar)","⅓ cup pure maple syrup","1 (5.3 oz) container siggi's 0% vanilla yogurt","1 teaspoon vanilla extract","¼ cup virgin coconut oil, melted and cooled","Dry ingredients:","1 ½ cups packed fine blanched almond flour","½ cup oat flour","½ cup cacao powder (or sub unsweetened cocoa powder)","1 teaspoon baking soda","¼ teaspoon salt","½ cup chocolate chips","For the topping:","½ cup chocolate chips","1 teaspoon coconut oil","Maldon sea salt, for sprinkling on top","Raspberries to garnish"],"instructions":"Preheat the oven to 350 degrees F. Line an 8x8 inch pan with parchment paper and spray with nonstick cooking spray. First, measure out 1 heaping cup of shredded zucchini, then place shredded zucchini in a paper towel or cheese cloth and squeeze out all of the moisture/water. This is very important! Add shredded zucchini, eggs, coconut sugar, pure maple syrup, siggi’s yogurt, vanilla extract to a large bowl and whisk together until well combined. Finally stir in melted and cooled coconut oil until well combined. Next, add dry ingredients: almond flour, oat flour, cocoa powder, baking soda and salt. Mix together with a wooden spoon until well combined. Fold ½ cup chocolate chips into the batter. Pour batter into the prepared pan. Bake for 30-40 minutes or until a tester comes out clean. Allow the cake to cool for at least 30 minutes in the pan on a wire rack before topping it. Next make the topping: add chocolate chips and coconut oil to a medium bowl; microwave in 30 second increments, stirring in between, until chocolate is melted. Alternatively you can melt the chocolate in a saucepan over low heat. Once chocolate is melted, pour over the cake and tilt the pan side to side to help evenly distribute the chocolate and coat every inch of the cake. Finally, sprinkle a little sea salt on top if you’d like. Cut the cake into 12 slices. Serve with fresh raspberries or strawberries and enjoy! Store cake in the fridge after a day.","tags":[],"time":{"prep":"30 minutes minutes","cook":"30 minutes minutes","active":"","inactive":"","ready":"","total":"1 hour hour"},"servings":"12","image":"https://www.ambitiouskitchen.com/wp-content/uploads/2021/08/siggis-chocolate-zucchini-cake-4long.jpg"}