{"name":"Cilantro Chicken Meatballs in Mango Coconut Sauce","description":"Delicious cilantro chicken meatballs cooked in a flavorful mango coconut sauce for the perfect one pan meal that's packed with veggies.","ingredients":["For the meatballs:","1 pound 93% lean ground chicken (or lean ground turkey)","1 egg","½ cup panko breadcrumbs (or if GF sub 2-3 tablespoons coconut flour)","⅓ cup finely diced cilantro","¼ cup finely diced red onion","1 jalapeño, seeded and finely diced","3 cloves garlic, minced","½ tablespoon freshly grated ginger (or ½ teaspoon ground ginger)","½ teaspoon ground cumin","½ teaspoon turmeric","¼ teaspoon cayenne pepper","½ teaspoon salt","Freshly ground black pepper","1 tablespoon toasted sesame oil (can also use avocado oil or coconut oil)","For the coconut mango sauce:","1 (15 ounce) can light coconut milk","1 ½ cup diced mango (can use frozen, just make sure you thaw it first)","2 tablespoons gluten free soy sauce (or coconut aminos)","Add-ins:","1 red bell pepper, julienned","¾ cup frozen peas (or edamame)","To garnish:","Chopped honey roasted peanuts","Diced green onion","Fresh cilantro","Hot sauce, if desired"],"instructions":"First, make your mango coconut sauce. Add coconut milk, diced mango, and soy sauce to a blender and blend until smooth. Set aside. Next, form your meatballs. In a large bowl, add the ground chicken, egg, breadcrumbs, cilantro, red onion, jalapeño, garlic, ginger, cumin, turmeric, cayenne, salt and pepper. Use clean hands to mix and form into 16 golf ball sized meatballs. Place a large deep skillet over medium-high heat and add in sesame oil. Add the meatballs and brown on all sides, about 5-6 minutes total. You may need to do this in batches, depending on how many meatballs you can fit in your skillet without overcrowding them. Reduce the heat to medium-low and add your mango coconut sauce to the pan with the meatballs. Cover the pan, reduce heat to low, and simmer for 20 minutes. After 20 minutes, remove lid and gently stir in the peas and red bell pepper. Simmer for 5 more minutes uncovered. Serve with brown rice, quinoa or with spiralized zucchini or sweet potato. There will be lots of sauce, which makes it delicious! Garnish with chopped honey-roasted peanuts, scallions, cilantro, and top with hot sauce if desired. Serves 4","tags":[],"time":{"prep":"15 minutes minutes","cook":"30 minutes minutes","active":"","inactive":"","ready":"","total":"45 minutes minutes"},"servings":"4","image":"https://www.ambitiouskitchen.com/wp-content/uploads/2021/08/Cilantro-Chicken-Meatballs-Mango-Coconut-Sauce-3long.jpg"}