{"name":"Cinnamon Roll Bread","description":"This Cinnamon Roll Bread recipe takes just 10 minutes to throw together! It's a no yeast quick bread for breakfast, a snack or dessert!","ingredients":["1 cup white granulated sugar","2 cups all purpose flour spooned into measuring cup for accuracy","1 tablespoon baking powder","½ teaspoon salt","1 large egg","1 cup milk","⅓ cup vegetable oil","2 teaspoons cinnamon","⅓ cup white granulated sugar or brown sugar","4 tablespoons unsalted butter room temperature","2 cups powdered sugar","1 teaspoon pure vanilla extract substitute homemade or clear vanilla for a true white glaze","3 tablespoons milk or a tablespoon at a time until you achieve the desired consistency"],"instructions":"Preheat oven to 350°F. Grease 1½ pound loaf pan. Set aside. In a large mixing bowl with a spatula or stand mixer fitted with the paddle attachment, add sugar, flour, baking powder and salt. Whisk to combine on low speed. On low speed, beat in egg, milk and oil until just moist. In a small bowl, combine cinnamon and sugar. Pour half of batter into prepared loaf pan. Using a spoon, top with half of the cinnamon sugar mixture to evenly coat the top of the batter. Using your spoon, a knife or spatula, gently swirl in cinnamon sugar. Pour remaining batter over the top (pan should only be ⅔ full). Spoon to top with remaining cinnamon sugar and gently swirl. Place loaf pan in the center of preheated oven. Bake 1 hour or until a toothpick entered into the center comes out clean, watching bake time carefully to prevent over-baking. Allow loaf cool 10 minutes before releasing from loaf pan. In a medium mixing bowl or stand mixer fitted with the whisk attachment, combine butter, powdered sugar, vanilla and milk until smooth. Warm if needed and pour to drizzle over bread.Allow to set a few minutes before slicing.","tags":[],"time":{"prep":"10 minutes mins","cook":"50 minutes mins","active":"","inactive":"","ready":"","total":"1 hour hr"},"servings":"12","image":"https://julieblanner.com/wp-content/uploads/2018/10/cinnamon-roll-loaf-1.jpeg"}