{"name":"Classic Avocado Toast Recipe (+5 Delicious Variations)","description":"Looking for the original avocado toast recipe or new and inventive ways to make it? Then check out this post for the classic recipe and variations.","ingredients":["▢ 1 piece thick cut grainy bread","▢ ½ large ripe avocado","▢ 1-2 teaspoons freshly squeezed lemon juice","▢ Kosher salt and freshly cracked black pepper to taste","▢ ¼ cup halved cherry tomatoes","▢ 2 tablespoons Basil Vinaigrette","▢ 2 thin sliced smoked salmon","▢ 2 tablespoons thinly sliced red onions","▢ 1 egg, scrambled","▢ 1-2 pieces crispy bacon","▢ 2 tablespoons  goat cheese, crumbled","▢ 1 teaspoon freshly snipped chives","▢ ¼ cup pico de gallo"],"instructions":"For a Classic Avocado Toast Toast the piece of bread until the bread is just golden brown, about 2-3 minutes depending on the thickness of the bread.For the halved avocado, remove the pit from the avocado and discard. Remove the avocado from the skin and place the avocado flesh into a medium bowl and mash it with a fork and a squeeze of the fresh lemon juice. Season with salt and pepper as needed.Slater the mashed avocado on top of the toast. Add more salt and pepper is desired and serve immediately. For the Tomato Basil Toast Toss together the tomatoes and basil vinaigrette in a small bowl. Pile on top of the avocado toast and serve. Avocado Toast with Smoked Salmon and Red Onions Lay the smoked salmon on top of the avocado toast, followed by the red onions and serve. Avocado Toast with Bacon and Eggs Transfer the scrambled eggs on top of the avocado toast and add the bacon. Avocado Toast with Goat Cheese and Chives Sprinkle the goat cheese and chives on top of the avocado toast and serve. Avocado Toast with Pico de Gallo Sprinkle the pico de gallo  on top of the avocado toast and serve.","tags":["American"],"time":{"prep":"5 minutes mins","cook":"0 minutes mins","active":"","inactive":"","ready":"","total":"5 minutes mins"},"servings":"1 person","image":"https://whatsgabycooking.com/wp-content/uploads/WGC-Avocado-Toast-copy.jpg"}