{"name":"Classic minestrone","description":"A classic minestrone soup recipe from Jamie Oliver is a healthy, seasonal dish that will warm the whole family during the cold winter months.","ingredients":["4 rashers of higher-welfare smoked streaky bacon","2 red onions","2 cloves of garlic","2 carrots","2 sticks of celery","1 bulb of fennel","½ a bunch of fresh basil","olive oil","125 ml red wine","2 courgettes","300 g savoy cabbage or chard","2 x 400 g tins of quality plum tomatoes","1 x 400 g tin of cannellini beans","800 ml organic chicken or vegetable stock","75 g dried pasta (shells or odd ends)","extra virgin olive oil","Parmesan cheese"],"instructions":"Start by making a sofrito (frying off the aromatic ingredients to make the base of the soup). Slice the bacon, peel and finely chop the onions and garlic, then chop the carrots, celery and fennel. Pick the basil leaves, finely chopping the stalks. Heat a lug of oil in a pan over a medium-low heat, stir in the chopped ingredients and sauté gently for 15 to 20 minutes, or until everything is soft but not coloured. Halve and slice the courgettes lengthways. Core the cabbage or remove the tough stalky bits from the chard, then wash the leaves and finely slice. Add the wine to the softened veggies and bring to the boil. Tip in the tomatoes, breaking them up with a spoon, then add the courgettes. Bring back to the boil, and simmer on a low heat for around 15 minutes. Mix in the cabbage or chard, the beans and their juice and the stock. Bring to the boil, then add the pasta. Simmer over a medium heat until the pasta is cooked (use the packet instructions as a guide) – if the soup is too thick, add a little stock or water to loosen. Season to taste, then rip in most of the basil leaves and dress with a few lugs of extra virgin olive oil. Stir well, and serve with the reserved basil and a fine grating of Parmesan.","tags":["Jamie Magazine","Vegetables","Gorgeous Winter Soups","Mains","Starters","Courgette"],"time":{"prep":"","cook":"Time 1 hour","active":"","inactive":"","ready":"","total":"Time 1 hour"},"servings":"Serves 8","image":"https://cdn.jamieoliver.com/recipe-database/medium/46261012.jpg"}