{"name":"Claudio's aubergine parmigiana","description":"This cheesy baked aubergine dish tastes like proper comfort food, but looks good enough for a dinner party. ","ingredients":["1 large aubergine , (400g)","2 large free-range eggs","50 g plain flour","olive oil","150 g scamorza , (smoked mozzarella)","50 g buffalo mozzarella","1 teaspoon dried oregano","40 g Parmesan cheese","extra virgin olive oil","TOMATO SAUCE","2 cloves of garlic","1 bunch of fresh basil , (30g)","1 x 400 g tin of quality plum tomatoes"],"instructions":"Peel the aubergine using a speed-peeler, then very finely slice the skin into matchsticks and reserve for later. Slice the aubergine into ½cm-thick rounds – if you want to be really precise, use a circular cutter (roughly 7cm in diameter) to trim the slices into perfect discs – then season with sea salt. Whisk the eggs in a shallow bowl with a small pinch of salt and black pepper, and put the flour into another shallow bowl. Pour ½cm of olive oil into a large frying pan and heat gently over a medium heat. Working in batches, coat in the aubergine discs in flour, shaking off any excess, then gently drop into the beaten egg, letting any excess drip off, and carefully place into the hot oil. Fry for 3 to 4 minutes on each side, or until golden and crisp, then remove to kitchen paper to drain, and repeat with the remaining discs. For the tomato sauce, drizzle 1 tablespoon of olive oil into a pan over a medium heat. Peel and finely slice the garlic, along with the basil stalks and fry for 2 minutes, or until lightly golden. Scrunch the tomatoes into the pan through your clean hands, then season to perfection with a pinch of salt and pepper. Bring to the boil, then turn the heat down to low and simmer for 10 to 15 minutes, or until thickened and reduced. Finely slice half the basil leaves and stir them through the sauce a few minutes before the end, then remove from the heat and season to taste. When the aubergine discs are all fried, turn the heat up to high and fry the aubergine skin for 1 to 2 minutes, or until super-crisp, then drain on kitchen paper. Preheat the oven to 180ºC/350ºF/gas 4. To assemble, get yourself 4 small ovenproof dishes. Peel, then slice the scamorza into ½cm-thick slices. Add a spoonful of sauce to the bottom of each dish, place a slice of aubergine on top, followed by spoon of tomato sauce, a slice of scamorza and a little buffalo mozzarella. Sprinkle with a little oregano, and tear over a few basil leaves. Repeat the layers twice more, finishing with a layer of aubergine and a good grating of Parmesan. Bake for 10 to 12 minutes, or until the cheese has melted and is golden and bubbling. Serve the Parmigiana with the crispy aubergine skin sprinkled over the top and a drizzle of extra virgin olive oil.","tags":["Tomato","Italian"],"time":{"prep":"","cook":"Time 30 minutes","active":"","inactive":"","ready":"","total":"Time 30 minutes"},"servings":"Serves 4","image":"https://cdn.jamieoliver.com/recipe-database/medium/58419465.jpg"}