{"name":"Creamy Tahini Chicken Salad","description":"A creamy tahini sauce (made with lemon juice and tangy dijon mustard) solves the problem of creating a rich and well-dressed chicken salad without the mayo.","ingredients":["1½ lb. skinless, boneless chicken breasts (about 4 medium)","1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more","3 garlic cloves, finely grated","⅔ cup tahini","¼ cup fresh lemon juice","3 Tbsp. Dijon mustard","1 Tbsp. honey"," Freshly ground pepper","3 celery stalks, finely chopped","1 small red onion, finely chopped","1 jalapeño or serrano chile, halved, ribs and seeds removed, finely chopped","½ cup coarsely chopped tender herbs (such as parsley, dill, and/or tarragon)","⅓ cup coarsely chopped dried fruit (such as Medjool dates, apricots, and/or golden raisins)"," Butter or Little Gem lettuce leaves or toast (for serving)"],"instructions":"Place 1½ lb. skinless, boneless chicken breasts (about 4 medium) in a medium pot; pour in water to cover and season with kosher salt. Set over high heat and bring to a rolling boil. Remove from heat and let sit 15 minutes. Drain and transfer chicken to a cutting board; shred with 2 forks. Meanwhile, whisk 3 garlic cloves, finely grated, ⅔ cup tahini, ¼ cup fresh lemon juice, 3 Tbsp. Dijon mustard, 1 Tbsp. honey, 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, and ¼ cup water in a large bowl to combine; season generously with freshly ground pepper. Add shredded chicken, 3 celery stalks, finely chopped, 1 small red onion, finely chopped, 1 jalapeño or serrano chile, halved, ribs and seeds removed, finely chopped, ½ cup coarsely chopped tender herbs (such as parsley, dill, and/or tarragon), and ⅓ cup coarsely chopped dried fruit (such as Medjool dates, apricots, and/or golden raisins) and mix well. Season chicken salad with more salt and pepper if needed. Serve on butter or Little Gem lettuce leaves or toast.","tags":["main","dinner","lunch","dairy-free","gluten-free","nut-free","quick","30 minutes or less","weeknight meals","poach","salad","chicken breast","tahini","celery","lettuce","dill","parsley","tarragon"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":""},"servings":"","image":"https://assets.bonappetit.com/photos/663949ee0e11892f94ec80a0/16:9/w_1280,c_limit/BA-DIS_Tahini-Chicken-Salad_WEB.jpg"}