{"name":"Creamy Chicken And Orzo Skillet","description":"This easy and tasty Creamy Chicken and Orzo Skillet is a perfect dinner for those hectic nights when you barely have time to cook rice.","ingredients":["1 tsp paprika","1 tsp dried oregano","1 tsp dried thyme","1/2  tsp garlic powder","1/2  tsp onion powder","1/2  tsp salt","1/4 tsp pepper","1.25  lbs boneless chicken thighs (4-5 thighs)","2 Tbsp  cooking oil","1 yellow onion, diced","2 cloves garlic, minced","1 1/2 cups orzo","1 1/2 cups vegetable broth*","1/2 cup  heavy cream","2 Tbsp  salted butter","1/4 cup   parmesan"],"instructions":"Add the paprika, dried oregano, dried thyme, garlic powder, onion powder, salt, and pepper to a small bowl. Mix until combined. Blot the chicken thighs dry with a paper towel, then season both sides liberally with the seasoning blend.  Heat a large deep skillet over medium and add the cooking oil. Add the seasoned chicken thighs and cook undisturbed until well browned, about 5 minutes. Flip and repeat on the other side.  Remove the chicken from the pan. Turn the heat down to low, and add the onion and garlic. Saute until the onions are translucent, about 3 minutes.  Add the orzo and vegetable broth to the skillet and stir well to help dissolve the crispy browned bits from the bottom of the pan. Return the chicken to the pan and nestle it down into the orzo. Place a lid on the skillet, turn the heat up to medium-high, and let the broth come to a full boil. Then turn the heat down to low. Let the skillet simmer for about 15 minutes or until most of the broth is absorbed.  After about 15 minutes, the orzo should be tender and most of the broth absorbed, but there will still be a little sauce in the skillet. Remove the chicken from the skillet.  Add the cream and the butter to the skillet. Stir and heat over low until the butter melts and the cream is hot.  Add the Parmesan and stir to combine. Finally, return the chicken to the skillet. If desired, garnish with parsley.","tags":[],"time":{"prep":"15 minutes mins","cook":"30 minutes mins","active":"","inactive":"","ready":"","total":"45 minutes mins"},"servings":"4","image":"https://www.budgetbytes.com/wp-content/uploads/2023/04/ChickenandOrzoSkilletplated.jpg"}