{"name":"Crispy Zucchini Black Bean Tacos","description":"These crispy zucchini black bean tacos are quick and easy to make with an irresistible avocado dipping sauce. Crispy black bean tacos are always a winner...but let's sneak some extra veg in there too! ♡","ingredients":["1 tablespoon olive oil","1 small white onion, diced","1 medium (12-ounce) zucchini, diced into 1-cm pieces","4 large cloves garlic, minced","2 teaspoons chili powder","1 teaspoons each: fine sea salt, ground cumin","2 (15-ounce) cans black beans, rinsed and drained","1/2 cup beer or vegetable broth","12 small flour or corn tortillas","2 cups (8 ounces) shredded Mexican-blend cheese","1 ripe avocado, peeled and pitted","2 large cloves garlic","2 cups fresh cilantro leaves","1/3 cup lime juice","1 tablespoon honey","1 teaspoon each: fine sea salt, ground cumin"],"instructions":"Make the avocado sauce. Combine the avocado, garlic, cilantro, lime juice, honey, salt, cumin and ⅔ cup water in a blender. Pulse until smooth. (If you prefer a thinner sauce, just blend in a few extra splashes of water until the sauce reaches your desired consistency.) Sauté the veggies. Heat the oil over medium-high heat in a large nonstick sauté pan. Add the onion and zucchini and sauté, stirring occasionally, for 5-6 minutes or until cooked through. Add the garlic, chili powder, salt, cumin and sauté, stirring occasionally, for 2 minutes.  Mash the black bean filling. Scoot the veggie mixture to the edges of the pan and add the black beans and beer (or vegetable broth) to the empty space in the middle. Use a potato masher to gently mash most of the beans. Fold the veggie mixture into the black beans until evenly combined. Taste and season with additional salt and pepper if needed. (If the mixture seems too dry, you can also add in an extra splash of beer.) Assemble the tacos. Add about ⅓ cup of the black bean filling and a sprinkling of shredded cheese to each tortilla and gently fold in half to close. Repeat with the remaining tortillas and cheese until all of the black bean filling has been used. Cook the tacos. Clean the sauté pan and return it to the stove over medium heat. Mist the pan with olive oil spray, or drizzle a very thin layer of olive oil evenly around the pan. Add 3 tacos (or however many will fit in a single layer) and cook for 1 minute per side or until the bottom of the tortilla is lightly golden and crispy. Carefully flip the tacos and cook for 1 minute on the second side, then transfer the tacos to a serving plate. Repeat with the remaining tacos, adding more oil to grease the pan each time and adjusting the heat if needed so that the pan does not overheat. Serve. Serve the tacos immediately with the avocado sauce for dipping and enjoy!","tags":["Main Dishes","Mexican-Inspired"],"time":{"prep":"25 mins","cook":"20 mins","active":"","inactive":"","ready":"","total":"45 mins"},"servings":"12 tacos","image":"https://www.gimmesomeoven.com/wp-content/uploads/2024/05/Crispy-Zucchini-Black-Bean-Tacos-11.jpg"}