{"name":"Crunchy garlic chicken","description":"Our crunchy garlic chicken is beautifully crispy, tender and delicious; the same technique can be used with pork, cod and more for a warm golden finish.","ingredients":["1 clove of garlic","1 lemon","6 saltine crackers","2 tablespoons unsalted butter","4 sprigs of fresh Italian parsley","sea salt","freshly ground black pepper","2 heaped tablespoons all-purpose flour","1 large free-range egg","2 skinless free-range chicken breast fillets","olive oil"],"instructions":"Peel the garlic and zest the lemon. Put the crackers into a food processor with the butter, garlic, parsley sprigs, lemon zest and a pinch of sea salt and black pepper, then whiz until the mixture is very fine, and pour on to a plate. Sprinkle the flour on to a second plate. Crack the egg into a small bowl and beat with a fork. Lightly score the underside of the chicken breasts. Put a square of clingfilm over each one and bash a few times with the bottom of a pan until the breasts flatten out a bit. Dip the chicken into the flour until both sides are completely coated, then dip into the egg and finally into the flavoured crumbs. Push the crumbs on to the chicken breasts so they stick – you want the meat to be totally coated. You can either bake or fry the chicken. If baking, preheat your oven to full whack (240°C/475ºF/gas 9), place your chicken on a sheet pan and cook for 15 minutes. If frying, put a frying pan on a medium heat, pour in a few good lugs of olive oil and cook the chicken breasts for 4 to 5 minutes on each side, or until cooked through, golden and crisp. Either serve the chicken breasts whole, or cut them into strips and pile them on a plate. Beautiful and simple served with a lemon wedge for squeezing over, and a tiny sprinkling of salt. Great with a lovely fresh salad or simply dressed veggies.","tags":["Jamie's Ministry of Food","Chicken","Chicken breast"],"time":{"prep":"","cook":"Time 25 minutes","active":"","inactive":"","ready":"","total":"Time 25 minutes"},"servings":"Serves 2","image":"https://cdn.jamieoliver.com/recipe-database/oldImages/medium/174_1_1436778767.jpg"}