{"name":"Curried Sweet Chili Ribs","description":"In this hands-off recipe, spareribs seasoned in a blend of curry powder, ginger, garlic, and lime zest are slow cooked until falling-off-the-bone tender.","ingredients":["3 Tbsp. Diamond Crystal or 1 Tbsp. plus 2¼ tsp. Morton kosher salt","2 Tbsp. Madras curry powder","1 Tbsp. garlic powder","1 tsp. crushed red pepper flakes","1 tsp. finely grated lime zest","1 tsp. freshly cracked pepper","1 tsp. ground ginger","1 tsp. ground turmeric","2 racks St. Louis–style pork spareribs (3½–4 lb. total)","2 small onions, thinly sliced","1 Tbsp. unsalted butter or refined coconut oil","1 Tbsp. Madras curry powder","5 garlic cloves, finely chopped","2 Tbsp. finely chopped onion","1 Tbsp. tomato paste","1 cup sweet chili sauce (such as Mae Ploy)","¼ cup ketchup","1 Tbsp. hot sauce"," Vegetable oil (optional)"],"instructions":"Place a rack in middle of oven and preheat to 300°. Mix 3 Tbsp. Diamond Crystal or 1 Tbsp. plus 2¼ tsp. Morton kosher salt, 2 Tbsp. Madras curry powder, 1 Tbsp. garlic powder, 1 tsp. crushed red pepper flakes, 1 tsp. finely grated lime zest, 1 tsp. freshly cracked black pepper, 1 tsp. ground ginger, and 1 tsp. ground turmeric in a small bowl to combine. Sprinkle spice mixture all over 2 racks St. Louis–style pork spareribs (3½–4 lb. total). Scatter 2 small onions, thinly sliced, over 2 large sheets of foil. Set a rack on top of each one; wrap up tightly, using more sheets if needed to cover completely. Place on a baking sheet (if ribs are too large, divide between 2 baking sheets). Bake until a fork slides easily into meat but it is not falling apart, about 3 hours. Remove ribs from oven. Increase oven temperature to 450°. Heat 1 Tbsp. unsalted butter or refined coconut oil in a small saucepan over medium until melted and starting to bubble. Add 1 Tbsp. Madras curry powder and cook, stirring, until fragrant, about 45 seconds. Add 5 garlic cloves, finely chopped, and 2 Tbsp. finely chopped onion; cook, stirring constantly, until fragrant, about 2 minutes. Add 1 Tbsp. tomato paste; cook, stirring often, until slightly darkened in color, about 3 minutes. Stir in 1 cup sweet chili sauce, ¼ cup ketchup, and 1 Tbsp. hot sauce and bring to a simmer. Reduce heat to low; simmer gently until thickened, 8–10 minutes. Unwrap ribs; discard foil and onions. Using a spoon, evenly coat tops of ribs with glaze. (You might have a little left over depending on the size of your ribs.) Bake until a crust forms on ribs, 7–9 minutes. Working one at a time, transfer to a cutting board; cut between ribs to serve. If tailgating and grilling, prepare ribs through baking in foil, then let cool and chill. Prepare glaze in advance and follow do-ahead instructions. When ready to serve, prepare a grill for medium-high heat; brush grate with vegetable oil. Brush glaze on both sides of ribs and grill, turning halfway through, until deeply browned and charred in spots, 8–10 minutes. Do Ahead: Ribs can be made 3 days ahead; let cool. Transfer to an airtight container and chill. Reheat, uncovered, on a baking sheet in a 350° oven. Sauce can be made 2 days ahead; transfer to an airtight container. Cover and chill.","tags":["dinner","main","pork rib","make ahead","oven bake","dairy-free","gluten-free","nut-free","fourth of july","memorial day","labor day"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":""},"servings":"","image":"https://assets.bonappetit.com/photos/667c81fc662c220e06f5b999/16:9/w_1280,c_limit/BA_0824_SAM_FORE_SHOT_02_191.JPG"}