{"name":"Damn Good Peanut Butter Banana Cake (gluten free, grain free)","description":"Gluten free & grain free peanut butter banana cake with peanut butter frosting & delicious mini chocolate chips. The best healthy banana cake ever!","ingredients":["Wet ingredients","3 very overripe medium bananas, mashed (1 ¼ cup mashed overripe banana)","4 large eggs, at room temperature","¾ cup (234g) pure maple syrup","¾ cup (192g) natural creamy peanut butter (only peanuts & salt as ingredients)","2 teaspoons vanilla extract","Dry ingredients","2 cups (224g) packed super fine blanched almond flour (I use Bob's Red Mill)","½ cup (56g) coconut flour (do not pack)","1 teaspoon baking soda","½ teaspoon salt","1 cup (180g) mini chocolate chips, dairy free if desired","For the frosting:","½ cup (113g) butter, at room temperature (or sub vegan butter)","½ cup (128g) natural creamy peanut butter (just peanuts + salt)","2 cups (226g) powdered sugar","1 teaspoon vanilla","2-3 tablespoons unsweetened almond milk (or milk of choice), to make the frosting creamy","To garnish the cake:","Mini chocolate chips around the edges of the cake"],"instructions":"Preheat oven to 350 degrees F. Line the bottom of three 6-inch round cake pans or two 8-inch round cake pans with parchment paper rounds. Spray parchment paper and sides of pan with nonstick cooking spray. YOU SHOULD USE PARCHMENT PAPER or the cake is likely to stick. Please do not forget. In a large bowl, whisk together mashed bananas, eggs, pure maple syrup, peanut butter and vanilla extract until smooth. In a large bowl, whisk the almond flour, coconut flour, baking soda and salt together. Set aside. Add dry ingredients to wet ingredients and mix with a wooden spoon until well combined. Fold in mini chocolate chips. Divide batter evenly between pans and spread out with a spatula to smooth the tops. Bake for 20-30 minutes if using two 8-inch pans and 25-35 minutes for three 6-inch pans. Cakes are done when a tester comes out clean or with just a few crumbs attached. Allow cake to cool completely before frosting or removing from the pans. The cake should be room temperature or cold when you frost it. This is very important. Cakes can be made a day ahead and stored in the fridge if you’d like. Make your frosting: In the bowl of an electric mixer, add the softened butter and peanut butter and whip on high until light and fluffy. Add powdered sugar, vanilla and 2 tablespoons almond milk. Beat slow at first, then increase speed to high and beat for approximately two minutes. Frosting should be nice and creamy, if you want it extra creamy, add another tablespoon of almond milk and beat again. Now it’s time to frost the cake: place about 1-2 tablespoons down onto the cake stand and spread out. Invert 1 cake onto the cake stand, add about ½ heaping cup frosting between each layer, repeat with each cake, then frost the top and sides of the cake with the remaining frosting. If you’d like, you can do a crumb coat for the frosting first (to avoid crumbs in the frosting) by doing the following: Frost the layers as you normally would and then coat the outside of the cake with a very thin layer of frosting and place in fridge for 10-15 minutes before you finish frosting. This is so that the crumbs stick to this layer of frosting and not your main layer. Cake will stay good for 5-7 days in the fridge, and should be covered to ensure freshness. Serves 16.","tags":[],"time":{"prep":"30 minutes minutes","cook":"30 minutes minutes","active":"","inactive":"","ready":"","total":"1 hour hour"},"servings":"16","image":"https://www.ambitiouskitchen.com/wp-content/uploads/2020/02/Grain-Free-Peanut-Butter-Banana-Cake-5long.jpg"}