{"name":"Easy Basque Cheesecake","description":"An Easy Basque Cheesecake — the kind with the caramelized top that contrasts gorgeously with the creamy interior — that’s quick to make, fuss-free, and perfectly sized to take everywhere you want t…","ingredients":["2/3 cup (130 grams) granulated sugar","1/3 cup (45 grams) cornstarch","1/2 teaspoon kosher salt","1 pound cream cheese (2 8-ounce/227-gram packages) [see Note at end]","3 large eggs","2 teaspoons (10 ml) vanilla extract or 1 teaspoon vanilla extract plus 1 teaspoon vanilla bean paste","2 tablespoons (30 ml) lemon juice","1 cup (235 ml) heavy cream"],"instructions":"Heat oven to 425°F (218°C). Line a loaf pan (see Note at the end about size) with one big piece of parchment paper pressed into the corners and up the sides. I leave the excess paper extended up over the rim, which also helps protect you against overflow. Place loaf pan on a rimmed baking sheet, just in case there’s overflow (but I’ve never had any).  In a food processor or high-speed blender: Blend the sugar, cornstarch, and salt into the empty workbowl to combine. (Make sure the lid is on or the cornstarch will escape in a cloud of dust.) Cut the cold cream cheese into large chunks and add to the sugar mixture and blend until completely combined and the cream cheese is soft, scraping down the bowl once or twice. Add eggs, one at a time, and blend to combine then scrape down the sides of the workbowl (yes, each time). With the third egg, add the vanilla and lemon juice too before blending and scraping down the sides one more time. Add the cream and blend to evenly combine. With a handmixer: Combine sugar, cornstarch, and salt in a large mixing bowl. Add softened cream cheese and beat to combine, scraping down the bowl a few times as you do to make sure there’s no unmixed cream cheese. Add eggs, one at a time, beating to combine and scraping down the bowl between each. With the third egg, add the vanilla and lemon juice too before blending and scraping down the bowl one more time. Pour in the cream, beating on low speed until combined. All methods: Pour into prepared pan, making sure it all lands inside the parchment paper sling. Transfer to oven and bake for 40 to 50 minutes or until puffed, deeply golden brown, and moderately jiggly when the pan is shimmied. [Mine registered an internal temperature of 190 to 200°F, which is much higher than a typical cheesecake but the texture was perfect.] To finish and serve: Transfer cake in loaf pan to a cooling rack and cool at room temperature for 1 to 2 hours or transfer to the fridge and cool for one hour. The cheesecake can be served cool or at room temperature; the latter is traditional but both are delicious.  Use parchment paper to lift and remove cheesecake from loaf pan and transfer to a plate. Cut into just shy of 1-inch slices.  Do ahead: Leftover basque cheesecake keeps in the fridge for 5 to 7 days. Notes:  Cream cheese temperature: For the food processor option, the cream cheese can be cold from the fridge. For the handmixer, you’ll want the cream cheese at room temperature, softened. Loaf pan size: Since, like my blueberry muffin loaf, pumpkin loaf, and others, this yields a very full loaf pan, here is my standard disclaimer about loaf pan size: Very key here is the size of your loaf pan because this will fill out every speck of it before it is done. Mine holds 6 liquid cups (or 1420 ml); it’s 8×4 inches on the bottom and 9×5 inches on the top. If yours is even slightly smaller or you’re nervous, go ahead and scoop out a little to make a muffin or two on the side. When making this for the first time, place a sheet pan underneath, just in case it spills over but I can promise you that in many tests, mine never has. Baking temperature: I tested this many, many times at both 425°F and 450°F and even as of this publication moment, I’m torn on the “best” temperature. 450°F will bake in 40 minutes, tops, and has a more dramatically dark top. But, not everyone likes theirs that dark. 425°F can take up to 50 minutes and looks the way you see it here, deeply brown in areas but not throughout. Here’s the upshot: If yours doesn’t come out as dark as you’d like it, go for the higher temperature next time. Chocolate Basque Cheesecake: My husband has been asking for a chocolate version of this forever, and I finally caved for Father’s Day. I didn’t expect to love it too, but it was excellent and gone too fast. The adjustment is simple. I melted 5.5 ounces chopped semisweet chocolate into a splash of the cream, then whisked in rest of cold cream to cool it to room temperature. Add when you add the cream in the recipe above. I skipped the lemon juice. The pan is even fuller, so be careful, but mine didn’t spill over thanks to the extended sides of the sling of parchment paper.","tags":["Cake","Gluten-Free","Recipe"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":"1 hour"},"servings":"8 to 10","image":"https://i0.wp.com/smittenkitchen.com/wp-content/uploads/2024/06/basque-cheesecake-5-scaled.jpg?fit=1200%2C800&ssl=1"}