{"name":"Easy No-Bake Granola Bars","description":"This granola bar recipe is so easy and delicious! These wholesome granola bars are naturally sweetened, gluten free, and the perfect healthy snack.","ingredients":["1 ¾ cups old-fashioned oats or quick-cooking oats","1 teaspoon ground cinnamon","½ teaspoon fine sea salt (if using regular table salt, scale back a bit)","2 cups mix-ins* (nuts, seeds, chocolate, shredded coconut or dried fruit)","1 cup creamy peanut butter or almond butter","½ cup honey or maple syrup","1 teaspoon vanilla extract"],"instructions":"Line a 9-inch square baker with two strips of criss-crossed parchment paper, cut to fit neatly against the base and up the sides. The parchment paper will make it easy for you to slice the bars later. Place the oats in a large mixing bowl**. Add the cinnamon and salt, and stir to combine. Set aside. Now we’ll blitz the mix-ins briefly in the food processor or blender (or, you can chop them by hand). Add any large nuts (like almonds or pecans) first and blitz for a few seconds. Then add the rest and run the machine for a few more seconds, until the ingredients are all broken up into pieces smaller than your pinky nail. Pour the mix-ins into the bowl of oats. \nIn a 2-cup liquid measuring cup, measure out the nut butter. Top with ½ cup honey and the vanilla extract. Stir until well blended. If you must, you can gently warm the liquid mixture on the stovetop or in the microwave, but make sure it’s close to room temperature before you pour it into the dry mixture (this is especially important if using chocolate, since it will melt).\n \nPour the liquid ingredients into the dry ingredients. Use a big spoon to mix them together until the two are evenly combined and no dry oats remain. This takes some arm muscles, but you can do it! If the mixture was easy to mix together, that’s a sign that you need to add some more oats—sprinkle in more oats until you can’t incorporate any more.\n \nTransfer the mixture to the prepared square baker. Use your spoon to arrange the mixture fairly evenly in the baker, then use the bottom of a flat, round surface (like a short, sturdy drinking glass) to pack the mixture down as firmly and evenly as possible.\n \nCover the baker and refrigerate for at least one hour, or preferably overnight. (The oats need time to soak up some of the moisture so they aren’t sticky.) When you’re ready to slice, lift the bars out of the baker by grabbing both pieces of parchment paper on opposite corners. Use a sharp knife to slice the bars into 4 even columns and 4 even rows.\n \nWrap individual bars in plastic wrap or parchment paper (if you store them all together, they will stick to one another). Bars keep well for several days at room temperature, a couple of weeks in the fridge, or several months in a freezer-safe bag in the freezer for best flavor.\n","tags":["breakfast","budget friendly","dairy free","egg free","fall","favorites","gluten free","naturally sweetened","pack for lunch","pantry friendly","recipes","snacks","soy free","spring","summer","tomato free","vegan","winter"],"time":{"prep":"20 minutes","cook":"","active":"","inactive":"","ready":"","total":"20 minutes (plus 1-hour chill time)"},"servings":"16 bars","image":"https://cookieandkate.com/images/2020/04/best-granola-bars-recipe-1.jpg"}