{"name":"Easy Pesto Chicken and VegetablesBlack Bean ChiliOne Pot Cheeseburger PastaCurried Chickpeas with SpinachPork and Peanut Dragon NoodlesOne Pot Beef StroganoffBeef and Cabbage Stir FrySouthwest Chicken SkilletBacon and Spinach Pasta with ParmesanSheet Pan Kielbasa Potatoes and Green BeansEasy Rosemary Garlic White Bean SoupOne Pot Sausage and Sun Dried Tomato PastaBlackened Salmon with ZucchiniCreamy Tomato and Spinach PastaVegan Creamy Mushroom RamenCajun Sausage and Rice SkilletEggplant Mozzarella SandwichesGarlic Noodles with Beef and BroccoliPasta with Bacon and Peas","description":"19 of our favorite quick and easy dinner ideas for busy weeknights that will get dinner on the table fast! Cheap, easy, and delicious!","ingredients":["8 oz. pasta*","6 oz. bacon","1 small onion","1 cup frozen peas","1/4 cup grated Parmesan","1/4 tsp salt","1/4 tsp freshly cracked black pepper","1/8 tsp crushed red pepper (optional)"],"instructions":"Bring a pot of water to a boil for the pasta. Once boiling, add the pasta and continue to boil until the pasta is tender (7-10 minutes). Reserve about a half cup of the starchy pasta water before draining the pasta in a colander. While the pasta is boiling, cook the bacon. Add the bacon to a large skillet and cook over medium heat until brown and crispy. Transfer the cooked bacon to a paper towel lined plate with a slotted spoon. Drain most of the bacon grease from the pan, leaving about 2 Tbsp. While the bacon is cooking, finely dice the onion. Add the diced onion to the remaining bacon grease and sauté until tender (about 5 minutes). Add the frozen peas and about ¼ cup of the reserved pasta water to the skillet. Continue to cook and stir until the peas have heated through. Add the drained pasta to the skillet, stir to combine, and remove from the heat. Top the pasta with Parmesan, salt, pepper, crushed red pepper, and crumbled bacon. Stir to combine. Taste and adjust the salt and pepper to your liking. ","tags":[],"time":{"prep":"5 minutes mins","cook":"20 minutes mins","active":"","inactive":"","ready":"","total":"25 minutes mins"},"servings":"3","image":"https://www.budgetbytes.com/wp-content/uploads/2018/06/Easy-Dinner-Ideas-H.jpg"}