{"name":"Easy Cherry Turnovers","description":"This absurdly easy recipe for cherry turnovers from legendary pastry chef Claudia Fleming wraps both sweet and sour cherries in flaky store-bought puff pastry.","ingredients":["1½ cups pitted dark sweet cherries","1½ cups pitted sour cherries","¼ cup (50 g) granulated sugar","2 tsp. cornstarch","1 tsp. fresh lemon juice","½ tsp. vanilla extract","1 (17.3-oz.) package frozen puff pastry (2 sheets), thawed"," All-purpose flour, for surface","1 large egg","2 Tbsp. raw sugar, such as turbinado"],"instructions":"Combine 1½ cups pitted dark sweet cherries, 1½ cups pitted sour cherries, ¼ cup (50 g) granulated sugar, 2 tsp. cornstarch, 1 tsp. fresh lemon juice, and ½ tsp. vanilla extract in medium saucepan; toss to coat. Let cherry mixture stand 30 minutes at room temperature to coax out juices. Stir mixture gently over medium-high heat until juices boil and thicken slightly, about 2 minutes. Cool cherry pie filling completely. Position rack in center of oven and preheat to 375ºF. Roll out 1 puff pastry sheet on lightly floured surface to 11½\" square. Cut into 4 equal squares. Repeat with second puff pastry sheet. Arrange 6 pastry squares like diamonds on surface, spacing apart (reserve remaining 2 squares puff pastry for another use). Place ⅙ of cherry pie filling in center of lower half of each pastry diamond. Beat 1 large egg in a small bowl to blend. Brush edges of pastry with beaten egg, then fold top half of pastry over lower half to form a triangle. Press firmly on pastry edges to adhere, then fold edges over, enclosing filling completely and creating double edges; press with fork to seal. Place turnovers on large parchment-lined rimmed baking sheet, spacing 2–3\" apart. Using tines of fork, pierce top crust of each turnover in 3 places to allow steam to escape during baking. Brush tops and edges of turnovers with beaten egg; sprinkle with 2 Tbsp. raw sugar. Bake turnovers until crust is golden brown and filling is bubbling thickly through steam holes in crust, about 35 minutes. Cool slightly. Serve turnovers warm or at room temperature. Do Ahead: Cherry pie filling can be made 1 day ahead. Cover and chill. Editor’s note: This recipe for cherry turnovers was first printed in our July 2008 issue. Head this way for more of our favorite recipes with puff pastry →","tags":["baking","dessert","fruit dessert","pastries","cherry","puff pastry","summer","nut-free","breakfast","brunch"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":""},"servings":"","image":"https://assets.bonappetit.com/photos/668eae781f4266a98ff05923/16:9/w_1280,c_limit/Cherry-Turnovers_Web.jpg"}