{"name":"Egg tortilla wrap","description":"Have a go at making your own tortillas in this lovely little recipe. Load them up with fresh salsa and smashed avocado for a quick and delicious lunchtime treat!","ingredients":["85 g wholemeal flour","olive oil","1 large ripe tomato (150g)","3 spring onions","1 small red pepper","½ a bunch of basil (15g)","red wine vinegar","½ a ripe avocado","4 medium free-range eggs","20 g Cheddar cheese"],"instructions":"Tip the flour into a mixing bowl, add a pinch of sea salt, then make a well in the middle. Pour in 50ml of warm water and 1 tablespoon of olive oil, then use a fork to bring in the flour from the outside to form a dough – when the dough starts to come together, dust your hands with flour and pat it into a ball. Knead on a flour-dusted surface for a few minutes, or until smooth and elastic. Leave to rest for 30 minutes. Deseed the tomato and roughly chop three-quarters of it, trim and finely slice 2 spring onions and deseed and finely chop the pepper, then scrape into a bowl. Tear in the basil leaves, drizzle with 1 teaspoon each of olive oil and red wine vinegar, then toss together and season to taste. Peel and destone the avocado (if needed), scoop into a bowl, then mash with a fork. Trim the remaining spring onion and finely dice with the leftover tomato, then stir into the avocado. Split the dough in half, roll each piece into a ball, then use a rolling pin to roll each one out into a circle, roughly 24cm in diameter. Put a 24cm non-stick frying pan on a medium heat and, one at a time, cook the tortillas for 1 minute on each side, then remove. Beat the eggs in a jug with a pinch of salt and black pepper. Drizzle 1 teaspoon of olive oil into the pan, then carefully wipe it round with a ball of kitchen paper. Pour in half the egg, tilt the pan to coat, place a cooked tortilla on top and cook for 1 minute, then flip. Finely grate over half the cheese, leave for 30 seconds to 1 minute to melt, then slide carefully on to a plate. Spread half the smashed avo on to the tortilla, scatter over half the tomato salsa, then roll up. Repeat with the rest of the ingredients.","tags":["Sandwiches & wraps"],"time":{"prep":"","cook":"Time 25 minutes plus resting","active":"","inactive":"","ready":"","total":"Time 25 minutes plus resting"},"servings":"Serves 2","image":"https://cdn.jamieoliver.com/recipe-database/medium/158952249.jpg"}