{"name":"Endless Summer Tomato Noodle Salad","description":"A spicy, slurpy peanutty noodle salad designed to show off summer’s best tomatoes. You can hardly call it cooking.","ingredients":["8–9 oz. dried udon noodles or spaghetti"," Vegetable oil (for noodles)","12 oz. ripe beefsteak or heirloom tomatoes (1–2 large)","⅓ cup creamy peanut butter","¼ cup apple cider vinegar","¼ cup chili crisp","3 Tbsp. soy sauce","4 tsp. sugar","4 oz. cherry tomatoes, halved, quartered if large","⅓ cup salted roasted peanuts, preferably cocktail","⅓ cup store-bought fried shallots"," Thinly sliced scallions and coarsely chopped cilantro (for serving)"],"instructions":"Cook 8–9 oz. dried udon noodles or spaghetti in a medium pot of boiling salted water 1 minute longer than package directions. Drain noodles in a colander and rinse under cool running water. Drizzle with a bit of vegetable oil (about 1 tsp.; this will keep the noodles from sticking) and toss to coat. Set noodles aside. Meanwhile, slice a thin round off the bottoms of 12 oz. ripe beefsteak or heirloom tomatoes (1–2 large). Starting at cut end, grate tomatoes on the largest holes of a box grater over a large bowl until all that’s left is the flattened tomato skin and stem; discard. Add ⅓ cup creamy peanut butter, ¼ cup apple cider vinegar, ¼ cup chili crisp, 3 Tbsp. soy sauce, and 4 tsp. sugar and whisk vigorously until sauce is smooth and emulsified. Add 4 oz. cherry tomatoes, halved, quartered if large, and reserved noodles to sauce and toss until well coated. Arrange noodle salad on a platter and top with ⅓ cup salted roasted peanuts, preferably cocktail, and ⅓ cup store-bought fried shallots. Scatter thinly sliced scallions and coarsely chopped cilantro over.","tags":["lunch","main","dinner","quick","easy","30 minutes or less","dairy-free","vegetarian","vegan","pasta salad","summer","heirloom tomato","udon noodle","spaghetti","peanut butter","peanut","cherry tomato"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":""},"servings":"","image":"https://assets.bonappetit.com/photos/667c2835662c220e06f5b98d/16:9/w_1280,c_limit/cold-tomato-peanut-noodle-salad_LEDE_061124_2064_VOG_final.jpg"}