{"name":"Fajita Veggie and Halloumi Bowls","description":"These hearty bowls feature roasted halloumi cheese and fajita veggies over beans and rice. This recipe is an amazing vegetarian dinner!","ingredients":["3 bell peppers (red, orange or yellow)","1 medium red onion","2 tablespoons olive oil ","1 teaspoon chili powder","½ teaspoon cumin","½ teaspoon garlic powder","¼ teaspoon fine salt","10 twists of freshly ground black pepper","2 tablespoons lime juice","½ pound or more* halloumi cheese ","½ tablespoon olive oil","¼ teaspoon chipotle powder or smoked paprika (optional, for heat)","1 cup long-grain brown rice or brown basmati rice, rinsed well","2 tablespoons chopped fresh cilantro","2 tablespoons lime juice","½ teaspoon fine salt","1 can (15 ounces) black beans, rinsed and drained, or 1 ½ cups cooked black beans","Topping suggestions: Fresh cilantro, sliced avocado or dollops of guacamole, halved cherry tomatoes, sour cream"],"instructions":"Preheat the oven to 425 degrees Fahrenheit. Line two large, rimmed baking sheets with parchment paper. Bring a large pot of water to boil over high heat for the rice.  Slice the peppers and onion into ½-inch wide long strips, keeping the chunks of onion intact as best you can.  Place the peppers and onion on one prepared baking sheet. Drizzle them with the olive oil, chili powder, cumin, garlic powder, salt and pepper (save the lime juice for later). Toss until all of the ingredients are lightly coated, then arrange them in an even layer across the pan. Rearrange any single onion pieces from the outer edges to the interior of the pan, as they tend to burn otherwise. Bake the peppers and onions on the middle rack for 15 minutes.  Once the pot of water is boiling, pour in the rice. Give the mixture a brief stir and let it boil for 30 minutes, reducing the heat if necessary to prevent overflow. Drain the rice, return it to the pot, cover, and let it rest for 10 minutes off the heat.  Meanwhile, lightly pat the halloumi dry. Slice the halloumi lengthwise into pieces ¼ to ½ inch thick, then cut or tear the slabs into small, bite-sized pieces about 1-inch long. On the remaining baking sheet, drizzle the halloumi with ½ tablespoon olive oil and sprinkle all over with the optional chipotle powder. Toss until lightly coated, and arrange them in an even layer.  Once the timer goes off for the peppers, remove them from the oven, stir and redistribute. Again move any single onion pieces to the middle, then return the baking sheet to the oven. When you do that, place the pan of halloumi on the top rack. After 10 minutes, stir and flip the cheese, moving any browning pieces more toward the middle. Return it to the oven for up to 5 more minutes, keeping a close eye on it as the cheese tends to brown quickly toward the end. Continue baking the pepper mixture until the peppers and onions are tender and deeply caramelized. They are typically done around the time that the halloumi is finished.  While the peppers are hot out of the oven, drizzle the lime juice on top and stir to combine. Season to taste with additional salt and pepper. To finish the rice, fluff it with a fork, then stir in the cilantro, lime juice, and salt. Add the black beans and gently stir to combine. Cover until you’re ready to serve. To assemble, divide the rice between four bowls, followed by the pepper mixture and cheese. Finish with any desired toppings, and enjoy warm. Leftovers keep well in the refrigerator, covered, for up to 4 days.","tags":["egg free","Game Day","gluten free","main dishes","Mexican","pack for lunch","recipes","soy free","spring","summer","winter"],"time":{"prep":"15 minutes","cook":"45 minutes","active":"","inactive":"","ready":"","total":"1 hour"},"servings":"4 bowls","image":"https://cookieandkate.com/images/2024/02/Halloumi-Fajita-Bowls_Photos_v2_Fullsize_10.jpg"}