{"name":"Favorite Veggie Burgers","description":"Truly the best veggie burger recipe! These veggie burgers are absolutely delicious and easy to make. Gluten-free, vegan and nut free.","ingredients":["1 ½ pounds sweet potatoes (2 medium or 3 small)","½ cup quinoa, rinsed in a fine-mesh colander","1 cup water","1 can (15 ounces) black beans, rinsed and drained (or 1 ½ cups cooked black beans)","½ cup chopped red onion (about ½ small red onion)","⅓ cup chopped fresh cilantro","2 cloves garlic, pressed or minced","2 tablespoons adobo sauce* or 2 teaspoons smoked paprika","2 teaspoons ground cumin","1 teaspoon chili powder","½ teaspoon salt","1 ¼ cups quick-cooking oats** (use certified gluten-free oats if necessary)","Extra-virgin olive oil, for brushing (or avocado oil, if using stovetop method)","8 whole wheat hamburger buns (optional)","Your favorite burger fixings: Avocado or guacamole, tomato, onion, lettuce, pickles, cheese, sprouts, ketchup, hot sauce, mustard, fried eggs…"],"instructions":"Preheat the oven to 400 degrees Fahrenheit. Line a large, rimmed baking sheet with parchment paper for easy clean-up. Roast the sweet potatoes: Slice the sweet potatoes down the center lengthwise. Place the sweet potatoes, cut side down, on the prepared baking sheet. Roast until they yield to a gentle squeeze, 30 to 40 minutes or longer. Set aside for now. (If you’ll be baking the burgers, reserve the parchment-lined pan and leave the oven on.) Meanwhile, in a small saucepan, combine the quinoa and water. Bring the mixture to a boil over medium-high heat, then reduce the heat as necessary to maintain a gentle simmer. Simmer, uncovered, until all of the water is absorbed, 11 to 14 minutes. Remove the pan from the heat, cover, and let the quinoa steam for 10 minutes. Once the sweet potatoes are cool enough to handle, remove and discard the skin (it should pull off easily) and roughly chop the insides. In a large mixing bowl or the bowl of your electric mixer, combine the cooled sweet potatoes and quinoa, black beans, onion, cilantro, garlic, adobo sauce, cumin, chili powder, and salt. Use a potato masher, pastry cutter, large spoon or the paddle attachment of your mixer to mix really well. It’s ok if the black beans get smashed in the process. Sprinkle the oats over the mixture and mix well with a large spoon until the mixture holds together when you shape a portion into a patty. If you won’t be making the burgers immediately, cover the mixture and refrigerate for later. When you’re ready to cook, shape the burgers: Use a measuring cup to measure out ½ cup of the mixture. Gently shape it into a patty about 3 ½ to 4 inches in diameter. Use your hands to gently flatten the burgers and smooth out any jagged edges. Repeat the process for each patty; you should end up with 8. If you’re baking the burgers (see recipe notes for alternate options), brush both sids of each patty generously with olive oil and place them on the lined baking sheet, leaving a few inches of space around each one. Bake at 400 degrees Fahrenheit until the patties are deeply golden on the outside, about 35 minutes, flipping halfway. Serve burgers as desired. Leftover burgers keep well, refrigerated, for 4 days. Or, freeze them in a freezer bag for up to 3 months (thaw in the microwave for about 1 minute or in a 400 degree oven for 12 to 15 minutes, until warmed all the way through).","tags":["budget friendly","dairy free","egg free","fall","favorites","gluten free","Independence Day","main dishes","nut free","recipes","soy free","summer","tomato free","vegan"],"time":{"prep":"1 hour","cook":"20 mins","active":"","inactive":"","ready":"","total":"1 hour 20 minutes"},"servings":"8 burger patties","image":"https://cookieandkate.com/images/2013/05/best-veggie-burger-recipe-3.jpg"}