{"name":"Figgy Almond-Polenta Tea Cake","description":"This sturdy almond-polenta cake is a gentle landing spot for fresh figs, and also happens to be gluten-free. Swap figs for plums, raspberries, or blueberries.","ingredients":["10 Tbsp. unsalted butter, room temperature, plus more for pan","2 cups (200 g) almond flour","⅔ cup (103 g) instant polenta or fine-ground yellow cornmeal","2 tsp. baking powder","2 tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt","1 cup plus 2 tsp. (208 g) sugar","4 large eggs"," Zest of 1 large lemon","1 cup sour cream (not low-fat)","2 tsp. vanilla bean paste or vanilla extract","½ tsp. almond extract","6–8 oz. fresh figs, trimmed, halved"],"instructions":"Place a rack in middle of oven; preheat to 325°. Lightly grease sides of a 9\"-diameter cake pan with unsalted butter; line bottom with a parchment round. Stir 2 cups (200 g) almond flour, ⅔ cup (103 g) instant polenta or fine-ground yellow cornmeal, 2 tsp. baking powder, 2 tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt, and 1 cup (200 g) sugar in a stand mixer fitted with the paddle attachment on low speed until combined. Add 10 Tbsp. unsalted butter, room temperature, increase speed to medium-low, and beat until incorporated and no lumps remain, about 1 minute (it will look clumpy). Add 4 large eggs, zest of 1 large lemon, 1 cup sour cream (not low-fat), 2 tsp. vanilla bean paste or vanilla extract, and ½ tsp. almond extract; beat, scraping down sides of bowl occasionally, until batter is smooth and fluffy, about 3 minutes (it’s okay if it looks curdled). Scrape batter into prepared pan and smooth surface with an offset spatula or a spoon. Arrange 6–8 oz. fresh figs, trimmed, halved, cut side up, on top in even rows, pressing gently into batter. Sprinkle all over with remaining 2 tsp. (8 g) sugar. Bake cake until golden brown with no damp spots in the center and a tester inserted into the center comes out clean, 50–60 minutes. Transfer pan to a wire rack and let cake cool in pan. Run offset spatula or a butter knife around cake to release. Carefully invert onto a large plate, then invert again onto a cake plate or platter. Do Ahead: Cake can be baked 1 day ahead. Store loosely covered at room temperature.","tags":["fruit dessert","cake","gluten-free","easy","summer","baking","make ahead","fig","polenta","almond flour"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":""},"servings":"","image":"https://assets.bonappetit.com/photos/66574cadbb9e3cf71a29c894/16:9/w_1280,c_limit/240426%20MVP1970.jpg"}