{"name":"French Style Braised Short Ribs","description":"A French style slow braised short ribs in a tasty sauce! Pure comfort food!","ingredients":["2 pounds beef short ribs, cut into 3-4 inch pieces","1 large onion, sliced","3 carrots, sliced","3 stalks celery, sliced","8 ounces mushrooms, quartered","4 cloves garlic, chopped","1 pinch red pepper flakes (optional)","3 cups beef broth","2 cups dry red wine (or more broth)","2 tablespoons tomato paste","2 heads of garlic, with the tops removed","2 tablespoons balsamic vinegar","2 bay leaves","1 teaspoon thyme, chopped (or 1/2 teaspoon dried thyme)","1 teaspoon rosemary, chopped (or 1/2 teaspoon dried rosemary)","2 tablespoons parsley, chopped"],"instructions":"Brown the beef in a large, oven-safe, sauce pan over medium-high heat, about 3-4 minutes per side, and set aside before draining off all but 2 tablespoons of the grease. Add the onions, carrots, celery, and mushrooms and cook until tender, about 7-10 minutes. Add the garlic and red pepper flakes and cook until fragrant, about a minute. Add the broth, wine, tomato paste, heads of garlic, balsamic vinegar, bay leaves, thyme, rosemary, and beef, bring to a boil, reduce the heat, cover and simmer unto the beef is fall apart tender, about 2-3 hours. (Option: Transfer the pot to a preheated 350F/180C oven and roast, covered, until fall apart tender, about 2-3 hours. OR Transfer everything to a slow cooker and cook on low for 8-10 hours or on high for 3-4 hours.) Remove the bay leaves, season with salt and pepper to taste and serve over mashed potatoes, or mashed celery root, mashed parsnips, pasta, etc. with bread to soak up all the tasty sauce. Squeeze the roasted garlic out of the heads of garlic, sprinkle on the parsley and enjoy!","tags":["Beef","Crockpot","Food","French","Gluten-free","Main Course","One-Pot","Recipe","Slow Cooker","Stew"],"time":{"prep":"15 minutes","cook":"3 hours","active":"","inactive":"","ready":"","total":"3 hours 15 minutes"},"servings":"6","image":"https://www.closetcooking.com/wp-content/uploads/2020/03/French-Braised-Short-Ribs-1200-9460.jpg"}