{"name":"Gluten Free Peach Crisp with Salted Coconut Milk Caramel","description":"Juicy gluten free peach crisp with a crunchy pecan oat topping & homemade dairy free caramel. This is simply the best way to use up peaches!","ingredients":["For the filling:","6-7 large ripe peaches, thinly sliced (about 7 cups thinly sliced peaches)","¼ cup (78g) pure maple syrup","2 teaspoons vanilla extract","Optional: 1 vanilla bean, split and seeded","½ teaspoon cinnamon","⅛ teaspoon nutmeg","For the topping:","1 cup (95g) old fashioned rolled oats, gluten free if desired","1 cup (112g) raw chopped pecans","⅓ cup (71g) dark brown sugar (can also sub coconut sugar but brown sugar is best)","¼ teaspoon salt","½ teaspoon cinnamon","¼ cup (56g) melted and cooled coconut oil (can also sub melted butter)","For the salted coconut milk caramel:","¼ cup (59g) canned coconut milk (light or full fat will work -- just make sure the full fat is stirred completely first)","¼ cup (60g) water","¼ cup (39g) coconut sugar","1 teaspoon vanilla","¼ teaspoon sea salt"],"instructions":"Preheat oven to 350 degrees Grease a 8x8 inch baking pan or a 10 inch skillet with coconut oil, butter or nonstick cooking spray. In a large bowl, toss together the peach slices, maple syrup, vanilla, optional vanilla bean, cinnamon and nutmeg. Set aside while you make the topping. To make the topping, add ½ cup oats and ½ cup pecans to a blender. Pulse for 15-30 seconds until oats are fine. Transfer mixture to a medium bowl, then add in remaining ½ cup oats and ½ cup chopped pecans, followed by the dark brown sugar, cinnamon and salt. Stir with a fork to combine. Next add in coconut oil and stir with a fork until it begins to form small clumps and is well combined. Grab ⅓ cup of the topping mixture and add it the bowl with the peaches, stirring to combine. Add peaches to the skillet, spreading evenly. Sprinkle remaining topping evenly all over the peaches. Bake for 40-55 minutes or until filling is very bubbly, topping is golden brown and peaches are fork tender. Once ready to serve the peach crisp, make the coconut caramel by adding the coconut milk, water and coconut sugar to a small saucepan. Place over medium high heat and stir to combine. Bring to a boil, then reduce heat to low and simmer for 15 minutes or until mixture thickens. Before you remove from heat add vanilla and sea salt. Drizzle caramel all over the top of the peach crisp. Enjoy!","tags":[],"time":{"prep":"15 minutes minutes","cook":"45 minutes minutes","active":"","inactive":"","ready":"","total":"1 hour hour"},"servings":"8","image":"https://www.ambitiouskitchen.com/wp-content/uploads/2021/07/Gluten-Free-Peach-Crisp-5long.jpg"}