{"name":"Gluten-Free Almond Cake with Berries on Top","description":"This delicious gluten-free almond cake recipe is easy to make and naturally sweetened. Top with yogurt and fresh berries for a party-worthy cake!","ingredients":["2 cups firmly packed almond meal or almond flour (8 ounces), plus extra for dusting the pan","1 teaspoon baking powder","½ teaspoon baking soda","½ teaspoon fine sea salt","¼ teaspoon ground cinnamon","4 eggs","⅔ cup maple syrup or honey","¼ cup extra-virgin olive oil","1 ½ teaspoons grated lemon zest (from 2 medium lemons, preferably organic), plus more for garnish","2 tablespoons lemon juice","1 tablespoon maple syrup or honey","1 cup plain Greek yogurt or whipped cream","½ pound ripe strawberries, thinly sliced","1 cup fresh blueberries (6 ounces)"],"instructions":"Preheat the oven to 325 degrees Fahrenheit. Generously grease a 9″ springform pan* and dust it with almond meal to prevent sticking. To make the cake: In a large bowl, combine 2 cups of the almond meal, the baking powder, baking soda, salt, and cinnamon. Whisk to blend. Crack the eggs into a medium bowl and beat with a whisk until the yolks and egg whites have blended together. Add the maple syrup, olive oil, and lemon zest and whisk to blend. Pour the wet ingredients into the almond meal mixture and stir until there are just a few clumps remaining. Scrape the batter into the prepared pan (it will be runny; don’t worry). Bake for 40 to 45 minutes, or until the cake is golden brown and the center is firm to the touch. Meanwhile, to make the glaze: In a small bowl, whisk together the lemon juice and 1 tablespoon maple syrup until blended. (If you’re using honey instead and having a hard time blending it into the lemon juice, place the bowl on top of your stove to warm it up while the cake bakes, or warm it briefly in the microwave until you can whisk them together.) Once the cake is out of the oven, place the cake, pan and all, on a cooling rack. While the cake is warm, use a pastry brush to brush the glaze over the top of the cake. It should soak right in. Let the cake cool for at least 30 minutes. Carefully remove the outer piece from your springform pan. Spread yogurt evenly on top, then place strawberries and blueberries on top. Sprinkle with some additional lemon zest, then slice the cake with a sharp knife and serve! Store any remaining cake in the refrigerator, covered, for up to 4 days.","tags":["baked goods","dessert","gluten free","Independence Day","naturally sweetened","recipes","soy free","summer","tomato free"],"time":{"prep":"20 minutes","cook":"40 minutes","active":"","inactive":"","ready":"","total":"1 hour (plus 30-minute cooling time)"},"servings":"1 cake","image":"https://cookieandkate.com/images/2018/06/gluten-free-almond-cake-with-berries-recipe.jpg"}