{"name":"Good old French bean salad","description":"This French bean salad recipe is perfect for a starter; the beans are cooked so they are a little softer than al dente with a gorgeous mustard dressing.","ingredients":["4 handfuls French beans , stalk ends removed","2-3 heaped teaspoons French mustard , to taste","2 tablespoons good-quality white wine vinegar","4 tablespoons extra virgin olive oil","sea salt","freshly ground black pepper","1 medium shallot , peeled and finely chopped","1 tablespoon capers , optional","½ clove garlic , finely grated","1 small handful fresh chervil , optional"],"instructions":"Bring a pan of water to a fast boil, add your beans, put a lid on the pan, and cook for at least 4 to 5 minutes. Boiling the beans fast like this helps them to retain all their nutrients. Meanwhile, put the mustard and vinegar into a jam jar or bowl and, while stirring, add the olive oil to make a good hot French dressing. Season carefully with sea salt and freshly ground black pepper, then add the finely chopped shallot, the capers if you're using them and the garlic. Remove one of the beans from the pan to check if it's cooked. If it holds its shape but is also soft to the bite, it's perfect. Drain in a colander. Now, while the beans are steaming hot, this is the perfect moment to dress them – a hot bean will take on more of the wonderful dressing than a cold one. It is best to serve the beans warm, not cold, and certainly not at fridge temperature because the flavours will be muted and boring. Serve the beans in a bowl, sprinkled with chervil if you like – it's a delicate, crunchy herb that goes well with beans. Serve as a salad in its own right, or as an accompaniment to a main meal.","tags":["Jamie's Dinners","Vegetables","French","Sides","Vegetable sides"],"time":{"prep":"","cook":"Time 15 minutes","active":"","inactive":"","ready":"","total":"Time 15 minutes"},"servings":"Serves 4","image":"https://cdn.jamieoliver.com/recipe-database/oldImages/medium/233_1_1439916050.jpg"}