{"name":"Green gazpacho","description":"Get your green on with Jamie's twist on this classic Spanish dish. This punchy combo of seasonal cucumber, chilli and spring onion is perfect for a summer lunch or starter.","ingredients":["½ x 270g stale ciabatta loaf","2 cucumbers","1 spring onion","1 green pepper","2 green tomatoes","1 handful of green grapes","½ a green chilli","½ a clove of garlic","1 bunch of mixed soft herbs, such as mint, flat-leaf parsley, fennel tops (30g)","cold-pressed extra virgin olive oil","sherry vinegar","1 large handful of ice cubes","100 g shelled unsalted pistachios","optional: ½ a red chilli"],"instructions":"Remove the crusts from the ciabatta (use them to make breadcrumbs). Run the remaining bread under the cold tap, give it a gentle squeeze and place in a large blender. Holding a little bit of each of the following ingredients back for garnish, peel and slice the cucumbers, trim and clank up the spring onion, deseed and tear the green pepper, halve the tomatoes and pick the grapes, then put everything in the blender. Throw in the green chilli, peel, finely slice and add the garlic, and pick in most of the herb leaves. Drizzle in 2 tablespoons of extra virgin olive oil, add a pinch of sea salt and black pepper, and 1 tablespoon of sherry vinegar. Add the ice cubes along with 200ml of cold water and most of the pistachios (reserve a few for garnish), then blitz until silky smooth – you may need to work in batches. Taste and add a little more oil, seasoning or vinegar, if needed (and if you want the soup to be thicker, add another slice of bread), and whiz again. Divide between cold bowls, then finely chop or slice the reserved garnishes and sprinkle on top. Drizzle with a little extra virgin olive oil and sherry vinegar, if you like. Deseed, very finely chop and scatter over the red chilli for a pop of colour, if you like, to finish.","tags":[],"time":{"prep":"","cook":"Time 15 minutes","active":"","inactive":"","ready":"","total":"Time 15 minutes"},"servings":"Serves 4","image":"https://cdn.jamieoliver.com/recipe-database/medium/158950005.jpg"}