{"name":"Grilled Corn Salad with Avocado, Goat Cheese & Hot Honey Vinaigrette","description":"Wonderful grilled corn salad with avocado goat cheese, and a sweet & spicy hot honey vinaigrette. The perfect summer lunch or side dish!","ingredients":["For the grilled corn:","4 ears of corn","1 tablespoon avocado oil","Freshly ground salt and pepper","For the salad:","1 ½ cups halved cherry tomatoes (i love heirloom cherry or grape tomatoes!)","1 avocado, diced","⅓ cup goat cheese crumbled","¼ cup diced red onion or sub green onion","6 large leaves basil, julienned","Hot Honey Vinaigrette:","2 tablespoons avocado oil or olive oil","1 tablespoon honey","Pinch of cayenne pepper OR 1/2 teaspoon hot sauce of choice","2 teaspoons apple cider vinegar (or sub fresh lime juice)","¼ teaspoon dijon mustard","⅛ teaspoon garlic powder","Freshly ground salt and pepper, to taste"],"instructions":"Preheat grill to medium high heat. Drizzle corn with oil and rub all over. Season with salt and pepper. Place the corn directly on the grill and turn occasionally until the corn is charred and cooked, about 20 minutes. Allow corn to cool then cut the corn from the cob and place in a large bowl. Add tomatoes, avocado, goat cheese, red onion and basil. Toss together to combine. Make your hot honey vinaigrette: in a mason jar or small bowl add honey and cayenne or hot sauce; microwave for 10-15 seconds until the honey is hot. Remove and add in the olive oil, apple cider vinegar, dijon, garlic powder and salt and pepper; put a lid on the mason jar and shake well to combine. You can also whisk together in a small bowl if preferred. Taste and add more hot sauce or cayenne if you want it spicier! Pour over the corn salad and toss to combine. Season the salad with salt and pepper to taste. Enjoy the corn salad immediately. If you are making ahead of time, I recommend leaving the avocado and goat cheese out until ready to serve.","tags":[],"time":{"prep":"20 minutes minutes","cook":"15 minutes minutes","active":"","inactive":"","ready":"","total":"35 minutes minutes"},"servings":"6","image":"https://www.ambitiouskitchen.com/wp-content/uploads/2023/07/Corn-Salad-FB.png"}