{"name":"Grilled Feta with Asparagus Chimichurri","description":"I don’t want to ever stop smooshing warm feta on crostini and spooning grilled asparagus and charred red onion tossed in chimichurri sauce.","ingredients":["Chimichurri","3 large or 4 regular cloves garlic","3/4 teaspoon dried oregano or 1 1/2 tablespoons fresh oregano leaves","1 tablespoon finely chopped fresh red chili pepper or 1/4 to 1/2 teaspoon red pepper flakes","4 ounce bundle flat-leaf parsley [or 1/2 cup finely-chopped leaves]","1/2 cup olive oil","1/2 teaspoon kosher salt","Freshly ground black pepper, to taste","2 tablespoons red wine vinegar","Assembly","1 baguette, sliced 1/2-inch-thick on an angle","1 large red onion, cut into thin wedges","1 pound asparagus spears, trimmed","Salt and freshly ground black pepper","Olive oil","8-ounce block feta",""],"instructions":"Make the chimichurri: Place garlic, oregano, and red chili in a food processor or high speed blender and blend until chopped. Strip the leaves from the parsley and add them to the blender, pulsing the machine until the parsley is well-chopped. Add olive oil, kosher salt, and black pepper and blend until the parsley is finely chopped. Transfer to a bowl and stir in vinegar. If you’ve got time before using it, chimichurri tastes great after resting at room temperature for 30 minutes to 2 hours before using. No blender? Finely chop all the ingredients by hand, stirring in the oil and vinegar. Grill everything else: Heat your grill to a high temperature; I like a quick char on everything here. Arrange baguette slices, onion, and asparagus on a large tray (but keeping items separate) and drizzle everything with olive oil and season it with salt and pepper. Pat feta block dry and place in a small cast-iron skillet or a piece of foil folded a few times so it’s a little sturdier. Drizzle feta with olive oil, too, and head outside. My grill is tiny, so I have to grill items one at a time. Start with the baguette slices, arranging them in one layer and flipping them with tongs as soon as they get licks of color underneath. Transfer bread back to the tray and grill the onion slices, until they have brown marks all over. As soon as they come off the grill, place them in a medium-large bowl with a big spoonful of the chimichurri, so they mellow and sweeten further. Next grill the asparagus, rolling it over as soon as it gets some char underneath, and repeating on the remaining parts. Transfer the asparagus back to the tray, and grill the feta last. Place the pan or foil holding the feta directly on the grill and let it heat for 5 to 10 minutes. If you can multitask, use the feta grilling time to cut the asparagus into 1/2-inch segments on an angle and transfer it to the bowl with the onions and pour in all but the the last 2 tablespoons chimichurri, stirring to combine. Season with salt and black pepper to taste. Assemble and serve: When the feta is very hot throughout and maybe even browned a little at the edges, use a spatula to carefully transfer it from the grill to a serving plate. Arrange the baguette slices around one half of it, and spoon the asparagus chimichurri around the other half. Spoon some extra chimichurri over the feta. Eat right away, smooshing the feta on the toasts and spooning the asparagus on top. The feta is the creamiest when it’s still piping hot, but it will still be delicious even after it has cooled. No grill? You can make each element in the oven — the broiler works great here, just keep an eye on the bread and feta, as they’ll brown much faster.","tags":["Appetizers","Asparagus","Grilling","Herbs","Onions","Party Snacks","Recipe","Salad","Vegetable","Vegetarian"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":"30 minutes"},"servings":"2 to 4 as a salad, 8 as a party appetizer","image":"https://i0.wp.com/smittenkitchen.com/wp-content/uploads/2024/05/grilled-feta-with-asparagus-chimichurri-16-scaled.jpg?fit=1200%2C800&ssl=1"}