{"name":"Healthy Cowboy Caviar","description":"This homemade cowboy caviar recipe is made with all-natural ingredients! Serve it as salad or dip—it'll be a hit at your next party. Vegan and gluten free.","ingredients":["Cowboy caviar","2 cans (14 ounces each) black-eyed peas, rinsed and drained, or 3 cups cooked black-eyed peas","1 can (14 ounces) black beans, rinsed and drained, or 1 ½ cups cooked black beans","1 ½ cups fresh or defrosted frozen corn kernels (about 2 ears of corn), or 1 can (14 ounces) corn, drained","1 ½ cups chopped ripe tomatoes (about ¾ pound)","1 medium red, orange or yellow bell pepper, chopped","¾ cup chopped red onion (about ½ small red onion)","½ cup chopped cilantro, leaves and stems","1 to 2 jalapeños, ribs removed, seeded and finely chopped","1 avocado (optional)","Italian dressing","⅓ cup olive oil","3 tablespoons red wine vinegar or lime juice","2 medium cloves garlic, pressed or minced","1 to 1 ½ teaspoons salt, to taste","1 teaspoon dried oregano","½ teaspoon dried basil","1 teaspoon maple syrup or honey","⅛ teaspoon red pepper flakes","Freshly ground black pepper, to taste"],"instructions":"In a large serving bowl, combine the drained black-eyed peas, black beans, corn, chopped tomatoes, bell pepper, onion, cilantro and jalapeño. If you’ll be including avocado, wait to dice it until you’re ready to serve the dip, so it doesn’t turn brown in the meantime. In a cup, whisk together the dressing ingredients until well blended. Drizzle the dressing over the serving bowl and toss until well mixed. Season to taste with additional salt and pepper. If you’d like the salad to have more of a pickled flavor, add another tablespoon of vinegar, or for more richness, add another tablespoon or two of olive oil. For best flavor, let the mixture marinate for at least 20 minutes before serving. If you’re adding avocado, mix it in just before serving.","tags":["appetizers","budget friendly","condiments, dips & sauces","dairy free","egg free","fall","favorites","gluten free","Independence Day","nut free","pack for lunch","recipes","salads","side dishes","snacks","soy free","summer","vegan"],"time":{"prep":"30 mins","cook":"","active":"","inactive":"","ready":"","total":"30 minutes"},"servings":"8 cups","image":"https://cookieandkate.com/images/2015/06/cowboy-caviar-recipe-4.jpg"}