{"name":"Healthy Orange Chicken","description":"If you enjoy Chinese takeout, you will love this 30 Minute Healthy Orange Chicken recipe. You can savor the flavor of your favorite dish without all the extra calories and high sodium levels. This delicious chicken tastes great and is good for you too!","ingredients":[" 1 lb chicken breast, cut into bite-size pieces"," 1/2 tsp  baking soda"," Salt to taste"," 2 tbsp fresh orange juice"," 1 1/2 tbsp  soy sauce"," 1/2 tsp  ground black pepper"," 1 tbsp  cornstarch"," 1 tsp  garlic, minced"," 1 tsp  ginger, minced"," 1/3 cup  fresh orange juice"," 1 tbsp  soy sauce"," 1/4 cup  rice vinegar"," 1 1/2 tbsp chili garlic sauce (optional)"," 1/2 tbsp  cornstarch"," 2 tsp  orange zest"," 3 garlic cloves, minced"," 1 tsp  ginger, minced"," 1/2 tsp  red chili flakes"," 3 tbsp  brown sugar"," Salt to taste"," 1 tbsp  oil"," 1 tbsp   sesame seeds"," 2 tbsp  green onions chopped"," 1 cup  cooked rice, to serve"," 1/2 cup  steamed broccoli, to serve"],"instructions":"In a medium-size bowl combine all the ingredients under the “to marinate chicken” section and mix it thoroughly and marinate the chicken for at least 10 minutes. In a separate bowl combine orange juice, soy sauce, vinegar, chili garlic sauce, cornstarch, orange zest, garlic, ginger, red chili flakes, brown sugar, and salt. Whisk it until the sugar dissolves and keep the sauce mixture aside. Heat a wide skillet; add oil and once the oil is heated add the marinated chicken pieces to it. Cook on a medium flame for 4-5 minutes and flip the chicken pieces to the next side and cook for 5-6 more minutes until the chicken is cooked perfectly. Stir in the prepared sauce mixture to the skillet and cook the chicken along with the sauce uncovered for 5 minutes. The sauce will start to thicken and everything comes together. In this stage add the sesame seeds and green onions. Serve the orange chicken along with rice and veggies.","tags":[""],"time":{"prep":"15 minutes mins","cook":"15 minutes mins","active":"","inactive":"","ready":"","total":" "},"servings":"4","image":"https://gimmedelicious.com/wp-content/uploads/2021/01/Images-15-5.jpg"}