{"name":"Herby Chicken Meatball Pitas with Jalapeño Tzatziki","description":"Delicious herby chicken meatball pitas piled high with fresh veggies and a creamy homemade jalapeño tzatziki sauce. A fun, flavorful dinner!","ingredients":["For the jalapeño tzatziki sauce:","1 recipe for tzatziki sauce","1 jalapeño, finely diced (remove seeds if you are heat sensitive)*","For the meatballs:","1 pound lean ground chicken or turkey (around 93% lean is best)","1 egg","½ cup panko breadcrumbs","¼ cup finely diced red onion","3 cloves garlic, minced (or sub ½ teaspoon garlic powder)","1 jalapeño, finely diced","3 tablespoons chopped fresh parsley","2 tablespoons chopped fresh mint","1 tablespoon chopped fresh dill (or ½ teaspoon dried)","1 teaspoon dried oregano","1 teaspoon lemon zest","1 teaspoon kosher salt","Freshly ground black pepper","2 tablespoons olive oil or avocado oil","For assembly:","4 to 8 pieces of pita bread, depending on how you want to serve them","4 mini Persian cucumbers, sliced","2 roma tomatoes, sliced","½ red onion, thinly sliced or pickled red onion","Crumbled feta cheese","Extra fresh dill"],"instructions":"Make jalapeno tzatziki sauce: While the meatballs cook, make your jalapeno tzatziki sauce by combining all ingredients for tzatziki sauce and diced jalapeno in a medium bowl. Set aside or cover and place in the fridge until ready to serve. This can also be made 1 to 2 days ahead of time. Prepare the meatballs: Fill a small bowl with water and place it on the counter. In a large bowl, add the ground chicken, egg, panko, red onion, garlic, jalapeno, parsley, mint, dill, oregano, lemon zest, salt and black pepper. Use clean hands to mix until well combined; avoid overmixing otherwise the meatballs will become tough. Form into 16 golf ball sized meatballs, dipping your hands in water between each meatball to prevent sticking. To pan-fry the meatball (my preference for more flavor!): In a large, deep nonstick skillet, warm 1 tablespoon of oil over medium heat. Once the oil is hot, add the meatballs, leaving about ½ inch between each (you may need to do this in batches, depending on how many meatballs you can fit in your skillet without overcrowding them), and brown on all sides until cooked through (a meat thermometer should register 165°F degrees), 10 to 12 minutes. Transfer the meatballs to a plate and repeat with the remaining meatballs, adding more oil, if necessary. To bake the meatballs: Preheat the oven to 400°F. Line a large baking sheet with parchment paper. Place the meatballs at least an 1 inch apart on the parchment paper. Bake until a meat thermometer inserted into the meatball reads 165°F, 17 to 22 minutes. Assemble and serve: You can either slice your pita bread in half and open it to stuff them, or you can use a whole pita bread and treat it like a taco. It depends on how thick your pita bread is. Either way, dollop jalapeno tzatziki sauce in or on each pitta, then add 2 to 3 meatballs, a layer of tomatoes, cucumbers and red onion, feta and dill, if desired. Top with a little more jalapeno tzatziki, if desired, and enjoy!","tags":[],"time":{"prep":"20 minutes minutes","cook":"15 minutes minutes","active":"","inactive":"","ready":"","total":"35 minutes minutes"},"servings":"4","image":"https://www.ambitiouskitchen.com/wp-content/uploads/2024/06/Spicy-Herby-Chicken-Meatball-Pitas-with-Jalapeno-Tzatziki-4long.jpg"}