{"name":"Homemade sourdough bread","description":"Make our easy sourdough starter seven days ahead to make our simple homemade sourdough loaf. Serve with your favourite casseroles or soups","ingredients":["50g strong white flour to start, then 25g extra a day for 6 days","50g strong wholemeal flour to start, then 25g extra a day for 6 days","450g strong white flour, plus extra for dusting","50g wholemeal flour","10g fine salt","100g sourdough starter (see above)"],"instructions":"To make the sourdough starter, whisk 50g strong white flour and 50g strong wholemeal flour with 100ml slightly warm water until smooth. Transfer to a large jar or plastic container. Leave the lid ajar for 1 hr or so in a warm place, then seal and set aside for 24 hrs. For the next six days, you will need to ‘feed’ it. Each day, tip away half the original starter, add an extra 25g of each flour and 50ml slightly warm water, and stir well. After a few days, you should start to see bubbles on the surface, and it will smell yeasty. On day seven, the starter should be bubbly and smell much sweeter. It is now ready to be used, but make sure you keep half back and carry on feeding for your next loaf.  Tip both the flours, 300ml warm water and the starter into a bowl, stir with a wooden spoon into a dough and leave somewhere for an hour.  Tip in 25ml more water and the salt and bring everything together. Cover and leave somewhere warm for 3 hrs, folding the dough onto itself several times in the first hour. The dough should increase in size by about a third. Line a medium bowl with a clean tea towel and flour it really well, or flour a proving basket. Tip the dough back onto your work surface, shape into a tight, smooth ball and dust it with flour.  Place the dough, seam-side up, in the bowl or proving basket, and leave at room temperature for 3 hrs – or better still in the fridge overnight – until risen by about a quarter.  Heat oven to 230C/210C fan/gas 8 and put a casserole dish with a lid or a baking stone in the oven for at least 30 mins to heat up, and a large roasting tin filled with boiling water underneath. After 30 mins, carefully remove the casserole dish, invert the loaf into it and slash the top. Cover and bake for 20 mins, then take the lid off and bake for another 20 mins. Or invert onto the baking stone, slash and bake for 40 mins, or until the crust is as dark as you like it. ","tags":[],"time":{"prep":"1 hr","cook":"40 mins","active":"","inactive":"","ready":"","total":""},"servings":"","image":"https://images.immediate.co.uk/production/volatile/sites/30/2020/08/sourdough-e088dc0.jpg?resize=440%2C230"}