{"name":"Homemade cinnamon crumpets","description":"A delicious cinnamon crumpet recipe with raspberries and honey – perfect for brunch or pudding. Learn how to make crumpets with Jamie's easy crumpet recipe. ","ingredients":["CRUMPETS","500 g strong white bread flour","1 teaspoon caster sugar","1 x 7g sachet of yeast","1 pinch of bicarbonate of soda","½ teaspoon ground cinnamon","TOPPING","1 lemon","250 g ricotta cheese","2 tablespoons runny honey , plus extra for drizzling","3 large handfuls of fresh raspberries","vegetable oil , for greasing"],"instructions":"Place all the crumpet ingredients into a food processor, add 2 teaspoons of sea salt and 600ml of tepid water and blitz to a loose batter. Leave to stand for 10 minutes to let the yeast develop – the mixture should be quite wet, just about dropping consistency. Meanwhile, make the topping. Finely grate the lemon zest into a bowl, add ricotta and honey, then beat together until light and fluffy. Mash half the raspberries with a fork and ripple through the ricotta. Grease the inside of the metal rings with oil, then place in a non-stick frying pan on a medium heat – work in batches, according to the number of metal rings you have. When the pan’s nice and hot, spoon some mixture into each ring, so it’s roughly 1cm deep. Turn the heat down to low and leave for 15 minutes to cook through – keep an eye on them and reduce the heat slightly, if you think the bottoms are getting too dark. When the time’s up, bubbles and crumpet-like dimples should have formed on the top — turn the crumpets over, using tongs to lift the rings away. Cook for another 5 to 10 minutes, or perfectly golden. Serve the crumpets warm with a generous spoonful of ricotta, a scattering of fresh raspberries and an extra drizzle of honey, if you like.","tags":["Bread","Afternoon tea","Fruit","Breakfast","Baking"],"time":{"prep":"","cook":"Time 45 minutes","active":"","inactive":"","ready":"","total":"Time 45 minutes"},"servings":"Serves 6","image":"https://cdn.jamieoliver.com/recipe-database/oldImages/medium/715_1_1434099333.jpg"}