{"name":"Honey Salmon with Ginger Scallion Sauce","description":"Honey-roasted salmon is topped with a sizzling ginger scallion sauce and served over rice with a squeeze of lime. Easy to make in 30 minutes!","ingredients":["4 salmon filets","2 teaspoons soy sauce","2 tablespoons honey","fine sea salt and freshly-ground black pepper","1 tablespoon olive oil","12 ounces French green beans","2 limes","4 cups cooked brown or white rice","1/2 cup avocado oil (or another mild high-heat oil, such as sunflower, grapeseed, or vegetable oil)","6 scallions (~75 grams), thinly sliced","2 tablespoons finely minced or grated fresh ginger","2 cloves garlic, finely minced or grated","1 tablespoon soy sauce"],"instructions":"Prep the oven and baking sheet. Heat oven to 425°F and line a large baking sheet with parchment paper. Prep the salmon. Place the salmon filets skin-side-down at the end of the prepared baking sheet. Whisk together the soy sauce and honey in a small bowl until combined, then brush it evenly on top of the salmon. Prep the green beans. Lay the green beans in a tight pile on the other end of the baking sheet and drizzle with the olive oil. Toss until evenly coated, then arrange the green beans in an even layer covering the rest of the baking sheet. Season the green beans and the salmon generously with salt and pepper. Roast. Bake for 10 minutes, or until the salmon is cooked to your liking. (I prefer to remove my salmon when the internal temperature measures 135°F, as it will continue to cook slightly more as it rests. Please note that cooking time will vary depending on the thickness of your salmon filets.) Transfer the pan to a wire cooling rack and drizzle the salmon and green beans with the juice of 1 lime. Make the ginger scallion sauce. Heat the oil in a small saucepan over medium-high heat until tiny bubbles begin to form around the sides of the pan. (If you drop a scallion in the oil, it should sizzle vigorously.) While the oil is heating, combine the white parts of the scallions, ginger and garlic in a small heat-proof* (see note below) bowl or measuring cup. Once the oil is hot, very carefully pour it on top of the scallion mixture (it will sizzle and sputter!) and gently stir to combine. Add the soy sauce and the green parts of the scallions stir to combine. Taste and season with extra salt and pepper as needed. Serve. Serve the salmon and green beans over rice, topped with the ginger scallion sauce and served with extra lime wedges for squeezing, and enjoy!","tags":["Chinese-Inspired","Gluten-free","Main Dishes"],"time":{"prep":"20 mins","cook":"10 mins","active":"","inactive":"","ready":"","total":"30 mins"},"servings":"4 servings","image":"https://www.gimmesomeoven.com/wp-content/uploads/2024/06/Honey-Salmon-with-Ginger-Scallion-Sauce-7.jpg"}