{"name":"How to Grill Pizza","description":"Grilled pizza is so fun to make! I love grilling pizzas on hot days because I don’t have to crank up the oven to high heat. Grilled…","ingredients":["1 batch easy whole wheat pizza dough or 1 pound store-bought pizza dough","1 cup pizza sauce or pesto","8 ounces (2 cups) freshly grated low-moisture part-skim mozzarella cheese or goat cheese, crumbled","Toppings of your choice*"],"instructions":"Preheat the grill to about 400 to 500 degrees Fahrenheit (if your grill doesn’t have a temperature gauge, you’ve reached this temperature when you can comfortably hold your hand about 5 inches above the grate for just one second—be careful!).  On a floured surface, prepare the dough through step 5. Lightly brush the top of the dough all over with olive oil. Scoop one round of dough onto a pizza peel (in a pinch, use a flat cookie sheet with no rim).  Carefully flip the dough onto the preheated grill so that the oiled side is against the grate. Close the grill and cook until the dough is bubbling all over and lightly cooked through, about 2 to 3 minutes.  Scoop the pizza crust back onto your pizza peel, then place the pizza on a flat surface and add your toppings: divide half of the sauce over the pizza and spread it around, leaving about 1-inch bare along the edges, followed by half of the cheese, and any toppings you desire.  Return the pizza to the grill, cover the grill, and cook until the cheese is melted, about 2 to 4 minutes. Scoop the pizza back onto your pizza peel and  transfer it to a flat cutting surface.  Add any remaining toppings (like arugula, balsamic reduction and red pepper flakes, as shown in photos). Repeat the process with the second pizza. Slice and serve! Leftover pizza will keep well in the fridge, covered, for up to 5 days.","tags":["budget friendly","egg free","fall","Independence Day","Italian","main dishes","nut free","pack for lunch","recipes","soy free","spring","summer"],"time":{"prep":"30 minutes","cook":"15 minutes","active":"","inactive":"","ready":"","total":"45 minutes"},"servings":"2 pizzas","image":"https://cookieandkate.com/images/2021/08/grilled-pizza-recipe-2-1.jpg"}