{"name":"Hunter's chicken stew (Pollo alla cacciatora)","description":"This hunter’s chicken stew recipe, or chicken alla cacciatora recipe, is so, so good! Jamie Oliver’s recipe is packed with olives, anchovies and juicy chicken. Buon appetito!","ingredients":["2 kg higher-welfare chicken, jointed , or use the equivalent amount of chicken pieces","sea salt","freshly ground black pepper","8 bay leaves","2 sprigs fresh rosemary","3 cloves garlic , peeled (1 crushed, 2 sliced)","½ bottle Chianti","flour , for dusting","extra virgin olive oil","6 anchovy fillets","1 handful green or black olives , stoned","2 x 400 g good-quality tinned plum tomatoes"],"instructions":"Chicken cacciatora seems to be reasonably well known in Britain because it’s the classic pre-packed dish you find in Italian food ranges in supermarkets (which, to be honest, never taste of much). When you get the real deal cooked at home with love and passion it’s a totally different experience. It’s a simple combination of flavours that just works really well. Cacciatore means ‘hunter’, so this is obviously the type of food that a hunter’s wife cooks for her fella when he gets home from a hard morning spent in the countryside. This is also a great dish for big parties, as it looks after itself in the oven. In the picture I’ve made it for about 12 people. Season the chicken pieces with salt and freshly ground black pepper and put them into a bowl. Add the bay leaves and rosemary sprigs and the crushed clove of garlic and cover with the wine. Leave to marinate for at least an hour, but preferably overnight in the fridge. Preheat your oven to 180ºC/350ºF/gas 4. Drain the chicken, reserving the marinade, and pat dry with kitchen paper. Dust the chicken pieces with flour and shake off any excess. Heat an ovenproof pan, add a splash of olive oil, fry the chicken pieces until browned lightly all over and put to one side. Place the pan back on the heat and add the sliced garlic. Fry gently until golden brown, then add the anchovies, olives, tomatoes (broken up with a wooden spoon) and the chicken pieces with their reserved marinade. Bring to the boil, cover with a lid or a double thickness layer of foil and bake in the preheated oven for 1½ hours. Skim off any oil that’s collected on top of the sauce, then stir, taste and add a little salt and pepper if necessary. Remove the bay leaves and rosemary sprigs, and serve with a salad, or some cannellini beans, and plenty of Chianti.","tags":["Jamie's Italy","Chicken","Bonfire night recipes","Stew","Mains"],"time":{"prep":"","cook":"Time 2 hours","active":"","inactive":"","ready":"","total":"Time 2 hours"},"servings":"Serves 6","image":"https://cdn.jamieoliver.com/recipe-database/oldImages/medium/275_30_1436801947.jpg"}