{"name":"Indian-spiced potatoes with chicken thighs","description":"This fantastic chicken thigh recipe is a real feast. Crispy chicken skin, juicy chicken thighs, flavour-packed potatoes, loads of spices and a punchy, minty, yoghurt sauce. ","ingredients":["1 large onion","800 g potatoes","4 ripe tomatoes","1 aubergine","1 red pepper","2 cloves of garlic","5cm piece of ginger","½ a bunch of fresh coriander , (15g)","olive oil","2 tablespoons mustard seeds","1 handful of curry leaves","1 heaped teaspoon turmeric","6 large free-range chicken thighs, bone in","2 fresh red or green chillies","poppadoms","YOGHURT DRESSING","½ a bunch of fresh mint , (15g)","½ a lemon","1cm piece of ginger","150 g natural yoghurt","1 fresh green chilli"],"instructions":"Preheat the oven to 190°C/375°F/gas 5. Peel the onion, then cut into 3cm cubes with the potatoes, tomatoes, aubergine and pepper. Put the spuds in a large pan of salted water over a medium heat. Bring to the boil and cook for 10 minutes, then drain in a colander and leave to steam-dry for 3 minutes. Tip into a large bowl and mix with the tomato, aubergine, pepper and onion. Peel and finely slice the garlic. Peel and finely grate the ginger. Pick the coriander leaves and set aside, then chop the stalks. Heat a lug of oil in a large frying pan over a medium heat. Add the garlic, ginger, coriander stalks, mustard seeds, curry leaves and turmeric, and cook for 2 minutes, or until fragrant. Leave to one side to cool slightly. Add the spice mix to the veg and potatoes, and tip onto a large roasting tray. Arrange the chicken on top and season. Roast in the bottom of the oven for 1 hour, or until the chicken is cooked and the veggies are gnarly. For the dressing, pick the mint leaves into a blender, squeeze in the lemon juice, then peel and add the ginger with the remaining dressing ingredients and a pinch of seasoning. Blitz until smooth. Top the chicken and potatoes with the coriander leaves. Finely slice and scatter on the chillies, then serve with poppadoms and the dressing on the side.","tags":["Jamie Magazine","Chicken","Indian","Chicken thighs","Potato","Mains"],"time":{"prep":"","cook":"Time 1 hour 25 minutes","active":"","inactive":"","ready":"","total":"Time 1 hour 25 minutes"},"servings":"Serves 6","image":"https://cdn.jamieoliver.com/recipe-database/medium/46258917.jpg"}