{"name":"Italian Long Hots With Tahini Yogurt","description":"Nutty, cooling tahini yogurt makes the ideal condiment counterpart to tender, glazed long hot peppers—as a side dish, toast topper, or sandwich stuffer.","ingredients":["2 garlic cloves, finely grated","¼ cup plain whole-milk yogurt","¼ cup tahini","2 tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt, divided","3 Tbsp. (or more) extra-virgin olive oil","12 oz. Italian long hot peppers, pricked all over with a paring knife","2 Tbsp. sugar","½ cup plus 1 Tbsp. white wine vinegar"," Flaky sea salt"," Freshly ground pepper"],"instructions":"Stir together 2 garlic cloves, finely grated, ¼ cup plain whole-milk yogurt, ¼ cup tahini, ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, and 1 Tbsp. water in a medium bowl until smooth. Set tahini yogurt aside. Heat 3 Tbsp. extra-virgin olive oil in a medium Dutch oven or other heavy pot over medium-high. Working in 2 batches and adding more oil between batches if needed, add 12 oz. Italian long hot peppers, pricked all over with a paring knife, and cook, tossing occasionally, until slightly softened and blistered, about 5 minutes per batch. Transfer to a plate. Return peppers to pot and add 2 Tbsp. sugar, ½ cup white wine vinegar, and remaining 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt. Cook, tossing peppers constantly, until glazed, about 3 minutes. Add 2 Tbsp. water and toss, scraping up browned bits stuck to bottom of pot, until peppers are glossy. Remove from heat and drizzle in remaining 1 Tbsp. white wine vinegar; toss to coat. Taste and season with more kosher salt if needed. Spread reserved tahini yogurt over a platter. Arrange peppers on top and pour any juices in pot over. Season with flaky sea salt and freshly ground pepper.","tags":["dinner","side","vegetarian","gluten-free","nut-free","quick","30 minutes or less","one-pot meals","summer","fall","tahini","yogurt","sear"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":""},"servings":"","image":"https://assets.bonappetit.com/photos/66574c8622b55c927df0bcef/16:9/w_1280,c_limit/240426%20MVP2063.jpg"}