{"name":"Japanese Eggplant With Cashews and Chiles","description":"Creamy roasted Japanese eggplant meets its delightfully textured match in this riff on Mexican salsa macha, made with cashews, garlic, and fresh Fresno chiles.","ingredients":["6 medium Japanese eggplants (about 1½ lb.), halved lengthwise","⅓ cup plus ½ cup extra-virgin olive oil"," Kosher salt","10 garlic cloves, thinly sliced","1 cup coarsely chopped raw cashews","2 large Fresno chiles, ribs and seeds removed, finely chopped","3 Tbsp. sherry vinegar or red wine vinegar","½ tsp. sugar"," Cilantro leaves with tender stems (for serving)"],"instructions":"Preheat oven to 425°. Using the tip of your knife, lightly score cut sides of 6 medium Japanese eggplants (about 1½ lb.), halved lengthwise, spacing cuts ¼\" apart and creating a crosshatch pattern. Place, cut side up, on a rimmed baking sheet. Drizzle ⅓ cup extra-virgin olive oil over; season with kosher salt. Roast until lightly browned and tender, 20–30 minutes, depending on thickness. Heat broiler (leave eggplant in oven). Broil eggplant until browned on top, 3–6 minutes (watch carefully; depending on your broiler, this could happen very quickly or take more time). Meanwhile, cook 10 garlic cloves, thinly sliced, and remaining ½ cup extra-virgin olive oil in a small skillet over medium-high heat, swirling occasionally, until garlic is barely golden and crisp, 6–9 minutes. Pour into a fine-mesh sieve set over a small bowl; reserve pan. Sprinkle garlic with a pinch of salt and toss to combine. Transfer crispy garlic to a medium bowl; set aside. Combine 1 cup coarsely chopped raw cashews and garlic oil in reserved pan; reserve sieve and bowl. Set pan over medium-high heat and cook, stirring often, until cashews are starting to turn golden, about 3 minutes. Add 2 large Fresno chiles, ribs and seeds removed, finely chopped, and cook, stirring often, until cashews are golden brown and oil has turned orange, about 1 minute. Pour oil through reserved sieve set over bowl; set chile-garlic oil aside. Season cashews and chiles with a pinch of salt and toss to combine. Transfer to bowl with reserved crispy garlic. Arrange eggplant, cut side up, on a platter. Add 3 Tbsp. sherry vinegar or red wine vinegar, ½ tsp. sugar, and reserved chile-garlic oil to cashew mixture and toss to coat. Taste salsa macha and season with more salt if needed. Spoon over eggplant, including oil, then scatter cilantro leaves with tender stems on top.","tags":["dinner","side","summer","vegetarian","vegan","dairy-free","gluten-free","eggplant","cashew","fresno chile"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":""},"servings":"","image":"https://assets.bonappetit.com/photos/66574c8dbb9e3cf71a29c892/16:9/w_1280,c_limit/240426%20MVP2084.jpg"}