{"name":"Kale, Edamame, and Quinoa Salad with Lemon Vinaigrette","description":"Kale quinoa salad with lemon vinaigrette and packed with juicy mango, edamame & creamy avocado. This salad is perfect for parties or lunch!","ingredients":["¾ cup uncooked quinoa","1 ½ cups water","1 ½ cup frozen edamame, thawed","1 bunch kale, stems removed and very finely diced","1 cup sliced grape tomatoes","⅓ cup diced red onion","1 large mango, pitted and diced","1 avocado, sliced","For lemon basil vinaigrette:","¼ cup freshly squeezed lemon juice","¼ cup olive oil","1 garlic clove, minced","1 teaspoon dijon mustard","1 teaspoon honey (or agave nectar)","4-6 large basil leaves, very finely diced","Freshly ground salt and black pepper, to taste","To garnish:","¼ cup toasted sliced almonds"],"instructions":"First, cook your quinoa: Add quinoa and water to a medium pot and place over high heat; bring to a boil, then cover, reduce heat to low and cook for 15 minutes. After 15 minutes, remove from heat, fluff quinoa with a fork and transfer quinoa to a large bowl to cool down. To make dressing: place olive oil, lemon juice, garlic, dijon, honey (or agave), basil, and salt and pepper in blender. Pulse for 10-15 seconds; set aside. You can also whisk in a small bowl if you don't have a blender (just make sure your basil is very finely chopped.) In large bowl add your kale and pour half of the dressing over. Use clean hands to massage the kale for about 3 minutes or until it breaks down. This allows the kale to take on the dressing flavors. Next add in quinoa, edamame, diced onion, and remaining lemon vinaigrette; toss so that the salad is fully coated. Before serving, toss salad again and add tomatoes, mango and avocado. Sprinkle toasted sliced almonds over the top. Serves 4. Great for meal prep, picnics or parties!","tags":[],"time":{"prep":"10 minutes minutes","cook":"20 minutes minutes","active":"","inactive":"","ready":"","total":"30 minutes minutes"},"servings":"4","image":"https://www.ambitiouskitchen.com/wp-content/uploads/2018/05/Kale-Edamame-Quinoa-Salad-long.jpg"}