{"name":"Larb Gai (Chicken Larb)","description":"This Lao-style larb recipe with homemade rice powder comes from Night + Market's Kris Yenbamroong. It's tangy, spicy, full of fresh herbs, and packed with umami.","ingredients":["2 cups dried bird chiles, pulla chiles, or chiles de árbol, stemmed","1 cup glutinous or jasmine rice","1¼ \" piece fresh galangal, cut into thin coins","1 Tbsp. thinly sliced lemongrass","2 makrut (Thai) lime leaves","¾ lb. ground chicken","3 Tbsp. fish sauce","1 tsp. white or brown sugar","½ cup thinly sliced (root to stem) red onion or shallots","¼ cup thinly sliced green onions","12 mint leaves, torn","½ cup coarsely chopped cilantro leaves with tender stems","2 Tbsp. fresh lime juice","2 small wedges green cabbage","½ cucumber, peeled lengthwise in striped segments, cut crosswise into ½\" slices","16 green beans, trimmed"," Cooked sticky rice (for serving)"],"instructions":"Roast 2 cups dried bird chiles, pulla chiles, or chiles de árbol, stemmed in a dry wok over medium-low heat, stirring occasionally, until they turn a deep, dark crimson (almost brown) and give off a sweet and earthy smell (not burnt). The process shouldn’t take more than 10 minutes, but it pays to be vigilant in making sure they toast evenly and slowly. Remove from heat and let sit until cool enough to handle. Transfer to a food processor, blender, or spice grinder and grind until slightly finer than the crushed red pepper you’d find at a pizza shop. Be careful not to breathe in any chile dust when you remove the lid. Do Ahead: Roasted chile powder can be made 3 months ahead. Store in a sealed container in a cool, dry place. Cook 1 cup uncooked glutinous rice or jasmine rice in a dry wok over medium heat, stirring occasionally at first, then more frequently as it browns. Once you smell the toasting rice, stir in 1¼\" piece fresh galangal, cut into thin coins, 1 Tbsp. thinly sliced lemongrass, and 2 makrut (Thai) lime leaves. Continue to cook until rice develops a deep amber golden hue, about the same color as brown rice, 15–20 minutes. Let cool. Transfer rice mixture to a food processor or spice grinder and pulse until mixture is the consistency of granulated sugar. Do Ahead: Toasted rice powder can be made 1 month ahead. Store in an airtight container in a cool, dry place. Place ¾ lb. ground chicken in a small saucepan and cover with water. Cook over medium heat, stirring, until chicken is opaque but still soft. Using a spatula or spoon, break meat into small clumps. Drain off water, then stir in 3 Tbsp. fish sauce and 1 tsp. sugar until sugar is dissolved. Let cool. Add seasonings, in this order, giving a quick toss after each addition: 1½ Tbsp. Roasted Chile Powder, ½ cup thinly sliced (root to stem) red onion or shallots, ¼ cup thinly sliced green onions, 12 mint leaves, torn, ½ cup coarsely chopped cilantro leaves with tender stems, and 2 Tbsp. fresh lime juice. Once you’re ready to serve, add 1 Tbsp. Toasted Rice Powder at the last moment. Serve with the leaves from 2 small wedges green cabbage, ½ cucumber, peeled lengthwise in striped segments, cut crosswise into ½\" slices, and 16 green beans, trimmed (uncooked), and cooked sticky rice alongside. Editor’s Note: This recipe first appeared on Bon Appétit in October 2017. Head this way for more of our favorite Thai recipes →","tags":["thai","laotian","ground chicken","larb","rice","green cabbage","galangal","thai chile","dinner","stir-fry"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":""},"servings":"","image":"https://assets.bonappetit.com/photos/669ae5bb4a15da662e94fc6a/16:9/w_1280,c_limit/larb-gai_LEDE_V2_071824_0707_VOG_final.jpg"}