{"name":"Layered Panzanella Salad","description":"This panzanella salad recipe is the best! It features ripe tomatoes, homemade croutons and light vinaigrette. Layering the ingredients is key!","ingredients":["Homemade croutons","4 ounces ciabatta or crusty sourdough bread, preferably stale (¼th of a standard 1-pound loaf or 3 cups cubed)","2 tablespoons extra-virgin olive oil","¼ teaspoon fine sea salt","Vinaigrette","2 tablespoons extra-virgin olive oil","3 tablespoons red wine vinegar","½ teaspoon dried oregano, plus extra for garnish","1 large clove garlic","½ teaspoon fine sea salt","Freshly ground black pepper, to taste","½ small red onion, thinly sliced","Salad","1 pound cherry or grape tomatoes, halved or quartered if large","1 pound additional tomatoes (smaller tomatoes are better), cut into bite-sized pieces","2 mini cucumbers or 1 small cucumber, thinly sliced into rounds","8 ounces fresh mozzarella, optional (buy small mozzarella balls or tear a larger ball into bite-sized pieces)","⅓ cup roughly chopped fresh basil (about ½ ounce)","2 tablespoons (total) thinly sliced Kalamata olives and/or capers"],"instructions":"To make the croutons: Preheat the oven to 425 degrees Fahrenheit. If desired, line a large, rimmed baking sheet with parchment paper for easy clean-up. Slice your bread* into 1-inch cubes (no larger) and place them on the baking sheet. Drizzle the cubes with the olive oil, sprinkle them with the salt, and toss until thoroughly combined. Bake until deeply golden, about 7 to 10 minutes. Meanwhile, prepare your salad dressing: In a bowl, combine the olive oil, vinegar, oregano, garlic, salt, and a generous amount of black pepper. Whisk until combined. We’re going to add the onion to mellow its flavor and lightly pickle it—first, cut your sliced onion down the middle to make the pieces more manageable. Then, stir the onions into the dressing. Place the bowl in the refrigerator while you assemble the salad. To prepare the salad: Transfer the prepared tomatoes to a large serving platter. Nestle about half of the croutons in between the tomatoes, and distribute the rest on top. Place the cucumber rounds and mozzarella all over the salad. Use a fork or your hands to distribute the lightly pickled onions all over. Give the remaining dressing a stir and drizzle it over the salad. Sprinkle the basil and olives and/or capers on top, followed by a light sprinkling of extra black pepper and dried oregano. Ideally, let the salad marinate for 20 minutes (or up to 1 hour) before serving.","tags":["dairy free","egg free","Independence Day","Italian","Mediterranean","nut free","recipes","salads","side dishes","soy free","summer","vegan"],"time":{"prep":"30 minutes","cook":"10 minutes","active":"","inactive":"","ready":"","total":"40 minutes"},"servings":"8 servings","image":"https://cookieandkate.com/images/2019/09/layered-panzanella-salad-recipe-3.jpg"}