{"name":"Lemony Asparagus Pasta","description":"Bright from lemon and fresh with basil, this easy asparagus pasta recipe from L.A.-based pastaiolo Evan Funke tastes like springtime in Italy.","ingredients":[" Kosher salt","1 lb. spaghetti","⅔ cup extra-virgin olive oil","1 large bunch asparagus, trimmed, thinly sliced on a deep diagonal","4 garlic cloves, smashed","4 (3\"-long) strips lemon zest, plus 2 lemons, halved","½ tsp. crushed red pepper flakes","8 large fresh basil leaves","2 oz. freshly grated Parmesan cheese (about 1 cup), plus more for serving"],"instructions":"Bring a large pot of salted water to a boil. Add 1 lb. spaghetti and cook pasta, stirring occasionally, until al dente. Drain pasta, reserving 1½ cups pasta cooking water. Meanwhile, heat ⅔ cup extra-virgin olive oil in a large Dutch oven or other heavy pot over medium-high until shimmering. Add 1 large bunch asparagus, trimmed, thinly sliced on a deep diagonal, season with kosher salt, and cook, stirring often, until just beginning to take on color, about 1 minute. Add 4 garlic cloves, smashed, 4 (3\"-long) strips lemon zest, and ½ tsp. crushed red pepper flakes; cook, stirring, until fragrant, about 30 seconds. Remove from heat and let sit until pasta is done. Add cooked pasta and 8 large fresh basil leaves to pot with asparagus mixture and return to medium-high heat. Squeeze juice from 2 lemons, halved, into pot and add 2 oz. freshly grated Parmesan cheese (about 1 cup), and 1 cup reserved pasta cooking liquid. Cook, tossing vigorously and adding more pasta cooking liquid if needed, until sauce is creamy and emulsified and pasta is coated, about 1 minute. Taste and season with more salt if needed. Remove and discard garlic. Divide pasta among bowls, garnish each with a lemon strip, and top with more Parmesan cheese.\nEditor’s note: This asparagus pasta recipe was first printed in our April 2020 issue as “Spaghetti al Limone With Asparagus.” Head this way for more of our very best pasta dinners →","tags":["pasta","italian","spaghetti","asparagus","lemon","parmesan","spring","weeknight meals","easy","quick","main","vegetarian","healthyish","sauté","dinner"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":""},"servings":"","image":"https://assets.bonappetit.com/photos/5e6bb3bc06b34800084b97d9/16:9/w_1280,c_limit/0420-Pasta-Spaghetti-Limone-With-Asparagus.jpg"}