{"name":"Little cherry and chestnut chocolate brownies","description":"Brownies are absolutely gorgeous, add some cherries and chestnuts to the mix and for a delicious twist, try Jamie's chocolate and cherry brownies recipe.","ingredients":["175 g unsalted butter","200 g good-quality dark chocolate (70% cocoa solids) , broken up","75 g dried cherries","75 g roasted chestnuts , chopped","75 g cocoa powder , sifted","100 g plain flour , sifted","1 teaspoon baking powder","300 g golden caster sugar","4 large free-range eggs","icing sugar , for dusting","500 ml crème fraîche , to serve","1 orange , zest of, to serve"],"instructions":"Brownies are absolutely gorgeous. I’ve used cherries and chestnuts in mine – although it may not seem like the most obvious pairing, the chocolate makes them friends and I think they complement each other well. Arrange on boards or plates around the room for people to pick at; there won’t be any left over! Preheat the oven to 180°C/350°F/gas 4. Line a 20cm x 30cm baking tin with greaseproof paper. In a bowl over a pan of simmering water, melt the butter and the chocolate, mixing gently until smooth. Stir in the cherries and chestnuts then remove from the heat. In a separate bowl, mix the cocoa powder, flour, baking powder and sugar. Add this to your melted chocolate mixture then stir until it’s all combined really well. Beat your eggs then mix these in, too. Pour this brownie mix into the baking tin, and place in the oven for around 15 to 20 minutes. You don’t want to overcook it, so you don’t want a skewer to come out clean. The brownie should be slightly springy on the outside but gooey in the middle. Allow them to cool in the tray for 30 minutes then carefully turn them out on to a chopping board and cut into 3cm squares. Pile them on plates and dust with icing sugar. Serve with bowls of crème fraîche, with orange zest grated over.","tags":["Christmas","Dinner Party","British","Fruit","Baking"],"time":{"prep":"","cook":"Time 35 minutes plus cooling time","active":"","inactive":"","ready":"","total":"Time 35 minutes plus cooling time"},"servings":"Makes 50 bite-sized brownies","image":"https://cdn.jamieoliver.com/recipe-database/oldImages/medium/320_1_1439206870.jpg"}