{"name":"Mini quiches","description":"Everythings better in mini! These tasty, veg-packed snacks are fun to whip up with the kids and can be made with your choice of vegetables and meat toppings.","ingredients":["125 g plain flour, plus extra for dusting","65 g unsalted butter , (cold)","1 small onion","1 clove of garlic","olive oil","1 handful of your favourite vegetables, such as baby spinach, mushrooms, broccoli, peppers, cherry tomatoes, courgettes, peas","optional: 1 rasher of higher-welfare smoked streaky bacon or 1 slice of smoked higher-welfare ham","1 large free-range egg","100 ml single cream","60 g your favourite cheese, such as Cheddar, Stilton, feta, goat’s cheese"],"instructions":"Put the flour into a mixing bowl, cube and add the cold butter, then rub in with your fingers until the mixture resembles fine breadcrumbs. Add 2 tablespoons of cold water and mix until you get a rough dough. Bring the dough into a ball with your hands, then wrap and rest in the fridge for at least 30 minutes. Peel and finely chop the onion and garlic, then place in a large non-stick frying pan on a medium heat with 1 tablespoon of olive oil and cook for 5 minutes, or until soft, stirring regularly. Prep your chosen vegetables – clean and slice the mushrooms, slice the broccoli into very small florets, deseed and finely slice the peppers, finely slice the cherry tomatoes, dice the courgettes. Add the vegetables to the pan (there’s no need to cook the tomatoes) and cook for 3 to 4 minutes, stirring occasionally and adding splashes of water, if needed. Finely chop and add the bacon or ham (if using), and season to perfection. Crack the egg into a jug, pour in the cream and beat with a fork, then grate in most of your chosen cheese. Preheat the oven to 190°C. Dust a clean surface and a rolling pin with flour and roll out the pastry so it’s around the thickness of a £1 coin. Stamp out rounds of pastry using a 10cm pastry cutter and gently push them into the wells of a muffin tray (leftover pastry can be pushed back into a ball and re-rolled). Prick each base with a fork. Pop paper cases inside each well, fill with baking beans or uncooked rice, and blind bake for 15 minutes, removing for the final 5 minutes. Divide the vegetable mixture between the pastry cases, pour over the egg mixture and grate over the rest of the cheese. Bake for 15 minutes, or until golden and just set. Delicious served hot or cold.","tags":["Vegetables","Pork"],"time":{"prep":"","cook":"Time 1 hour 15 minutes plus resting","active":"","inactive":"","ready":"","total":"Time 1 hour 15 minutes plus resting"},"servings":"Makes 6","image":"https://cdn.jamieoliver.com/recipe-database/medium/158952239.jpg"}