{"name":"One Pan Mediterranean Chicken","description":"","ingredients":[" 6 bone-in skin-on chicken thighs, 3 pounds*, fat trimmed and patted dry with paper towel"," 1 ½ teaspoons paprika, divided"," 2 teaspoons kosher salt, divided"," ¼ teaspoon ground black pepper, divided"," 1 tablespoon extra virgin olive oil"," 1 large  red onion, peeled, quartered, and sliced into ½” pieces"," 2 medium  zucchinis, sliced into ½” semi-circles"," ¼ cup kalamata olives pitted and roughly chopped"," 2 cups cherry tomatoes, 12 ounces"," 6 garlic cloves, minced"," ½ cup dry white wine"," ¼ cup vegetable broth"," 1 tablespoon fresh lemon juice"," 2 teaspoons dried oregano"," 2 tablespoons capers, drained"," 2 teaspoons honey"," ½ cup chopped fresh parsley, divided"],"instructions":"Season the chicken all over with 1 teaspoon paprika, 1 ½ teaspoon salt, and ⅛  teaspoon pepper. Add olive oil to a large-wide skillet (or 3.3 Qt Dutch oven) over medium heat. Add chicken to the pan, skin-side facing down, and cook for about 7 minutes until the skin is golden and slightly crisped. Flip the chicken and cook for 2 minutes. Remove chicken from skillet and set aside on a plate. To the now-empty skillet, add red onion and zucchini. Cook for 6-8 minutes, or until slightly tender. Add the olives, tomatoes, garlic, wine, broth, lemon juice, oregano, capers, honey, half of the parsley, remaining ½ teaspoon salt, remaining ⅛ teaspoon pepper, and remaining ½ teaspoon paprika. Simmer over medium-high heat for 5 minutes. Use your spoon to scrape off any browned bits at the bottom of the pan and mix them into the sauce. Return chicken to the pan, cover, and simmer for 23-25 minutes or until the chicken has cooked through (registering at least 165°F on an instant-read thermometer). Uncover the pan, remove the chicken from the pan, and simmer the sauce for an additional 10 minutes to help reduce and slightly thicken it. Return the chicken back to the pan. Garnish with remaining parsley and lemon slices before serving.","tags":[""],"time":{"prep":"20 minutes mins","cook":"40 minutes mins","active":"","inactive":"","ready":"","total":" "},"servings":"6","image":"https://gimmedelicious.com/wp-content/uploads/2023/07/One-Pan-Mediterranean-Chicken-Hero-5x7-2.jpg"}