{"name":"One-Pot Salmon and Shiitake Rice","description":"It doesn't get easier than this salmon and shiitake mushroom mixed rice dish that comes together in a single pot. Don't forget the scallion seasoning sauce.","ingredients":["2 cups short- or medium-grain white rice, rinsed until water runs almost clear","¼ cup quinoa","1 Tbsp. mirin or sake","2 tsp. plus 3 Tbsp. soy sauce","5 oz. shiitake mushrooms, thinly sliced","3 4–6-oz. skinless salmon fillets"," Kosher salt","2 Tbsp. unseasoned rice vinegar or apple cider vinegar","1 Tbsp. toasted sesame oil","5 scallions, thinly sliced, divided"],"instructions":"Gently stir 2 cups short- or medium-grain white rice, rinsed until water runs almost clear, ¼ cup quinoa, 1 Tbsp. mirin or sake, 2 tsp. soy sauce, and 2½ cups water in a small Dutch oven or medium heavy saucepan with a tight-fitting lid to combine. Arrange 5 oz. shiitake mushrooms, thinly sliced, on top (no need to stir into rice). Gently place three 4–6-oz. skinless salmon fillets over mushrooms; lightly season fish with kosher salt. Set pot over medium-high heat, cover, leaving lid slightly askew, and cook until small bubbles appear along the sides, about 5 minutes. Reduce heat to medium, cover pot tightly, and cook undisturbed 15 minutes. Remove from heat (do not remove lid) and let sit 20 minutes. Meanwhile, mix 2 Tbsp. unseasoned rice vinegar or apple cider vinegar, 1 Tbsp. toasted sesame oil, 2½ scallions, thinly sliced, and remaining 3 Tbsp. soy sauce in a small bowl to combine. Set scallion-soy dressing aside. Uncover rice mixture, letting any water from lid drip back into pot. Using a rice paddle, heatproof rubber spatula, or flat-sided wooden spoon, carefully break apart salmon fillets into smaller pieces and fold into rice mixture. Mix in remaining 2½ scallions, thinly sliced. Transfer rice mixture to shallow bowls and serve with reserved scallion-soy dressing alongside for spooning over.","tags":["main","dinner","dairy-free","nut-free","salmon","shiitake mushroom","steam","rice","rice and grain bowl","one-pot meals","quinoa","weeknight meals"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":""},"servings":"","image":"https://assets.bonappetit.com/photos/663949f04e90b4f89d3d6682/16:9/w_1280,c_limit/BA-DIS_One-Pot-Salmon-Shiitake-Rice_WEB.jpg"}