{"name":"Peach Brussels Sprouts Crunch Salad","description":"Gorgeous peach brussels sprouts salad with crunchy nuts and a creamy tahini poppy seed dressing. The perfect summer lunch or side dish!","ingredients":["1 batch tahini poppy seed dressing","For the salad:","1 pound brussels sprouts, outer yellow leaves and stems removed, and shredded","2 cups sliced peaches (from about 2 large or 3 medium peaches)","⅓ cup feta crumbles (optional but delicious!)","For the nut crunch mixture:","⅓ cup sliced almonds","1/4 cup raw pepitas (pumpkin seeds)","½ tablespoon pure maple syrup","Sea salt"],"instructions":"In a small bowl mix together tahini, lemon juice, maple syrup/honey, dijon mustard, poppyseeds, onion powder, salt and water to thin the dressing. Taste and add more maple syrup or honey if you like your poppyseed dressing a bit sweeter. Next, shred the brussels sprouts by using a food processor with the slicing attachment and pulse until the brussels sprouts are thinly sliced. If you don’t have a food processor, feel free to use a sharp knife to thinly slice. You also have the option of buying already shredded/shaved brussels sprouts in a bag from the store. Add brussels to a large bowl and pour the dressing all over. Use tongs to coat the brussels with the dressing. Let the dressing sit and marinate the brussels for 10-15 minutes. While the brussels marinate and soak up the dressing, you can chop and prep all your other ingredients. Finally make your nut crunch mixture: place sliced almonds and pumpkin seeds in a skillet over medium heat. Toast for 3-5 minutes, stirring frequently until they turn slightly golden brown and fragrant, then turn off heat and immediately add in maple syrup and a pinch of sea salt. Stir for 30 more seconds to coat, then transfer to a plate or piece of parchment paper to cool for a few minutes. Some of the nuts will slightly stick together but this is what we want for the ‘nut crunch’ in the salad. Allow to cool for 5 minutes. Add the sliced peaches to the brussels salad along with the nut crunch mixture and feta crumbles and toss to combine. Enjoy!","tags":[],"time":{"prep":"20 minutes minutes","cook":"10 minutes minutes","active":"","inactive":"","ready":"","total":"30 minutes minutes"},"servings":"4","image":"https://www.ambitiouskitchen.com/wp-content/uploads/2021/07/Peach-Brussels-Sprouts-Crunch-Salad-7long.jpg"}