{"name":"Peasto pasta","description":"Peas are the star of this perfect pesto recipe! This delicious dish takes only 25 minutes, and is perfect to cook with kids for the whole family.","ingredients":["320 g frozen peas","1 small clove of garlic","1 bunch of basil or mint (30g)","40 g pine nuts","40 g Parmesan or Cheddar cheese , plus extra for grating","extra virgin olive oil","1 lemon","500 g fresh lasagne sheets","4 x 120g higher-welfare skinless chicken breasts","olive oil"],"instructions":"Place the peas in a microwave-proof bowl and microwave on high (800W) for 3 minutes, stirring halfway. Peel the garlic and place in a pestle and mortar with a pinch of sea salt. Pick in most of the herb leaves and bash to a paste. Add the pine nuts, finely grate in the cheese and muddle in 2 tablespoons of extra virgin olive oil. Drain and add the peas to the herby mixture, then roughly bash it all up. Squeeze in the lemon juice and season to taste. Use scissors (go for crinkle-cut scissors, if you have them) to cut the lasagne sheets into fun shapes, tearing up the offcuts, then put aside. Place the chicken breasts between two sheets of greaseproof paper, then use a rolling pin or the base of a heavy pan to bash and flatten them out to around 1cm thick. Place a large non-stick frying pan on a medium heat with 1 tablespoon of olive oil, fry the chicken for 3 minutes on each side, or until golden and cooked through, then remove to a plate to rest – you’ll need to work in batches. Cook the pasta in a large pan of boiling salted water for 2 to 3 minutes, or until tender, then drain, reserving a mugful of starchy cooking water. Carefully toss the pasta with the peasto, loosening with splashes of pasta water, if needed. Plate up the pasta, slice the chicken and arrange on top, and finish with the leftover herbs and an extra grating of cheese, if you like.","tags":["Chicken"],"time":{"prep":"","cook":"Time 25 minutes","active":"","inactive":"","ready":"","total":"Time 25 minutes"},"servings":"Serves 4","image":"https://cdn.jamieoliver.com/recipe-database/medium/158952244.jpg"}