{"name":"Perfect Blueberry Muffins","description":"An obsessively good one-bowl blueberry muffin recipe with more berries than ever and a tall, bronzed, crunchy lid.","ingredients":["5 tablespoons (70 grams) unsalted butter, cold is fine","1/2 cup  (100 grams) sugar","Finely grated zest from half a lemon","3/4 cup (180 grams) plain unsweetened yogurt or sour cream","1 large egg","1 1/2 teaspoons (7 grams) baking powder","1/4 teaspoon baking soda","1/4 teaspoon fine sea or table salt","1 1/2 cups (195 grams) all-purpose flour","1 1/4 to 1 1/2 cups (215 to 255 grams) blueberries, fresh or frozen (no need to defrost)","3 tablespoons (35 grams) turbinado sugar (sugar in the raw)"],"instructions":"Heat oven to 375°F. Line a muffin tin with 9 paper liners or spray each cup with a nonstick spray. Melt butter in the bottom of a large bowl and whisk in sugar, zest, yogurt and egg until smooth. Whisk in baking powder, baking soda and salt until fully combined, then lightly fold in flour and berries. Batter will be very thick, like a cookie dough. Divide between prepared muffin cups and sprinkle each with 1 teaspoon turbinado sugar, which will seem over-the-top but I promise, will be the perfect crunchy lid at the end. Bake for 25 to 30 minutes, until tops are golden and a tester inserted into the center of muffins comes out clean (you know, except for blueberry goo). Let cool in pan for 10 minutes then the rest of the way on a rack.  These, like most muffins, are best on the first day, we’ve found through extensive “research” that if you run them split open under a broiler on day two with a pat of salted butter, it’s so good that you’re going to forever hope for more blueberry muffin leftovers. Extended notes! This began with an adaptation of an old Cook’s Illustrated blueberry muffin but with so many changes, it no longer resembles the original. I use yogurt instead of buttermilk, less sugar, I’ve adapted it to make it one-bowl and then in August 2016 it got the biggest overhaul yet after a month of blueberry muffin studies. From Stella Parks at Serious Eats, I came to agree that a full teaspoon of coarse sugar on top of each muffin sounds crazy but actually makes a delightfully crunchy lid. If the muffin underneath it isn’t too sweet, it doesn’t put it over the top at all — it’s just right. I also found her combination of coriander (I know!) and nutmeg crazy good and worth trying if you’re curious, even if I’m still defaulting to my lemon zest only here. From Blythe Danner, I realized you could put an inordinate amount of berries in each muffin and still have a very good muffin. I ended up doubling the berries in my go-to in the last batch and regret not-a-thing. (Should you be hesitant, just an increase from 3/4 cups to 1 1/4 is excellent but not over-the-top improvement.) I found it made 9 taller and more gorgeous muffins than it did of the 10 to 11 in the original recipe; just double it for a crowd. ","tags":["Blueberries","Breakfast","Brunch","Muffin/Quick Bread"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":"30 to 40 minutes"},"servings":"9 standard muffins","image":"https://i0.wp.com/smittenkitchen.com/wp-content/uploads//2010/08/perfect-blueberry-muffins.jpg?fit=1200%2C800&ssl=1"}