{"name":"Perfect Blueberry Muffin Loaf","description":"Everything we love about perfect blueberry muffins (one-bowl, hand-whisked, the crunchiest muffin top, a comically high concentration of blueberries) in one giant, craggy loaf.","ingredients":["8 tablespoons (1/2 cup or 115 grams) unsalted butter, cold is fine","3/4 cup (150 grams) granulated sugar","Finely grated zest from one lemon","1 cup (225 grams) plain unsweetened Greek-style yogurt","2 large eggs","2 teaspoons baking powder","1/2 teaspoon baking soda","3/4 teaspoon kosher salt","2 cups (260 grams) all-purpose flour","2 1/4 cups (320 grams or 11.5 ounces) fresh or frozen blueberries (no need to defrost)","3 tablespoons (35 grams) turbinado sugar (sugar in the raw)"],"instructions":"Heat oven to 375°F. Line a loaf pan (see Note up top about size) with one big piece of parchment paper pressed into the corners and up the sides, as shown here. I leave the excess paper extended up over the rim, which also helps protect you against overflow. Melt butter in a large bowl, then whisk in granulated sugar and zest. Add yogurt and eggs and whisk to evenly combine. Sprinkle surface of batter with baking powder, baking soda, and salt and whisk thoroughly into the batter, several times more around the bowl than is necessary for it to look mixed. Add flour and berries and use a flexible spatula or spoon to mix them in so that no pockets of flour remain. Batter will be very, very thick. Spoon into prepared loaf pan and drop it on the counter a few times to make sure there no air pockets. Smooth the top and sprinkle it with turbinado sugar. It will seem like way too much but I beg you not to skimp at all; the batter is not very sweet but the crunchy top the sugar provides is one of the best parts. Bake for 60 to 70 minutes, or until a skewer inserted into a few places in the loaf come out batter-free. If your berries were frozen going in, this might even need 5 additional minutes. Remove from oven and let cool in pan. Use parchment paper to lift it out of the pan and cut into thick slices. Do ahead: I use the parchment paper to transfer leftovers back to the loaf pan. Store at room temperature for 3 to 4 days, longer in the fridge. I keep the loaf uncovered/unwrapped which allows the top to retain its crunch. The sides are kept from drying out by the parchment and loaf. The loaf freezes well, wrapped tightly. P.S. Yes, of course you can use any other kind of berry here. I tested a few rounds with frozen mixed berry mixes, and as long as the strawberries aren’t comically huge (I chopped ones that were), it works great.","tags":["Blueberries","Brunch","Everyday Cakes","Food Gifts","Muffin/Quick Bread","Recipe"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":"90 minutes"},"servings":"8 to 10","image":"https://i0.wp.com/smittenkitchen.com/wp-content/uploads/2024/05/blueberrry-muffin-loaf-6-scaled.jpg?fit=1200%2C800&ssl=1"}