{"name":"Pesto-Chicken Penne Casseroles","description":"Creamy, flavorful and so easy to fix, this meal-in-one will wow family and friends. Get ready for recipe requests for this easy chicken casserole! —Laura Kayser, Ankeny, Iowa","ingredients":["Penne pasta: You’ll need just a standard 1 pound package of penne pasta for this recipe, something you likely have on hand already.","Cooked chicken: The pre-cooked chicken is best if you cook it fresh and cube it yourself, of course, but you can use store-bought cooked chicken that comes in a can or bag.","Italian cheese blend: Don’t skimp on the cheese. It adds flavor and texture and helps bind other ingredients to the pasta noodles.","Fresh baby spinach: The spinach, wilted down into the dish, works in concert with the pesto, helping ground some of the more potent flavors.","Crushed tomatoes: Often, you want to incorporate the liquid in a can of tomatoes into a recipe, but in this case, it’s best to drain most of the fluids.","Alfredo sauce: Thick, creamy, and rich, Alfredo sauce is the anchor of this dish even though it’s pesto that made it into the title.","Milk: 2% milk does well in this recipe and doesn’t need much more creaminess thanks to the Alfredo sauce, but of course, whole milk is most welcome as well.","Pesto: The recipe as written calls for prepared jarred pesto, but if you’ve got quite the home garden bristling with basil, you can go fresh for an even richer taste.","Seasoned bread crumbs: Just a half cup of seasoned bread crumbs brings a lovely texture and a savory touch to this dish.","Parmesan cheese: Our last and tangiest ingredient, save for the oil in which you’ll combine this classic cheese and those bread crumbs, the Parmesan plays a major role here despite each portion of casserole using just a quarter cup.","Olive oil: What’s to be said about olive oil other than it’s as essential to Italian cooking as water is to all of life?","1 package (16 ounces) penne pasta","6 cups cubed cooked chicken","4 cups shredded Italian cheese blend","3 cups fresh baby spinach","1 can (15 ounces) crushed tomatoes","1 jar (15 ounces) Alfredo sauce","1-1/2 cups 2% milk","1 jar (8.1 ounces) prepared pesto","1/2 cup seasoned bread crumbs","1/2 cup grated Parmesan cheese","1 tablespoon olive oil"],"instructions":"Cook pasta according to package directions. Meanwhile, in a large bowl, combine the chicken, cheese blend, spinach, tomatoes, Alfredo sauce, milk and pesto. Drain pasta and add to chicken mixture; toss to coat. Transfer to 2 greased 8-in. square baking dishes. In a small bowl, combine the bread crumbs, Parmesan cheese and oil; sprinkle over casseroles. Cover and freeze 1 casserole for up to 3 months. Cover and bake the remaining casserole at 350° for 40-45 minutes or until bubbly. To use frozen casserole: Thaw in the refrigerator overnight. Remove from the refrigerator 30 minutes before baking. Cover and bake at 350° for 50-60 minutes or until bubbly.","tags":[],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":""},"servings":"","image":"https://www.tasteofhome.com/wp-content/uploads/2018/01/exps47791_SD1785603D59B_WEB-4.jpg"}