{"name":"Pork Lumpia","description":"Recipe with instructions for how to make deep fried Filipino lumpia. These spring rolls are made with ground pork, cabbage, carrots and more.","ingredients":["2 pounds lean ground pork","4 cups shredded cabbage, or one (397g/14oz)  bag of cole slaw","1 large carrot, peeled and chopped into chunks","6 cloves garlic, minced","2 tbsp soy sauce","3 tbsp dry onion soup mix","1 tsp salt","75 spring roll wrappers","1 tbsp corn starch","1/4 cup water","oil, for deep fryer"],"instructions":"Brown the ground pork in a skillet over medium heat until fully cooked through. Let cool slightly. Drain the grease and using a mesh strainer, press out any of the excess liquid. Set aside and let cool to room temperature. Place the shredded cabbage and carrot in a food processor. Pulse until finely chopped, but not pulsed into a paste. In a large bowl, add the ground pork, pulsed vegetables, garlic, soy sauce and salt. Stir until well combined. Make the corn starch paste. In a small bowl, stir the corn starch with the water until dissolved. Heat in the microwave for 25 seconds and then stir again. Take one spring roll wrapper and place on a work surface. Place a small spoonful of the filling near the middle of the wrapper but a little closer to you. Lift the corner of the wrapper by you over the filling and slightly tuck it under.  Start to roll the lumpia away from you, forming it into a small log top shape. Fold the side corners into the lumpia and tuck them under as you continue to roll. Try to roll tightly but be careful not to let the wrapper tear. At the point when the lumpia is mostly rolled with just the top corner of the wrapper showing, dip a finger into the corn starch paste. Rub that on the top corner of the wrapper which serves as an adhesive. Continue to roll the lumpia over the final corner of the wrapper. Because of the corn starch mixture, the corner should stick easily and seal the lumpia. Heat oil in a deep fryer to 375F. Fry the lumpia in batches, around 6-8 at a time. Fry until the lumpia are a nice golden brown. This should take 3-4 minutes. Remove from the deep fryer and place on a couple pieces of paper towel to absorb any of the excess oil. Continue to fry the lumpia. Serve the lumpia while still hot, with some plum sauce for dipping.","tags":[],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":""},"servings":"75","image":"https://www.theblackpeppercorn.com/wp-content/uploads/2024/01/Pork-Lumpia-15.jpg"}