{"name":"Pot-roast pork with Chianti jus","description":"A beautiful contrast of crispy cured meat with slices of juicy pork, soft cubes of celeriac, celeriac crackling and a mouth-watering fruit compote. ","ingredients":["butcher's string","1 bunch of fresh sage , (15g)","2 cloves of garlic","olive oil","red wine vinegar","1 kg higher-welfare skinless boneless saddle-eye pork loin","18 slices of Coppa di Parma","1 knob of unsalted butter","1 red onion","1 stick of celery","3 sprigs of fresh rosemary","200 ml Chianti red wine","2 celeriac , (1kg each)","½ a bunch of fresh thyme , (15g)","FRUIT COMPOTE","400 g rhubarb","1 green eating apple","1 red eating apple","1 tablespoon dark brown sugar","1 knob of unsalted butter"],"instructions":"Pick the sage leaves into a pestle and mortar, add a pinch of sea salt, then bash to a paste. Peel and smash in the garlic, muddle in 2 tablespoons each of oil and red wine vinegar, then season with black pepper. Rub the paste all over the pork, getting it into all the nooks and crannies, then cover and pop in the fridge for at least 30 minutes, preferably overnight. Preheat the oven to 180°C/350°F/gas 4. Place a large sheet of greaseproof paper on a flat surface and rub lightly with oil. Arrange the Coppa di Parma on the paper, slightly overlapping, to make a large square. Place the pork at one end and roll it up tightly in the Coppa, using the paper to help you. Carefully remove the paper and secure the pork all the way along with butcher’s string. Place a large non-stick frying pan on a medium-high heat with a drizzle of oil and the butter, add the pork and brown all over, turning with tongs. Peel the onion and cut into eighths, and trim and roughly chop the celery, adding to the pan as you go. Strip in 2 sprigs of the rosemary, then pour in most of the wine and let it bubble and cook away for 1 minute. Transfer the pan to the oven and roast for 40 minutes, or until golden and cooked through, turning and basting every 10 minutes, and adding the last of the Chianti towards the end. Meanwhile, scrub both celeriac, then carefully peel the knobbly skin with a sharp knife. Place the peelings in a roasting tray, toss with 1 tablespoon of oil and a little salt and pepper, then pop in the bottom of the oven with the pork. Chop the rest of the celeriac into rough 2cm chunks, then place in a large casserole pan on a medium-low heat with 1 tablespoon of oil. Pick in the thyme leaves, then cook with the lid on for 30 minutes, or until softened, stirring occasionally and adding splashes of water, if needed. To make the compote, trim and chop the rhubarb into 5cm chunks and place in a roasting tray. Core the apples, cut into wedges and place in the tray, then add a pinch of pepper, the sugar, butter and 1 tablespoon of red wine vinegar. Drop in the remaining rosemary sprig, then place in the oven for 20 to 30 minutes, or until you’re able to mash the fruit slightly. Remove the pork from the oven and let it rest in its juices while the fruit and celeriac finish cooking. Carve the pork (discard the string) and serve with the fruit compote, celeriac and crispy celeriac crackling, spooning over the pan juices. Delicious served with seasonal steamed greens.","tags":["Pork","Sunday lunch","Rhubarb","Fruit"],"time":{"prep":"","cook":"Time 1 hour 30 minutes plus marinating","active":"","inactive":"","ready":"","total":"Time 1 hour 30 minutes plus marinating"},"servings":"Serves 8","image":"https://cdn.jamieoliver.com/recipe-database/medium/117650131.jpg"}