{"name":"Raspberry Bars with Oatmeal Cookie Crumble","description":"Healthy gluten free raspberry crumble bars made with fresh raspberries. These raspberry pie bars are easy to make and perfect for summer!","ingredients":["For the base + topping:","1 1/2 cups gluten free oat flour (or sub all purpose flour or 1:1 gf all purpose flour)","1 cup old-fashioned rolled oats, gluten free if desired","1/2 cup packed brown sugar (or sub coconut sugar but you may not get the best 'crumble')","¼ teaspoon baking soda","¼ teaspoon salt","Optional to make it lemon flavored: zest from 1 lemon","8 tablespoons butter or vegan butter stick, melted","1 teaspoon vanilla extract","¼ teaspoon almond extract","For the raspberry filling:","3 heaping cups fresh or frozen raspberries","3 tablespoons pure maple syrup","1 teaspoon vanilla extract","1 tablespoon tapioca flour or arrowroot starch (can also use cornstarch)","Optional to make the with a hint of lemon flavor: zest from 1 lemon and 1 tablespoon lemon juice","Pinch of salt"],"instructions":"Preheat oven to 350 degrees F. Line an 8x8 inch pan with parchment paper and generously spray with nonstick cooking spray. Set aside. Make the base + topping: In a large bowl, use a fork to mix together the oat flour (or flour), oats, coconut or brown sugar, baking soda, salt and lemon zest, if using. Add in melted butter, vanilla extract and almond extract and stir until a nice crumble forms and dough begins to clump together. Place 1 3/4 cups of the mixture into the prepared pan and place the remaining mixture into the fridge (the remaining mixture will be used for the topping). Use your hands to evenly press the dough to the bottom of the pan. Next make your raspberry filling: place a medium pot over medium heat. Add in raspberries, maple syrup, vanilla extract, tapioca flour or arrowroot, lemon zest and juice, if using, and salt. Use a wooden spoon to press down and break down the raspberries just a bit. Bring to a boil, then reduce heat to a simmer and cook for 3-5 more minutes until mixture is thickened up and nicely coats the back of a wooden spoon. Pour mixture over the crust and use a spoon to spread evenly over the base. Take the remaining topping out of the fridge. By now there should be some nice crumbles that have clumped together. Sprinkle the topping over the filling. Bake for 30 minutes or until the filling is bubbly and the topping is golden. Allow bars to cool completely on a wire rack before transferring to the fridge to chill. Bars are delicious served at room temperature or straight out of the fridge. Use a sharp knife to cut into 12 or 16 bars before serving.","tags":[],"time":{"prep":"10 minutes minutes","cook":"35 minutes minutes","active":"","inactive":"","ready":"","total":"45 minutes minutes"},"servings":"12","image":"https://www.ambitiouskitchen.com/wp-content/uploads/2018/06/Raspberry-Crumble-Bars-7long.jpg"}