{"name":"Raw vegan spag bol","description":"This raw vegan spaghetti bolognese recipe is a lighter alternative to the traditional pasta. Spaghetti is swapped for courgetti, and the sun-dried tomato topping gives it a great summery salad vibe.","ingredients":["25 g sun-dried tomatoes","2 dates","50 g walnuts","4 courgettes","4-5 cauliflower florets","½ a red onion","1 small clove of garlic","1 sprig of fresh rosemary","½ a small red chilli","½ a carrot","½ a stick of celery","¼ of a red pepper","½ a beetroot","225 g cherry tomatoes","½ lemon","½ a bunch of fresh flat-leaf parsley","½ a bunch of fresh basil"],"instructions":"The night before, put the sundried tomatoes and dates in a non-reactive bowl, pour over 200ml of water. In a separate bowl and cover the walnuts with water and place both bowls in the fridge to soak overnight. For the ‘spaghetti’, use a spiraliser to cut the courgettes into long curly strands or use a julienne peeler to slice into thin strips. Set aside. To make ‘parmesan’, blitz the cauliflower florets in a food processor until you have a grainy consistency. Place it on kitchen towel to soak up excess moisture while you prepare the rest of the dish. Place the garlic, rosemary and chilli in a food processor and blitz until finely chopped. Add the carrot, celery, red pepper and onion and blitz again until chunky. Drain and rinse the walnuts and add to the other ingredients in the processor with the beetroot, plum tomatoes, 150g of the cherry tomatoes, the lemon zest and juice, dates and sundried tomatoes (with their soaking liquid), parsley and half of the basil leaves. Quarter the remaining cherry tomatoes and set aside to garnish. Process the mixture until it forms a thick sauce and the walnut pieces resemble a minced texture. Depending how juicy your tomatoes are, you might need to thin it with a little extra water. Season to taste. To serve, divide the courgette ‘spaghetti’ between plates, pour over the sauce, sprinkle with the quartered tomatoes and cauliflower ‘parmesan’, then top with the remaining basil.","tags":["Jamie Magazine","Vegetables","Kosher for Passover","Mains","Pasta & risotto","Courgette"],"time":{"prep":"","cook":"Time 25 minutes plus soaking overnight","active":"","inactive":"","ready":"","total":"Time 25 minutes plus soaking overnight"},"servings":"Serves 6","image":"https://cdn.jamieoliver.com/recipe-database/medium/28dx9u9p4wqBGhT3UOavbT.jpg"}