{"name":"Red Lentil Soup","description":"","ingredients":[" 4 tbsp olive oil, divided"," 1 small onion, finely chopped"," 6 cloves garlic, finely minced, divided"," 1 cup fresh tomato, minced"," 1 small jalapeno or serrano pepper, diced"," 2 Tablespoons tomato paste"," 1 1/2 teaspoons EACH cumin powder, coriander powder, salt"," ½ teaspoon EACH curry powder, chili powder, black pepper"," 1 cup red lentils"," 5 cups boiling water"," ¼ cup dill, finely minced"," ½ cup cilantro, finely minced"," 1 Tablespoon butter"," Fresh lemon juice"," Pita chips or fried pita bites"," Fresh parsley"],"instructions":"Heat 2 Tablespoons oil in a large pan and sauté the onions for 3-5 minutes or until almost golden. Add half the minced garlic and sauté for 30 seconds then add the minced tomatoes, jalapeno, tomato paste and spices. Sauté for 2-3 minutes then stir in the lentils and water. The mixture may seem watery but it will thicken as it cooks and rests. You may need to add more water later as needed. Cover and cook down for 15 minutes or until lentils are cooked through. Using an immersion blender, half blend the mixture for a few seconds until half creamy. Alternatively, transfer half the mixture to a blender and blend for 30 seconds. Top with the chopped dill and half the minced cilantro. In a separate pan, sauté remaining minced garlic and cilantro in 2 Tablespoons olive oil and 1 Tablespoon butter, for 1-2 minutes or until the garlic begins to develop a golden color. Add the mixture to the lentil soup and stir to combine. Serve in soup bowls with lemon wedges and pita chips or fried pita bread bites (see below). To make pita bread bites, slice a pita bread into small squares and fry in hot oil for 1 minute or until golden brown. Remove onto a paper towel-lined plate.","tags":[""],"time":{"prep":"10 minutes mins","cook":"30 minutes mins","active":"","inactive":"","ready":"","total":" "},"servings":"6","image":"https://gimmedelicious.com/wp-content/uploads/2024/03/red-lentil-soup-6.jpg"}