{"name":"Refried lentils with eggs & salsa","description":"Jamie takes a Tex-Mex classic and gives it a twist in this  recipe for refried lentils with eggs and salsa, perfect for a  midweek meal, try it for yourself.","ingredients":["2 onions","2 cloves of garlic","½ bunch of coriander","1 jalapeño chilli","300 g ripe vine tomatoes","olive oil","½ teaspoon crushed coriander seeds","300 g brown lentils","2 red peppers","1 dried chipotle chilli","½ teaspoon smoked paprika","1 splash of red wine vinegar","4 large free-range eggs","2 avocados","2 limes"],"instructions":"Peel and finely chop the onions and garlic, pick the coriander leaves and finely chop the stalks, finely chop the jalapeño, and roughly chop the tomatoes. Place a large non-stick saucepan over a medium heat and pour in a lug of oil. Add the onions, coriander stalks and jalapeño and sauté for 10 minutes, until softened but not coloured. Stir in the coriander seeds, fry for a couple more minutes, then add the lentils. Stir in 800ml boiling water and bring back to the boil. Season well, reduce the heat, pop on the lid and simmer for 40 minutes, until the lentils are cooked and beginning to break down. Blacken the peppers by either placing them directly on a gas flame, or griddling them in a griddle pan, turning regularly until blackened all over. Pop them in a bowl, cover with clingfilm and let stand. After about 5 minutes the peppers should be ready, so flake away the blistered skin and remove the stalk and seeds. Slice the flesh into thin strips and leave to one side. Place the chipotle chilli in a small bowl and pour in just enough boiling water to cover. After a few minutes, it should have softened; carefully remove from the bowl and finely chop. Place a medium-sized pan over a medium heat and pour in a lug of olive oil. Add the garlic and all the chillies and fry for 1 minute, then add the peppers and paprika. Fry for a few more minutes, then add the tomatoes. Season well and gradually bring everything to a simmer. Leave to bubble away gently for 10 minutes, until you have a thick and rich tomato sauce. Add a splash of red wine vinegar and set aside. Chop the coriander leaves, then stir through. When your lentils are cooked, roughly purée with a stick blender, then pop back over a medium heat with a lug of oil. Fry for about 15 minutes, stirring occasionally, so you end up with crispy fried lentils. Place a frying pan over a medium heat and add a splash of oil. Crack in the eggs, one at a time, and cook to your liking. Slice the avocados and dress with the juice of 1 lime. Cut the remaining lime into quarters. Serve the refried lentils with a dollop of the red pepper salsa, dressed avocado and topped with a fried egg and a wedge of lime.","tags":["Jamie Magazine","Eggs","Vegetables","Lentil","Breakfast","Healthy meals"],"time":{"prep":"","cook":"Time 2 hours 5 minutes","active":"","inactive":"","ready":"","total":"Time 2 hours 5 minutes"},"servings":"Serves 4","image":"https://cdn.jamieoliver.com/recipe-database/medium/4UrugT-gqTX9T6HE4eKRLM.jpg"}