{"name":"Roast vegetable megamix","description":"There are so many ways that you can cook roasted vegetables, this mega mix will make sure that all your roast veggies taste as a good as possible. ","ingredients":["olive oil","BEETS","350 g beetroot","2 lugs of balsamic vinegar","a few sprigs of fresh oregano or marjoram","CARROTS","500 g carrots","1 clementine","a few sprigs of fresh rosemary","PARSNIPS","400 g parnsips","a lug of white wine vinegar","2–3 sprigs of fresh sage","1 small teaspoon runny honey","TURNIPS","350 g baby turnips","2 lugs of red wine vinegar","5 fresh bay leaves","FENNEL","2 bulbs of fennel","½ a lemon","a few sprigs of fresh thyme"],"instructions":"Preheat your oven to 190ºC/375ºF/gas 5. Bring two large pans of salted water to the boil. Scrub the beets, then place in one of the pans - keep them separate to stop the rest of your veg turning red! Parboil for 20 to 25 minutes. Meanwhile, peel the carrots and parsnips, then chop any bigger ones in half along with the turnips. Trim and quarter the fennel. Place the prepped veg together in the second pan and parboil for 10 minutes. Drain all the veg and leave to steam dry, then separate them out so you can hit them with those different flavours. Toss the beets with the balsamic vinegar and whole herb sprigs. Toss the carrots with the clementine juice and throw in the squeezed halves, then pick over the rosemary leaves. Toss the parsnips with the vinegar and tear over the sage leaves. Reserve the honey for later. Toss the turnips with the vinegar and bay. Toss the fennel with the lemon juice, then pick over the thyme leaves. Lay them out on a large tray, keeping each veg type together. If you're making this ahead, you can get up to this stage the day before, then cover them with tin foil and keep them with your spuds till your turkey is resting. Nothing will discolour because of the oil and acid. Roast for 50 minutes to 1 hour, or until golden, crispy and beautiful. About 5 minutes before the veg are ready, drizzle the honey over the parsnips. Once ready, give the tray a jiggle, then pile the veg on a platter.","tags":["Jamie's Family Christmas","Vegetables","Christmas","Dinner Party","Easter treats","Father's day"],"time":{"prep":"","cook":"Time 1 hour 55 minutes","active":"","inactive":"","ready":"","total":"Time 1 hour 55 minutes"},"servings":"Serves 4","image":"https://cdn.jamieoliver.com/recipe-database/oldImages/medium/458_1_1436882923.jpg"}