{"name":"Roasted Tomato Soup","description":"My favorite roasted tomato soup recipe always tastes so fresh and flavorful and it's easy to make with a handful of simple ingredients.","ingredients":["3 1/2 pounds ripe tomatoes (any small- to medium-sized tomatoes will do)","3 tablespoons olive oil, divided","fine sea salt and freshly-cracked black pepper","1 large white or yellow onion, diced","5 cloves garlic, minced","3/4 teaspoon smoked paprika","1/4 teaspoon crushed red pepper flakes","2 1/2 cups vegetable broth","1/2 cup loosely-packed fresh basil leaves","optional toppings: freshly-grated Parmesan, drizzle of heavy cream or olive oil, croutons, sour cream or fresh basil"],"instructions":"Roast the tomatoes. Heat oven to 450°F. Quarter the tomatoes (or halve them, if they are small) and arrange them cut-side-up on a baking sheet. Drizzle evenly with 2 tablespoons of the olive oil and season with a few pinches of salt and black pepper. Bake for 30 to 40 minutes or until softened, then transfer baking sheet to a wire rack. Sauté the onion and garlic. Meanwhile, heat the remaining 1 tablespoon of olive oil in a large stockpot over medium-high heat. Add the onion and sauté for 5 minutes, stirring occasionally. Add the garlic, smoked paprika and crushed red pepper flakes and sauté for 2 more minutes, stirring frequently. Put it all together. Add the broth, basil, and the roasted tomatoes (once they are ready) with their juices and stir to combine. Purée. Using a handheld immersion blender (or see instructions below for using a traditional blender), purée the soup until it reaches your desired texture. Season. Taste the soup and season with extra salt, pepper, and/or smoked paprika as needed. Serve. Serve warm, garnished with any extra toppings you would like, and enjoy!","tags":["Gluten-free","Main Dishes","Soups / Stews","Vegan","Vegetarian"],"time":{"prep":"15 minutes","cook":"30 minutes","active":"","inactive":"","ready":"","total":"45 minutes"},"servings":"4 to 6 servings","image":"https://www.gimmesomeoven.com/wp-content/uploads/2021/09/Roasted-Tomato-Soup-Recipe-8.jpg"}