{"name":"Samosa-dillas With Cucumber Salad","description":"All the flavors of a samosa with none of the deep-frying. A cheesy, spiced potato filling folded into whole wheat tortillas is the best double-carb mashup.","ingredients":["3 Tbsp. plus 2 tsp. vegetable oil","1 tsp. cumin seeds","1 medium red onion, ½ finely chopped, ½ thinly sliced","1 serrano chile, finely chopped","1 1\" piece ginger, peeled, finely chopped","1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more","1 lb. russet potatoes (about 2 large), peeled, cut into ½\" cubes","1 Tbsp. curry powder (preferably S&B)","½ bunch cilantro, leaves and tender stems only, coarsely chopped","1 cup frozen peas, preferably baby","1 Tbsp. fresh lime juice, plus more for drizzling","4 8\"–10\" whole wheat tortillas","8 oz. pepper jack cheese or sharp white cheddar, coarsely grated (about 2 cups)","2 mini seedless or Persian cucumbers, quartered lengthwise, sliced ¼\" thick on a deep diagonal","4 oz. cherry tomatoes (about 1 cup), halved"],"instructions":"Heat 3 Tbsp. vegetable oil in a medium Dutch oven or other heavy pot over medium. Add 1 tsp. cumin seeds; cook, stirring often, until fragrant and seeds begin to pop, about 2 minutes. Add ½ medium red onion, finely chopped, 1 serrano chile, finely chopped, one 1\" piece ginger, peeled, finely chopped, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt. Cook, stirring occasionally, until onion is softened, about 3 minutes. Add 1 lb. russet potatoes (about 2 large), peeled, cut into ½\" cubes, 1 Tbsp. curry powder, and 1½ cups water and bring to a boil. Cover and cook, stirring often and adjusting heat as needed to maintain a simmer, until potatoes are tender and water is mostly absorbed, 15–20 minutes. If pot looks dry but potatoes are still firm, add up to ¼ cup additional water and continue to cook until tender. Conversely, if potatoes are soft but a lot of liquid remains, uncover and cook, stirring often, until water evaporates. (Potatoes will fall apart during cooking.) Remove from heat and stir in ½ bunch cilantro, leaves and tender stems only, coarsely chopped, 1 cup frozen peas, preferably baby, and 1 Tbsp. fresh lime juice, smashing potatoes into a chunky purée. Taste and season with more salt if needed. Lay out four 8\"–10\" whole wheat tortillas on a work surface. Scatter 8 oz. pepper jack cheese or sharp white cheddar, coarsely grated (about 2 cups), over tortillas, covering evenly. Divide potato filling among tortillas, spooning over one side. Fold tortillas up and over filling to make half-moons; pat to flatten slightly. Heat 1 tsp. vegetable oil in a large nonstick skillet over medium. Place 2 samosa-dillas in pan and cook, turning halfway through, until tortillas are golden and cheese is melted, about 5 minutes. Transfer to a cutting board. Repeat with remaining 1 tsp. vegetable oil and remaining 2 samosa-dillas. Cut samosa-dillas into wedges and transfer to plates. Toss 2 mini seedless or Persian cucumbers, quartered lengthwise, sliced ¼\" thick on a deep diagonal, 4 oz. cherry tomatoes (about 1 cup), halved, and ½ medium red onion, thinly sliced, in a medium bowl. Drizzle generously with lime juice and season with a large pinch of salt; toss to coat. Spoon some salad alongside each samosa-dilla.","tags":["dinner","main","weeknight meals","nut-free","vegetarian","quesadilla","russet potato","pea","tortillas","cheese","south asian"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":""},"servings":"","image":"https://assets.bonappetit.com/photos/663949eb8c98b71bcaa8c235/16:9/w_1280,c_limit/BA-DIS_Samosadilla_WEB.jpg"}