{"name":"Saucy Steak and Pepper Stir-Fry","description":"This easy recipe for stir-fried steak and peppers comes together with strips of ribeye and vibrant hot chiles—but you can swap in sweet peppers if you’d prefer.","ingredients":["1½ lb. boneless rib-eye steak, cut into 1\" cubes","2 Tbsp. plus 1 tsp. cornstarch","1 Tbsp. plus 4 tsp. dark soy sauce","2 Tbsp. soy sauce, divided","2 Tbsp. unseasoned rice vinegar, divided","1 tsp. freshly ground pepper","2 Tbsp. vegetable oil, divided","1 medium onion, thinly sliced","8 finger hot peppers or cayenne chiles (about 8 oz.), sliced\n1\" thick","1 2\" piece fresh ginger, peeled, finely chopped","5 garlic cloves, finely chopped"," Kosher salt"," Steamed white rice (for serving)"],"instructions":"Place 1½ lb. boneless rib-eye steak, cut into 1\" cubes, 2 Tbsp. plus 1 tsp. cornstarch, 1 Tbsp. dark soy sauce, 1 Tbsp. soy sauce, and 1 Tbsp. unseasoned rice vinegar in a medium bowl; toss to coat. Stir 1 tsp. freshly ground pepper, remaining 4 tsp. dark soy sauce, remaining 1 Tbsp. soy sauce, remaining 1 Tbsp. unseasoned rice vinegar, and ½ cup water in another medium bowl to combine; set dressing aside. Warm 1 Tbsp. vegetable oil in a large skillet or wok over medium-high heat. Place steak with marinade in pan, arranging in a single layer as much as possible. Cook, undisturbed, until browned underneath, about 2 minutes. Turn over and cook until browned on other side, about 2 minutes. Transfer steak to bowl with reserved dressing and toss to coat. Wipe out skillet. Heat remaining 1 Tbsp. vegetable oil in same skillet over high. Cook 1 medium onion, thinly sliced, stirring constantly, until fragrant, about 30 seconds. Add 8 finger hot peppers or cayenne chiles (about 8 oz.), sliced 1\" thick, one 2\" piece fresh ginger, peeled, finely chopped, and 5 garlic cloves, finely chopped, and cook, stirring often, until softened and starting to char, about 5 minutes. Reduce heat to medium, add steak with dressing, and toss to combine. Stir in up to ¼ cup water to loosen sauce if needed. Taste stir-fry and season with kosher salt if needed. Transfer steak mixture to a shallow bowl; serve with steamed white rice.","tags":["dinner","main","dairy-free","nut-free","one-pot meals","30 minutes or less","sauté","summer","stir-fry","rib eye steak","quick","weeknight meals"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":""},"servings":"","image":"https://assets.bonappetit.com/photos/663949eb8be1c37cbea899df/16:9/w_1280,c_limit/BA-DIS_Steak-Pepper-Bites_WEB.jpg"}