{"name":"Sheet-Pan Peppers and Chickpeas With Ricotta","description":"Glazed sweet-sour peppers meet their match: a textural medley of crispy chickpeas, crunchy croutons, and a creamy swoosh of ricotta cheese.","ingredients":["4 red or yellow bell peppers, ribs and seeds removed, cut into 1\"-thick strips","5 Tbsp. extra-virgin olive oil, divided, plus more","5 Tbsp. sherry vinegar or red wine vinegar, divided"," Kosher salt","1 15-oz. can chickpeas, rinsed, patted dry","1 tsp. ground cumin","1 tsp. smoked paprika","½ small loaf of bread (about 4 oz.), torn into 1\" pieces"," Freshly ground pepper","1 cup whole-milk ricotta","1 garlic clove, finely grated","3 Tbsp. finely chopped parsley","1 Tbsp. honey"],"instructions":"Place racks in upper and lower thirds of oven; preheat to 425°. Place 4 red or yellow bell peppers, ribs and seeds removed, cut into 1\"-thick strips, on a rimmed baking sheet; drizzle 2 Tbsp. extra-virgin olive oil and 2 Tbsp. sherry vinegar or red wine vinegar over; season with kosher salt. Toss to coat and roast on upper rack until peppers have softened and blistered in spots, 28–32 minutes. Meanwhile, place one 15-oz. can chickpeas, rinsed, patted dry, on a second rimmed baking sheet. Drizzle with some oil, sprinkle with 1 tsp. ground cumin and 1 tsp. smoked paprika, and season generously with salt. Toss to coat and roast on lower rack until slightly darkened in color, 9–11 minutes. While the chickpeas are roasting, place ½ small loaf of country-style bread (about 4 oz.), torn into 1\" pieces, in a large bowl. Drizzle generously with oil and season with salt and freshly ground pepper; toss to coat. Remove chickpeas from oven. Add bread to baking sheet and toss to combine; reserve bowl. Roast until chickpeas are crisp and bread is golden brown, 13–17 minutes. Place 1 cup whole-milk ricotta in a small bowl, drizzle in a little oil and season with salt. Mix well and spread over a platter; set aside. Toss 1 garlic clove, finely grated, 3 Tbsp. finely chopped parsley, 3 Tbsp. extra-virgin olive oil, and a pinch of salt in a clean small bowl to combine. Stir 1 Tbsp. honey and remaining 3 Tbsp. sherry vinegar or red wine vinegar in another small bowl. Remove peppers from oven, immediately drizzle honey mixture over and toss to coat. Transfer bell peppers, chickpeas, and croutons, and any juices from pans to reserved bowl; toss to combine. Taste and season with more salt and pepper if needed; drizzle with more oil if desired. Pile pepper mixture on top of reserved platter with ricotta, then spoon garlic-parsley dressing over.","tags":["main","dinner","speedy does it","sheet-pan dinners","easy","quick","weeknight meals","vegetarian","nut-free","chickpea","bell pepper","ricotta"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":""},"servings":"","image":"https://assets.bonappetit.com/photos/665dc94606639a8da6c50031/16:9/w_1280,c_limit/sdi-agrodolce-peppers-chickpeas_LEDE_052224_6353_VOG_final.jpg"}