{"name":"Simple Blueberry Cake","description":"Make this simple blueberry cake recipe! This blueberry cake is tender and delicious, loaded with blueberries, and not too sweet. It's perfect.","ingredients":["1 ¾ cups plus 1 teaspoon white whole wheat flour or regular whole wheat flour","1 teaspoon baking powder","½ teaspoon baking soda","½ teaspoon fine sea salt","¼ teaspoon ground cinnamon","½ cup maple syrup or honey","6 tablespoons melted butter ","2 eggs, preferably at room temperature","⅔ cup buttermilk*","2 teaspoons vanilla extract","3 cups blueberries, fresh (1 ½ pints) or frozen, divided","1 tablespoon turbinado sugar (also called raw sugar), for sprinkling on top","Optional serving suggestions: Vanilla ice cream, Greek yogurt or whipped cream"],"instructions":"Preheat the oven to 400 degrees Fahrenheit. Line the base of a 9-inch springform pan with parchment paper cut to fit inside. Butter the sides of the pan to prevent the cake from sticking.  In a large mixing bowl, combine 1 ¾ cups of the flour with the baking powder, baking soda, salt and cinnamon. Stir them together with a whisk. In a medium mixing bowl, combine the maple syrup and butter and beat together with a whisk. Add the eggs and beat well, then add the buttermilk and vanilla. Mix well. (If the butter solidifies in contact with cold ingredients, gently warm the mixture in the microwave in 30 second bursts, then stir again.) Pour the wet ingredients into the dry and mix with a big spoon, just until combined (a few lumps are ok). In a small bowl, toss 2 cups of the blueberries with the remaining 1 teaspoon flour (this helps prevent the blueberries from sinking to the bottom). Gently fold the blueberries into the batter. The mixture will be thick, but don’t worry. Pour the batter into the prepared pan. Distribute the remaining blueberries on top, focusing them more toward the center of the cake. Sprinkle the top of the blueberries with the turbinado sugar.   Bake for 34 to 38 minutes, until the cake is golden on top and a toothpick inserted into the center comes out clean (blueberry bits aside). Place the cake on a cooling rack to cool. Before releasing the springform sides, you might need to run a butter knife along the outer edge of the cake to loosen it from the pan.  Serve as desired. Store leftover cake covered, at room temperature for 2 days, or in the refrigerator for up to 5 days. Or, freeze leftover cake for up to 3 months.","tags":["baked goods","dessert","Independence Day","naturally sweetened","nut free","recipes","soy free","spring","summer","tomato free"],"time":{"prep":"20 minutes","cook":"35 minutes","active":"","inactive":"","ready":"","total":"55 minutes"},"servings":"1 cake","image":"https://cookieandkate.com/images/2021/07/blueberry-cake-recipe-4-2.jpg"}