{"name":"Skillet Lasagna","description":"Skillet Lasagna is a quick and easy weeknight dinner that will give you all the cozy vibes of a classic lasagna in half the time.","ingredients":["1 Tbsp olive oil","1/2 lb. Italian Sausage","2 cloves garlic","24 oz. pasta sauce","1 cup water","1/2 tsp Italian seasoning","9 lasagna noodles","1 cup ricotta cheese","1/4 cup Grated Parmesan","1/4 tsp salt","1/4 tsp freshly cracked black pepper","1 cup shredded mozzarella"],"instructions":"Add the Italian sausage and olive oil to a large deep skillet. Cook over medium heat until the sausage is cooked through.  Mince the garlic, add it to the skillet with the sausage, and continue to sauté over medium for one more minute. Add the pasta sauce, Italian seasoning, and water to the skillet then stir to combine. Break the lasagna noodles into one to two-inch pieces, then stir them into the sauce in the skillet. Place a lid on the skillet, turn the heat up to medium-high, and allow the sauce to come up to a boil. Once boiling, give the skillet a brief stir, replace the lid, then turn the heat down to medium-low. Let the noodles simmer in the sauce, stirring occasionally, until tender (about 15 minutes). If the sauce becomes too dry before the noodles are tender, add more water and continue to simmer. While the noodles are simmering, stir together the ricotta, Parmesan, salt, and pepper in a separate bowl. Once the noodles have cooked, add the ricotta mixture on top of the noodles in small dollops. Sprinkle the shredded mozzarella over top. Place the skillet under your oven's broiler for a few minutes or just until the cheese is melted and slightly browned (make sure to use an oven-safe skillet, no lid). Or, place the lid on the skillet and continue to cook over medium-low heat until the cheese is melted. Serve hot and enjoy!","tags":[],"time":{"prep":"5 minutes mins","cook":"30 minutes mins","active":"","inactive":"","ready":"","total":"35 minutes mins"},"servings":"4","image":"https://www.budgetbytes.com/wp-content/uploads/2023/03/Skillet-Lasagna-scoop.jpg"}