{"name":"Slow Cooker Potato Soup","description":"This creamy Slow Cooker Potato Soup is rich, comforting and hearty, plus the slow cooker does all the heavy lifting for you!","ingredients":["2 stalks celery","2 carrots","1 yellow onion","3 cloves garlic","3 lbs Yukon gold potatoes","1 tsp Italian seasoning","1 1/4 tsp salt","1/2 tsp  freshly cracked black pepper","3 cups chicken broth","2 Tbsp all-purpose flour","2 Tbsp water","1/2 cup heavy cream","1/2 cup sour cream","1 cup shredded cheddar cheese, divided","3 green onions, sliced & divided"],"instructions":"Wash and dice the celery stalks, peel and dice the carrots, dice the onion, and mince the garlic. Wash, peel, and chop the potatoes into ½ – ¾ inch chunks. Add the potatoes, carrots, celery, onion, and the garlic to a 5 or 6 quart slow cooker or crock pot. Then add the Italian seasoning, salt, and freshly cracked black pepper to the slow cooker.  Pour the chicken broth over the vegetables and spices in the slow cooker. Stir all the ingredients together so that everything is evenly distributed. Place the lid on the slow cooker and cook on high for 3 hours. Once the potatoes are almost finished cooking, make a quick flour slurry by adding the flour and water to a small bowl and whisking together until smooth and there are no lumps. After the potato soup has cooked for 3 hours, check to make sure the potatoes are tender and can be easily pierced with a fork. Now add the slurry, heavy cream, and sour cream to the slow cooker. Stir well to combine, replace the lid, and continue to cook on high for an additional 10 minutes. During the last 10 minutes of cooking, while the slurry and heavy cream are thickening the soup, shred the cheddar cheese and slice the green onions. Remove the slow cooker lid then use a potato masher to mash the potato chunks into smaller pieces. Add ½ cup of the shredded cheese and half of the sliced green onions. Stir until the cheese has melted into the soup. Taste the soup and adjust the salt or black pepper to your liking. Use the remaining shredded cheese and green onions to garnish individual bowls. Serve hot and enjoy!","tags":[],"time":{"prep":"20 minutes mins","cook":"3 hours hrs 10 minutes mins","active":"","inactive":"","ready":"","total":"3 hours hrs 30 minutes mins"},"servings":"6","image":"https://www.budgetbytes.com/wp-content/uploads/2023/11/Slow-Cooker-Potato-Soup-Close.jpg"}