{"name":"Southwest Chicken Corn Chowder","description":"Creamy southwest chicken corn chowder packed with summer veggies. This easy chicken corn chowder recipe has wonderful southwest flavors!","ingredients":["For the chicken:","1 tablespoon olive oil","1 pound boneless skinless chicken thighs, diced into bite sized pieces","Freshly ground salt and pepper","For the corn chowder:","1 medium white onion, chopped","3 garlic cloves, minced","1 poblano pepper, seeded and diced (can also use 1 seeded jalapeno)","1 red bell pepper, diced","4 cups diced yukon gold potatoes","5 cups fresh sweet corn off the cob (can also use frozen)","1 teaspoons cumin","1 teaspoon ground coriander","1/2 teaspoon ground turmeric","½ teaspoon chili powder","1/2 teaspoon garlic powder","1/2 teaspoon oregano","Optional: ¼ teaspoon cayenne (only if you like a little heat)","2 cups milk of choice (I used unsweetened almond milk, but dairy milk or coconut milk would also work)","2 cups low sodium chicken broth","⅓ cup plain greek yogurt (or sour cream)","1 teaspoon salt, plus more to taste","Freshly ground black pepper","1 (15 ounce) can black beans, rinsed and drained","Juice from ½ lime","To garnish:","Shredded sharp cheddar cheese","Scallions","1/2 cup fresh diced cilantro","Diced avocado","Tortilla chips","Greek yogurt or sour cream"],"instructions":"In a large soup pot over medium-high heat add the olive oil and diced chicken, season with salt and pepper and cook until cooked through until chicken is no longer pink, about 5-7 minutes. Once chicken is done cooking, transfer to a bowl or plate and set aside. In the same pot, reduce heat to medium and add in onion, garlic, poblano, red bell pepper, potatoes and corn and saute for 6-8 minutes or until potatoes start to soften a bit. Next stir in spices and cook for 30 seconds to release their flavors and aromas, then slowly stir in the milk, broth and yogurt (or sour cream), scraping up any bits from the bottom of the pan as you stir. Season with salt and pepper. Reduce the heat to medium low and gently simmer for 10-15 minutes uncovered or until the potatoes are tender and can easily be pierced with a fork. To give a creamy texture, blend approximately half of the soup (BE CAREFUL WHILE DOING THIS!) then return to the pot. Stir to incorporate and then taste and adjust seasonings -- adding in more salt and pepper if necessary. You can blend more if you like a creamier soup, but I love a little texture. Finally stir in the chicken, black beans and lime juice. To serve, garnish with shredded cheese, scallions, cilantro, avocado and a swirl of greek yogurt or sour cream (if not vegan). Makes 6 servings.","tags":[],"time":{"prep":"15 minutes minutes","cook":"40 minutes minutes","active":"","inactive":"","ready":"","total":"55 minutes minutes"},"servings":"6","image":"https://www.ambitiouskitchen.com/wp-content/uploads/2022/08/Chowder-FB.png"}