{"name":"Southern-Style Caramel Cake","description":"This caramel cake is our take on an icon of the American South, featuring two extra tender buttermilk cake layers and a brown butter-caramel frosting.","ingredients":["¾ cup (1½ sticks) unsalted butter, room temperature, cut into 1\" pieces, plus more for pans","2 cups (250 g) bleached cake flour","1½ cups (300 g) granulated sugar","1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt","1½ tsp. baking powder","½ tsp. baking soda","1 cup buttermilk","1 tsp. vanilla bean paste or vanilla extract","3 large eggs","1 cup (2 sticks) unsalted butter, room temperature, divided","2 cups (packed; 400 g) dark brown sugar","½ cup heavy cream","2 cups (220 g) powdered sugar","1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt","2 tsp. distilled white vinegar"," Flaky sea salt"],"instructions":"Place a rack in middle of oven; preheat to 325°. Lightly butter two 8\"-diameter cake pans with unsalted butter. Line bottoms with parchment paper rounds. Mix 2 cups (250 g) bleached cake flour, 1½ cups (300 g) granulated sugar, 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt, 1½ tsp. baking powder, and ½ tsp. baking soda in the bowl of a stand mixer fitted with the paddle attachment on low speed until combined, about 1 minute. Add ¾ cup (1½ sticks) unsalted butter, room temperature, cut into 1\" pieces, increase speed to medium-low, and beat until mixture resembles wet sand, about 1 minute. Add 1 cup buttermilk and 1 tsp. vanilla bean paste or vanilla extract and beat until batter is pale and fluffy, about 2 minutes (this extended mix time builds structure and prevents the cake from sinking; don’t worry about overmixing). Working one at a time, add 3 large eggs, beating 30 seconds after additions and scraping down sides and bottom of bowl with a rubber spatula as needed; batter should be smooth and creamy at the end. Scrape batter into prepared pans, dividing equally (about 530 g per pan); smooth surface with an offset spatula. Bake cakes until golden and tops spring back when gently pressed (an instant-read thermometer inserted into the center should register 205°), 30–35 minutes. (Cakes may shrink slightly from edges of pan.) Transfer pans to a wire rack and let cakes cool in pans 10–15 minutes. Run an offset spatula around sides of cakes to loosen, then invert onto rack (leave parchment rounds attached). Let cakes cool completely. Cook ½ cup (1 stick) unsalted butter, room temperature, in a small saucepan over medium heat, stirring often, until it foams, then browns, 5–8 minutes. Add 2 cups (packed; 400 g) dark brown sugar and ½ cup heavy cream (stand back; mixture will spatter). Cook, stirring constantly, until sugar is dissolved, about 5 minutes. Scrape into the clean bowl of a stand mixer fitted with the paddle attachment. Add 2 cups (220 g) powdered sugar and 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt to caramel mixture and beat on medium-low speed until smooth and cooled to lukewarm, 6–8 minutes. Cut remaining ½ cup (1 stick) unsalted butter, room temperature, into 3 or 4 pieces and add to frosting one at a time, beating to blend after each addition and scraping down bottom and sides of bowl with a rubber spatula as needed. (Frosting should be smooth and creamy with the texture of runny peanut butter.) Add 2 tsp. distilled white vinegar and beat to incorporate. Use frosting while it is still slightly warm or it will become too firm to work with. Peel parchment rounds away from cakes and discard. Place 1 cake layer, right side up, on a cake stand or large plate (use a cake turntable if you’ve got one; it will make frosting easier). Scoop 1 cup frosting (eyeballing is fine) on top and spread evenly with an offset spatula, pushing almost to edges. Place second cake layer, upside down, on top. Working quickly, spread sides and top of cake evenly with remaining frosting. Using a spoon or offset spatula, create decorative swirls in frosting if desired. Lightly sprinkle with flaky sea salt. Let cake sit at room temperature at least 15 minutes to allow frosting to firm up slightly before serving. Do Ahead: Cake can be assembled 12 hours ahead. Cover with a cake dome or an inverted bowl and store at a cool room temperature.","tags":["layer cake","baking","southern","nut-free","make ahead"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":""},"servings":"","image":"https://assets.bonappetit.com/photos/667ec35eea664996547e441d/16:9/w_1280,c_limit/caramel-cake_LEDE_V2_062524_0600_VOG_final.jpg"}