{"name":"Spaghetti With Clams and Sun Gold Tomatoes","description":"Juicy Sungold tomatoes add a pop of acidity to these saucy noodles and fresh clams. Don’t be shy with the basil—it makes the dish taste like summer in a bowl.","ingredients":[" Kosher salt","3 lb. small clams, preferably littleneck (about 30), scrubbed","12 oz. spaghetti","¼ cup extra-virgin olive oil, plus more for drizzling","8 garlic cloves, thinly sliced","1 cup dry white wine","2 Tbsp. white or yellow miso","12 oz. Sun Gold tomatoes, halved, divided","4 Tbsp. unsalted butter, cut into pieces"," Freshly ground pepper","½ cup torn basil, plus more for serving"],"instructions":"Partially fill a large bowl with cool water, add a handful of kosher salt, and swish with your hand to dissolve. Add 3 lb. small clams, preferably littleneck (about 30), scrubbed; let sit 15 minutes to expel any grit. Carefully drain and rinse. Repeat with a fresh bowl of cool water and salt. Set aside. Cook 12 oz. spaghetti in a large pot of boiling salted water, stirring occasionally, until 1 minute short of al dente. Drain, reserving 1 cup pasta cooking liquid. Set pasta aside. Meanwhile, heat ¼ cup extra-virgin olive oil in a medium Dutch oven over medium. Cook 8 garlic cloves, thinly sliced, stirring, until golden, about 30 seconds. Pour in 1 cup dry white wine, add reserved clams, and increase heat to medium-high. Cover and cook, until clams are open, about 4 minutes. Using tongs, transfer opened clams to a clean large bowl. Leave unopened clams in pot, re-cover, and continue to cook, checking every 2 minutes to remove any open clams; discard any unopened clams after 10 minutes. Reduce heat to medium and stir in 2 Tbsp. white or yellow miso to dissolve. Add 6 oz. Sun Gold tomatoes, halved; cook, pressing occasionally with spoon to help break open, until some of the tomatoes burst and release their juices, about 4 minutes. Add 4 Tbsp. unsalted butter, cut into pieces, remaining 6 oz. Sun Gold tomatoes, halved, and reserved pasta and cook, tossing and adding reserved pasta cooking liquid ¼-cupful at a time if needed, until pasta is al dente and has soaked up some of the sauce (it will thicken as it sits). Taste and season with salt and freshly ground pepper. Add clams along with any juices and ½ cup torn basil and gently toss to combine. Divide pasta and clams among bowls. Drizzle with oil and top with more basil.","tags":["dinner","main","weeknight meals","easy","quick","nut-free","dairy-free","pasta","tomato","clam","spaghetti","summer","italian","30 minutes or less"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":""},"servings":"","image":"https://assets.bonappetit.com/photos/664285de979924538257d1d1/16:9/w_1280,c_limit/20240313-0624-DIS-0810.jpg"}