{"name":"Sparkly Lemon Cookies","description":"Our best lemon cookie recipe is perfect for any celebration. Before baking, the cookies are coated with coarse sanding sugar, giving them a glittery sheen.","ingredients":["¾ cup (150 g) granulated sugar","½ cup (1 stick) unsalted butter, room temperature","1 large egg, room temperature","2 Tbsp. finely grated lemon zest","1 tsp. vanilla extract","¼ tsp. kosher salt","1¼ cups (156 g) all-purpose flour"," Nonstick vegetable oil spray"," Coarse raw sugar, sanding sugar, or nonpareils for decoration"],"instructions":"Beat ¾ cup (150 g) granulated sugar, ½ cup (1 stick) unsalted butter, room temperature, 1 large egg, room temperature, 2 Tbsp. finely grated lemon zest, 1 tsp. vanilla extract, and ¼ tsp. kosher salt in a large bowl with an electric mixer. Add 1¼ cups (156 g) all-purpose flour all at once and beat just to combine. Cover with plastic wrap and chill cookie dough until firm but not hard, about 2 hours. Preheat oven to 350°F. Coat 2 large rimmed baking sheets with nonstick vegetable oil spray. Pour coarse raw sugar, sanding sugar, or nonpareils into a small bowl. Working with moistened hands, shape 1 level tablespoon (or use a #60 cookie scoop) of dough into a ball and roll in decoration to coat. Place on prepared baking sheet and repeat with remaining cookie dough, spacing dough balls 2\" apart. Using bottom of glass or measuring cup, flatten each dough ball to 2\" round. Bake cookies until golden on bottom, about 14 minutes. Cool on a wire rack. Do Ahead: Cookies can be baked 2 days ahead. Store in an airtight container at room temperature. Editor’s note: This lemon cookie recipe was first printed in our December 2010 issue as “Lemon Sugar Cookies.” Head this way for more of our best lemon dessert recipes →","tags":["baking","dessert","cookie","lemon","easy","snack","nut-free","christmas"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":""},"servings":"","image":"https://assets.bonappetit.com/photos/667ec29ffef9fe35ab3ae758/16:9/w_1280,c_limit/lemon-sugar-cookies_LEDE_062524_0326_VOG_final.jpg"}