{"name":"Spicy Blackened Chicken Sliders","description":"Recipe by: Layla Atik // Gimme Delicious | Photography by: Eat Love Eats","ingredients":[" 1.5 lbs chicken tenders"," 3 tablespoons avocado oil, or oil of choice"," 1 tablespoon blackened seasoning mix"," 1/4 cup melted butter"," 2 cloves garlic, minced"," 1 tablespoon fresh parsley, minced"," ½ cup mayonnaise"," 1 tablespoon brown sugar"," 1 teaspoon EACH hot sauce, dijon mustard, Worcestershire sauce, lemon juice"," 1/4 teaspoon EACH garlic powder, onion powder, salt & pepper"," 1 pack King’s Hawaiian slider rolls or dinner rolls"," 6 sliced cheese, cheddar, mozzarella, provolone, pepper jack"," Shredded iceberg or romaine lettuce"," Sliced red onion"," dill pickle slices"],"instructions":"In a bowl or ziplock bag, combine the chicken, oil, and blackened seasoning. Set aside to marinate while you prep the rest of the ingredients for the sliders. Whisk all the ingredients for the sauce in a small bowl. In another small bowl, whisk together the melted butter, garlic, and parsley. Line a baking sheet with foil and cut the sliders in half. Place sliders on the baking sheet, with the top side up; set aside. To Cook Chicken: Heat a large pan over medium-high heat and add the chicken to the pan. Cook on high for 3-4 minutes per side or until charred and cooked through. To Toast Buns: While the chicken is cooking, toast the buns. Turn on the oven to broil and spread the butter mixture over the top of the buns (leaving the bottoms bare). Broil for 2 minutes or until the buns are lightly golden and crispy. To Assemble: Evenly distribute the chicken tenders on the buns, top with 6 slices or cheese, shredded lettuce, onion, pickles, and the prepared sauce. Cover with the top buns and break into small sliders. Enjoy immediately!","tags":[""],"time":{"prep":"10 minutes mins","cook":"10 minutes mins","active":"","inactive":"","ready":"","total":"20 minutes mins"},"servings":"12","image":"https://gimmedelicious.com/wp-content/uploads/2023/09/Spicy-Blackened-Chicken-Sliders-5.jpg"}