{"name":"Spinach and Artichoke Pan Pizza","description":"A bright green spinach pesto and artichoke heart pizza we can’t get enough of and a love letter to failproof pan pizzas.","ingredients":["Dough","2 cups (260 grams) all-purpose flour","1 teaspoon instant yeast","1 teaspoon kosher salt (I use Diamond brand kosher salt; use half of other brands)","1 cup lukewarm water (100° to 115°F)","1 tablespoon (15 grams) olive oil","Spinach Pesto","2 thick or 3 thin scallions, thinly sliced","2 garlic cloves, minced","4 ounces (115 grams) spinach leaves, baby spinach is fine","Red pepper flakes, to taste","Olive oil","Assembly","1 14-ounce can quartered artichoke hearts, drained and patted dry","Zest and juice from half a lemon","6 ounces (170 grams) mozzarella, diced from a block or perlini (as shown here)","1/2 cup (45 grams) grated parmesan","1/2 cup (55 grams) grated fontina or asiago cheese"],"instructions":"Make the dough: In a large bowl, whisk together the flour, salt, and yeast. Add the water and olive oil and use a spoon or dough whisk (I have this one) to bring it together, stirring the mixture a few times to ensure there are no unmixed pockets of flour. Cover the bowl with plastic wrap and let it rise until it doubles and moves a lot when jiggled, about 1 1/2 to 2 hours at room temperature. If you won’t need the dough until later, you can transfer it to the fridge a little before it’s fully doubled and let it finish there for a few hours or overnight. Assemble the pizza: Heat your oven to 450°F (230°C). Coat a 12-inch (30-cm) round cast-iron skillet or a 9×13 cake pan with 2 to 3 tablespoons olive oil. Scrape dough into the pan, then turn it over once so it’s oiled on both sides. Dip your fingers in the oil to coat them and dimple the dough out to the edges as best as you can; it’s okay if it doesn’t fully stretch at this point. Set it aside, loosely covered, for 30 minutes to finish proofing. Meanwhile, make the spinach pesto: In a food processor or high-speed blender, combine the scallions and garlic. Add spinach and pulse the machine until it’s well-chopped. Drizzle in olive oil until the mixture looks thick but loosened — usually it needs 4 to 6 tablespoons. Season well with salt and red pepper flakes to taste. To assemble: Being careful not to deflate the dough, use oiled fingers to gently dimple the dough out to the edges of the pan if it’s not there already. Spoon half of the spinach pesto mixture over the dough, and use the back of the spoon to gently spread it out. The toppings should go all the way to the pan’s edge when making this pizza, i.e. do not leave an empty border. Arrange the artichoke hearts over the spinach pesto, then finely grate some of the lemon zest over. Sprinkle mozzarella, parmesan, and fontina, then season the pizza with salt, red pepper flakes, and a little more lemon zest. Bake the pizza: For 25 to 30 minutes, until deeply golden brown at the edges and toasty on top. Yes, this baking time and temperature is correct. It sounds very long but I’ve made a hundred of these pizzas and always regret when I take it out before 30 minutes, as the edges have a less satisfying crunch. To serve: Finish with lemon juice. You can serve it right in the pan, but I prefer to protect my knives and loosen the pizza from the pan and slide it onto a cutting board before cutting it into wedges or squares. Do ahead: Leftovers reheat fantastically. I heat leftover slices on a foil-covered sheet pan at 350°F or 375°F for 15 minutes. Leftover spinach pesto keeps for up to 5 days in the fridge.","tags":["Artichokes","Dinner","Pizza","Recipe","Spinach","Vegetarian","Weeknight Favorite"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":"3 hours, with rising time"},"servings":"4","image":"https://i0.wp.com/smittenkitchen.com/wp-content/uploads/2024/04/spinach-artichoke-pan-pizza-10-scaled.jpg?fit=1200%2C800&ssl=1"}