{"name":"Spinach, Sun-Dried Tomato & Basil Puff Pastry Quiche","description":"Easy spinach & sun-dried tomato puff pastry quiche with fresh basil and a boost of protein from cottage cheese. The perfect savory brunch recipe!","ingredients":["1 frozen puff pastry sheet, defrosted","3-4 cups fresh spinach, finely chopped","½ cup drained sun-dried tomato halves, chopped","⅓ cup loosely packed basil leaves, chopped","6 large eggs","⅓ cup cottage cheese","⅓ cup milk of choice (I suggest dairy milk or unsweetened almond milk)","½ teaspoon kosher salt","Lots of freshly ground black pepper","2 ounces shredded sharp cheddar cheese","2 ounces feta cheese or goat cheese, crumbled (about ½ cup)","For egg wash:","1 large egg"],"instructions":"Preheat the oven to 375 degrees F. Spray a 9-inch pie pan with nonstick cooking spray. Prepare the crust: On a lightly floured surface, roll out the thawed puff pastry crust so that it will fit the bottom width of your pie pan. (If it isn’t thawed yet and is completely frozen, wrap it in a paper towel and microwave for 10-15 seconds to easily thaw.) Place rolled out puff pastry in the greased pie pan, trimming any edges that go over the sides and press those back into any gaps in the pie dish so the pan is completely covered. Tuck the crust edges so that the puff pastry rests just on the pie dish but doesn’t spill over the edges of the top, otherwise it will be difficult to remove. Prepare quiche: In a medium bowl, whisk together the eggs, cottage cheese, milk and salt and pepper until well combined. Add spinach, sundried tomatoes and basil to the bottom of the puff pastry. Pour the egg mixture over the top. Top with shredded cheddar, crumbled feta and extra black pepper. Make the egg wash: In a small bowl, whisk together one egg. Brush the crust of the puff pastry. Bake the quiche: Add quiche to the oven and bake for 35 to 40 minutes until eggs are set and no longer jiggly (a very slightly jiggly is fine!) and puff pastry crust is golden brown. I recommend checking at about 25 to 30 minutes in to make sure your puff pastry crust isn’t getting too brown or burning. Mine was fine throughout the entire process but all ovens are unique and run at slightly different temperatures. If it is getting too brown or starting to burn, simply tent the crust with foil.","tags":[],"time":{"prep":"20 minutes minutes","cook":"35 minutes minutes","active":"","inactive":"","ready":"","total":"55 minutes minutes"},"servings":"8","image":"https://www.ambitiouskitchen.com/wp-content/uploads/2024/05/Puff-Pastry-Quiche-5long.jpg"}