{"name":"Spinach & ginger chicken curry","description":"A classic palak, or spinach and chicken curry, is one of Maunika Gowardhan's favourite dishes served with naan.","ingredients":["850 g (1lb 13oz) skinless chicken on the bone , cut into medium-sized pieces","400 g (14oz) spinach leaves , washed and trimmed","4 cm (1½in) ginger root , roughly chopped","5 garlic cloves , roughly chopped","1 green bird's-eye chilli","3 tablespoons vegetable oil","4 green cardamom pods , whole","2 bay leaves","2.5 cm (1in) cinnamon stick","250 g (9oz) white onions , finely chopped","1 heaped tablespoon tomato purée (paste)","1 heaped tablespoon ground coriander","salt , to taste","½ teaspoon garam masala","1 tablespoon chopped coriander (cilantro) , to garnish","ginger root , cut into matchsticks, to garnish","FOR THE SPICED YOGHURT MARINADE","3 tablespoons Greek yoghurt","1 teaspoon ground turmeric","1 teaspoon Kashmiri chilli powder or mild chilli powder","1½ teaspoon cumin seeds , coarsely crushed"],"instructions":"First prepare the marinade. Mix all the marinade ingredients together in a large bowl. Make a few cuts in the chicken pieces to let the marinade soak in, then add the chicken pieces to the bowl and mix well, making sure they are all coated. Leave overnight in the refrigerator – even just 30 minutes is fine. Add the spinach to a blender with 3 tablespoons of water and blend to a smooth paste. You may need to do this in batches. Separately, blend the ginger, garlic and green chilli with 2–3 tablespoons of water to form a paste. Set aside. Heat the oil in a heavy-based, non-stick saucepan or kadhai, over a medium heat. Add the whole spices and fry for a few seconds. Add the onions and fry for 15 minutes, stirring well, until the colour begins to change. Add the ginger, garlic and chilli paste and fry for a further 2 minutes, stirring. Add a splash of water if it begins to stick to the base of the pan, then add the tomato purée. Fry for a couple of minutes, then stir in the ground coriander. Now add the marinated chicken and fry for 7–8 minutes, stirring and making sure to seal the pieces well. Reduce the heat to a low, season to taste, then cover and cook for 15–17 minutes until the chicken is cooked through, stirring halfway to make sure it doesn’t stick to the bottom of the pan. Now add the puréed spinach and continue to simmer over a low heat for a further 5–7 minutes, with the lid on. Finish with the garam masala, fresh coriander and ginger matchsticks, and stir together. Serve with naan or pulao, some raita and pickled slices of onion.","tags":["Curry","Chicken","Spinach","Lunch & dinner recipes","Mains"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":""},"servings":"Serves 4","image":"https://cdn.jamieoliver.com/recipe-database/medium/131331403.jpg"}