{"name":"Spoon It Up Kale Couscous Salad","description":"Fresh, herby kale couscous salad with feta, chickpeas, and olives that comes together in just 30 minutes for a satisfying lunch or side dish!","ingredients":["For the couscous:","1 cup pearl couscous","1 ½ cups water","½ teaspoon kosher salt","For the lemon vinaigrette:","⅓ cup fresh lemon juice","¼ cup extra-virgin olive oil","1 teaspoon dijon mustard","1 garlic clove, grated","½ teaspoon kosher salt","½ teaspoon red pepper flakes","1 teaspoon sugar or honey","Freshly ground black pepper","For the salad:","1 bunch of Tuscan kale, finely chopped","1 (15 ounce) can chickpeas, drained and rinsed","⅔ cup Castelvetrano olives, coarsely chopped","4 ounces feta, crumbled","½ cup finely chopped fresh parsley","½ heaping cup pickled red onion, plus more if you love them!!","Freshly ground salt and pepper, to taste"],"instructions":"Prepare the couscous: In a medium pot, add the water, couscous and salt and bring to a boil. Stir couscous, then reduce heat to low, cover, and cook for 8 to 10 minutes until all of the liquid is absorbed. Transfer to a large sieve and rinse the couscous with cold water for about 1 minute, until the couscous has cooled. Transfer to a large bowl. Make the vinaigrette: In a small bowl or mason jar: add the lemon juice, olive oil, dijon, garlic, salt, red pepper flakes, sugar (or honey) and a few grinds of pepper. Whisk until well combined and emulsified, or alternatively, place a lid on the jar and shake until well combined. Prepare the salad: In the large bowl with the couscous, add the kale and chickpeas. Pour the lemon vinaigrette over and use tongs to toss until dressing coats everything well, about 1 minute. Next, add in the olives, feta, parsley and red onion. Toss again with tongs until well-combined. Add salt and pepper to taste, as needed. Serve immediately or keep in the fridge for up to 3 days. Salad is excellent prepped ahead of time. Try serving with tortilla chips, pita chips or pita crackers for scooping up. This salad is also fantastic served on the side with your favorite protein such as grilled steak, chicken, shrimp or salmon. Enjoy!","tags":[],"time":{"prep":"20 minutes minutes","cook":"10 minutes minutes","active":"","inactive":"","ready":"","total":"30 minutes minutes"},"servings":"4","image":"https://www.ambitiouskitchen.com/wp-content/uploads/2024/07/Kale-Couscous-Salad-6long.jpg"}