{"name":"Strawberry ‘Almond Croissant’ Puff Pastry Tarts","description":"Beautiful strawberry puff pastry tarts that taste like an almond croissant! These easy strawberry almond tarts are perfect for summer parties, brunches & more.","ingredients":["For the strawberries:","8 ounces fresh strawberries, stems removed and cut into ¼-inch slices","1 tablespoon granulated sugar","For the pastry:","3 tablespoons salted butter, at room temperature*","¼ cup (50g) granulated sugar","1 egg yolk","½ cup (60 grams) fine blanched almond flour","1 teaspoon almond extract","All purpose flour for dusting","1 puff pastry sheet, defrosted","Topping and garnish:","1 large egg","⅓ cup (37g) sliced raw almonds","1-2 tablespoons powdered sugar, for dusting (optional)"],"instructions":"Preheat the oven to 400 degrees F. Line a large baking sheet with parchment paper. In a medium bowl, add strawberries and sugar and gently stir to coat the strawberries with sugar to bring out the strawberry flavors and juiciness. Set aside for later. In the bowl of an electric mixer (or feel free to use a hand mixer), add the softened butter, sugar and egg yolk and beat on high for 1 minute until well combined. Add the almond flour and almond extract and beat again on high for another 30 seconds until mixture is light and fluffy. Set aside. Lay the sheet of thawed puff pastry on a clean surface lightly dusted with flour and roll out to an approximately 9x13 inch sheet (sometimes they shrink when frozen). Cut the puff pastry into 9 equal rectangles, then lay each piece on the parchment-lined baking sheet, leaving a ½-inch space between each piece. Poke each piece a few times with a fork. Add 1 heaping tablespoon of the almond filling to the middle of each puff pastry and evenly spread towards edges, making a ½-inch border around the edge. Top the filling of each pastry with 3-4 strawberry slices. In a small bowl, whisk the egg with a fork and use a pastry brush to brush on the edges of each puff pastry piece. This will create a nice golden brown crust when baked. Finally, evenly sprinkle almond slices on each piece. Bake for 19-25 minutes until the pastry is golden brown on the edges and crisp. Remove from the oven and allow to cool for 10 minutes. Very lightly dust with powdered sugar, if desired. Serve warm or at room temperature. Enjoy!","tags":[],"time":{"prep":"15 minutes minutes","cook":"25 minutes minutes","active":"","inactive":"","ready":"","total":"40 minutes minutes"},"servings":"9","image":"https://www.ambitiouskitchen.com/wp-content/uploads/2024/05/Strawberry-Almond-Croissant-Puff-Pastry-Tarts-4long0-1024x683.jpg"}