{"name":"Summer Bean Gribiche","description":"Gribiche, the classic French sauce made of hard-boiled eggs, mustard, and herbs, is tossed with snappy summer beans for a simple but substantial salad.","ingredients":["1 lb. mixed snap beans (such as green, wax, and/or Romano), trimmed","½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, plus more","5 large eggs","⅓ cup extra-virgin olive oil","3 Tbsp. white wine vinegar","2 Tbsp. Dijon mustard","½ tsp. freshly ground pepper, plus more","1 large shallot, thinly sliced into rings","¼ cup finely chopped cornichons","2 Tbsp. coarsely chopped drained capers","¼ cup coarsely chopped tender herbs (such as parsley and/or dill), plus more for serving"],"instructions":"Working in batches by type (thick beans will take longer than thin ones), cook 1 lb. mixed snap beans (such as green, wax, and/or Romano), trimmed, in a large pot of boiling salted water until crisp-tender, 2–6 minutes per batch, depending on type. Using tongs, transfer to a large bowl of ice water and let cool. Using a slotted spoon and working one at a time, carefully lower 5 large eggs into same pot of boiling water. Cook, adjusting heat as needed to maintain a simmer, 9 minutes. Transfer eggs to bowl of ice water with beans; let cool. Drain beans and eggs; pat beans dry with a kitchen towel or paper towels and peel eggs. Cut 1 egg in half lengthwise; remove yolk and transfer to a large bowl. Tear or coarsely chop egg white and remaining whole eggs into large pieces; set aside. Add ⅓ cup extra-virgin olive oil, 3 Tbsp. white wine vinegar, 2 Tbsp. Dijon mustard, ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, and ½ tsp. freshly ground pepper to bowl with egg yolk and whisk until creamy and emulsified. Add 1 large shallot, thinly sliced into rings, ¼ cup finely chopped cornichons, 2 Tbsp. coarsely chopped drained capers, and ¼ cup coarsely chopped tender herbs (such as parsley and/or dill); mix to coat. Let dressing sit at least 10 minutes and up to 30 minutes. Add beans to dressing and toss until well coated. Add reserved torn eggs and toss very gently to keep eggs in large pieces. Taste bean gribiche and season with more salt if needed. Transfer bean gribiche to a platter; spoon any dressing and eggs remaining in bowl over. Top with more herbs and season with more pepper. Do Ahead: Beans can be blanched 1 day ahead. After patting dry, transfer to an airtight container; cover and chill.","tags":["side","dinner","lunch","summer","30 minutes or less","quick","dairy-free","gluten-free","nut-free","egg","salad","vegetarian","french","green bean","shallot"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":""},"servings":"","image":"https://assets.bonappetit.com/photos/66574ccabb9e3cf71a29c896/16:9/w_1280,c_limit/240426%20MVP2019.jpg"}