{"name":"Summer Garden Crustless Zucchini Pie","description":"Easy low carb crustless zucchini pie recipe packed with summer vegetables. It's freezer-friendly and perfect for breakfast or brunch!","ingredients":["Cooking spray","½ tablespoon olive oil or avocado oil","3 cloves garlic, minced","1 bunch green onions, diced (reserve some green scallions for topping)","1 cup sliced baby bella mushrooms","¾ cup grape or cherry tomatoes, halved","½ small red bell pepper, diced","½ cup sweet corn, fresh or frozen","1 medium zucchini, sliced into ¼ inch rounds","Freshly ground salt and black pepper","6 large eggs","¼ cup unsweetened almond milk (or any milk)","2 tablespoons sifted coconut flour (or sub 1/4 cup regular flour)","3-5 large basil leaves, julienned","1 cup shredded sharp cheddar cheese, divided"],"instructions":"Preheat oven to 375 degrees Fahrenheit. Grease a 9 inch deep dish pie pan (or a 9 inch springform pan) with nonstick cooking spray. Add olive oil to a large skillet and place over medium high heat. Once hot, add garlic, green onions and sauté until fragrant. Then add in mushrooms, tomatoes, red bell pepper and corn; season with a little salt and pepper and cook for a few minutes until the mushrooms begin to soften. (We're not cooking the zucchini!) Remove veggies from heat and set aside. In a large bowl, whisk together eggs, almond milk, flour, basil, 1/2 cup shredded cheese and a little salt & pepper. Add all of the veggies (including the zucchini) to the greased pie pan and spread out evenly. Next pour your egg mixture over the top of the veggies. Sprinkle the top with remaining 1/2 cup shredded cheddar cheese. Bake for 35-50 minutes or until egg sets, puffs up, and becomes slightly golden. Remove from heat and allow to cool for 10 minutes before cutting into 6 slices. Allow pie to completely cool before covering and storing in the fridge.","tags":[],"time":{"prep":"15 minutes minutes","cook":"45 minutes minutes","active":"","inactive":"","ready":"","total":"1 hour hour"},"servings":"6","image":"https://www.ambitiouskitchen.com/wp-content/uploads/2023/07/Pie-FB.png"}