{"name":"Summer Pea Salad with Unexpected Dressing","description":"A heap of peak summer vegetables, some crunch, salty cheese, and a dressing with a shunned ingredient so good here, I’m certain it’s going to convert you.","ingredients":["1/4 cup golden raisins","1/4 cup white wine vinegar, warmed","2 tablespoons minced shallot","1 1/4 to 1 1/2 pounds fresh summer peas, such as sugar snaps, snow peas, shelling peas, and/or favas","Kosher salt","1/2 teaspoon smooth dijon mustard (optional)","3 to 4 tablespoons olive oil","Red pepper flakes and freshly ground black pepper, to taste","1/2 cup toasted almonds (I’m using marcona), roughly chopped","2 to 3 ounces sliced or crumbled ricotta salata cheese","1/4 cup chopped fresh mint"],"instructions":"Make the dressing: Chop the raisins into rough bits and place in a bowl with shallots. Pour vinegar over and stir to combine. Let sit, cool, and infuse while you prepare the remaining parts of the salad. [Note: It is completely up to you whether you wish to cook sugar snaps and/or snow peas; both are delicious raw. For this salad, I cook the sugar snaps for 30 seconds to 1 minute but leave the snow peas raw.] Cook your peas: Bring a medium pot of salted water to a boil. Prepare a large bowl of ice water. If using favas or shelling peas, remove them from and discard their pods. Cook favas in the water for 3 minutes; shelling peas for 1 minute, and sugar snaps and/or snow peas for 30 seconds to 1 minute. Scoop each out immediately with a slotted spoon and drop in the ice bath. If you choose to not cook your sugar snaps or snow peas, skip the pot and put them directly in ice water for 10 minutes for the best juicy crunch. One peas are fully cold, drain and pat dry on a large towel. If you’ve used favas, they have one final step of preparation: You’ll need to make a small slit with a sharp paring knife in the outer light green pod so that the inner dark green enjoyable part of the fava can slip out. Finish the dressing: Add dijon, if using, 3 tablespoons olive oil, salt (about 1/2 teaspoon Diamond kosher), freshly ground black pepper, and red pepper flakes to dressing and whisk to combine, tasting for seasoning and adjusting as needed. If you’d like it less kicky, add remaining tablespoon olive oil. Assemble and finish: Transfer peas to a bowl and toss with dressing to taste; you may not need it all. Add more seasoning, if needed. Add almonds, cheese, and mint and toss once again. Eat right away. Do ahead: Vegetables and dressing can be prepared and kept cool, separately, up to a day in advance. Mix only before serving.","tags":["Gluten-Free","Peas","Recipe","Salad","Summer","Vegetarian"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":"30 minutes"},"servings":"2 to 4","image":"https://i0.wp.com/smittenkitchen.com/wp-content/uploads/2023/06/summer-pea-salad-5-scaled.jpg?fit=1200%2C780&ssl=1"}