{"name":"Super smoothies","description":"Four delicious fruit smoothies to blend up at home","ingredients":["For the green smoothie","1 banana","200 g baby spinach","250 ml fresh apple juice","1 lime","For the purple smoothie","2 pears","150 g frozen blueberries","100 ml fresh apple juice","For the orange smoothie","2 cm piece of ginger","1 carrot","200g frozen mango","200 ml fresh orange juice","1 lime","For the white smoothie","1 banana","3 tablespoons ground almonds","250 ml milk","runny honey , to taste"],"instructions":"For the green smoothie\n1.\tPeel the banana and cut into nice big slices on a chopping board – ideally you want to use frozen bananas, so try to remember to do this the day before.\n2.\tPut the banana and spinach in a blender and pour in the apple juice.\n3.\tCut the lime in half and squeeze all the lime juice into the blender.\n4.\tSecure the lid and blitz until smooth, then serve. For the purple smoothie\n1.\tRemove the stalks from the pears, then use a knife to cut into quarters, removing and discarding the cores.\n2.\tPut the pears and blueberries in a blender, then pour in the apple juice.\n3.\tSecure the lid and blitz until smooth, then serve. For the orange smoothie\n1.\tUse a teaspoon to scrape all the skin off the ginger, then finely grate onto a board using a microplane.\n2.\tPeel the carrot, then trim and roughly chop it.\n3.\tPut the ginger, carrot and frozen mango in a blender, then pour in the orange juice.\n4.\tCut the lime in half and squeeze all the lime juice into the blender.\n5.\tSecure the lid and blitz until smooth, then serve. For the white smoothie\n1.\tPeel the banana and cut into nice big slices on a chopping board – ideally you want to use frozen bananas, so try and remember to do this the day before.\n2.\tPut the banana, ground almonds, milk and honey in a blender.\n3.\tSecure the lid and blitz until smooth, then serve.","tags":["Fruit","Drinks","Breakfast","Healthy snack ideas","Juices and smoothies"],"time":{"prep":"","cook":"Time 20 minutes","active":"","inactive":"","ready":"","total":"Time 20 minutes"},"servings":"Serves 2","image":"https://cdn.jamieoliver.com/recipe-database/oldImages/medium/1104_1_1436891354.jpg"}