{"name":"Sweet vanilla risotto with poached peaches and chocolate","description":"Jamie's sweet risotto recipe is an Italian inspired take on the classic rice pudding; Flavoured with vanilla, chocolate and peach it's a wining combination.","ingredients":["6 ripe peaches , halved","6 tablespoons caster sugar","½ stick cinnamon","1 orange , zest and juice of","3 tablespoons butter","2 vanilla pods","325 g risotto rice","1 wineglass white wine","1 litre full fat milk , preferably organic","100 g good-quality white chocolate , grated","100 g good-quality dark chocolate (70% cocoa solids)","1 handful fresh mint , leaves picked"],"instructions":"When you halve the peaches, leave the stones in – they will come away a lot more easily after they have been cooked. Put them into a small pan with 4 tablespoons of the sugar, the cinnamon stick and the zest and juice of the orange. Put a lid on top and slowly simmer for about 10 to 15 minutes, until the peach skin and stones can be easily removed. You don't want to cook them to pulp – they should be soft but should still hold their shape. Remove from the heat and put to one side. In an appropriately sized high-sided, thick-bottomed pan with a lid, slowly melt two-thirds of the butter. Score down the length of the vanilla pods and remove the seeds by scraping a knife down the inside of each half. Add the seeds to the butter and stir. Continue to cook for 1 minute before adding your rice with the remaining sugar. Turn the heat up to medium, stir the rice, and add the wine, continuing to stir until it has almost cooked away. Now add the milk little by little. Keep the rice on a slow but constant simmer for about 16 or 17 minutes and stir it as often as you can. In this way you can massage the starch out of the rice and this will give you a silky, oozy end product, much like the classic Italian risotto. When the rice has cooked through it should be soft yet still holding its shape. You may need to add a little more milk or water just to adjust the consistency. Remove from the heat, add the grated white chocolate and the rest of the butter, then stir, place a lid on top and leave for a few minutes. Remove the skin and stones from the peaches, discard them along with the cinnamon stick, and take the peaches to the table with your block of dark chocolate, snapped into small pieces. Spoon the risotto on to plates, then push a couple of pieces of dark chocolate into the middle of each one. Just so you know, a perfect risotto should slowly creep and ooze to the side of your plate, so don't worry if it starts to spread out! Gently tear the peaches and place some on each plate, then drizzle over some of the lovely juice and sprinkle over a few mint leaves. By the time you go to eat it, the dark chocolate will have melted. Joy joy joy!","tags":["Jamie's Dinners","Italian","Fruit","Desserts","Pasta & risotto"],"time":{"prep":"","cook":"Time 50 minutes","active":"","inactive":"","ready":"","total":"Time 50 minutes"},"servings":"Serves 8","image":"https://cdn.jamieoliver.com/recipe-database/oldImages/medium/587_1_1421662231.jpg"}