{"name":"Sweet and Salty Chocolate Tahini Rice Krispie Treats","description":"No bake chocolate tahini rice krispie treats naturally sweetened with maple syrup, topped with a luscious dark chocolate coating, and studded with crunchy pretzels.","ingredients":["For the base:","¾ cup (173g) tahini","⅓ cup (104g) pure maple syrup","1 tablespoon virgin coconut oil","1 teaspoon vanilla extract","½ teaspoon kosher salt","2 ½-3 cups (93g) crispy brown rice cereal","For the topping:","1 cup (180 grams) dark (or semi-sweet) chocolate chips","1 tablespoon virgin coconut oil","1 heaping cup (67g) pretzel twists, slightly broken","1-2 tablespoons toasted sesame seeds","Fancy sea salt (I like Maldon), for sprinkling on top"],"instructions":"Line an 8-inch square pan with parchment paper. Set aside. Make the base: In a medium pot, combine the tahini, maple syrup, coconut oil, and salt over medium-low heat. Cook, stirring frequently with a wooden spoon, until the mixture is smooth, warm, and well combined, 1 to 2 minutes. Remove from the heat and stir in the vanilla. Stir in the crispy brown rice cereal until the cereal is completely coated. Pour into the prepared pan and use a rubber spatula to press the cereal down and flatten the top. Make the topping: In a medium microwave-safe bowl, combine the chocolate chips and coconut oil. Microwave on high in 30-second intervals, stirring in between, until melted and smooth. Pour the mixture over the bars and tilt the pan to spread evenly. Add the pretzels evenly all over the chocolate, then sprinkle with toasted sesame seeds. Chill and sprinkle: Place the pan in the fridge until the bars are completely cool and the chocolate is hardened, at least 1 hour. Alternatively you can stick them in the freezer for 30-45 minutes. Sprinkle the bars with sea salt, then cut into 16 bars. Store in an airtight container in the fridge for up to 1 week. Bars are also freezer-friendly but may dry out slightly. If you freeze them, let sit at room temperature for 5-10 minutes before serving.","tags":[],"time":{"prep":"10 minutes minutes","cook":"2 minutes minutes","active":"","inactive":"","ready":"","total":"12 minutes minutes"},"servings":"16","image":"https://www.ambitiouskitchen.com/wp-content/uploads/2024/07/Sweet-Salty-Pretzel-Tahini-Rice-Krispie-Treats-4long-1024x683.jpg"}