{"name":"Sweet pepper panzanella salad","description":"Jamie’s take on a Tuscan panzanella salad celebrates peppers at their best, with a tangy tomato dressing, garlicky bread and crunchy veg. Perfect for a summer lunch, alfresco dinner or barbecue.","ingredients":["600 g mixed peppers","600 g stale bread","1 kg mixed ripe tomatoes","extra virgin olive oil","red or white wine vinegar","1 handful of baby capers","1 clove of garlic","1 onion","1 celery heart","½ a bunch of basil (15g)","1 x 50g tin of anchovies in oil"],"instructions":"Whether you’ve got an open fire, a gas hob or simply a grill, get the heat going to full whack. Place the peppers directly on the flame or under the grill and allow them to blister and blacken all over for 5 to 10 minutes, turning regularly. Remove to a bowl, cover and leave to steam for 20 minutes – this will make it easy to remove the skins. Thickly slice the bread and lightly grill on both sides. Chop all but one of the tomatoes, mixing things up so you’ve got a variety of different sizes and shapes, then place in a shallow bowl. Season lightly with sea salt and black pepper, drizzle with 3 tablespoons of extra virgin olive oil and 1½ tablespoons of vinegar, then add the capers. Grate over the remaining tomato, discarding any skin and seeds, then toss together well. Halve the garlic clove, rub the toasted bread with the cut side, then tear the bread into rustic bite-sized pieces and place on top of the tomatoes. Peel and very finely slice the onion. Trim and finely slice the celery heart, reserving any pale inner leaves for later, and add to the bowl with the onion. Pick the basil leaves into a bowl of cold water. Once the peppers are cooled, remove as much black skin as possible, as well as the stalk and seeds, then tear into rustic slivers and add to the bowl. Drain the basil leaves and add most of them to the bowl. Use your hands to toss and mix everything together until the bread has soaked up all the lovely tomato dressing. Drizzle over a little of the oil from the anchovy tin, then thinly slice and drape the anchovies over the salad. Scatter over the reserved celery and basil leaves, then leave the salad to sit for 15 minutes before tucking in.","tags":[],"time":{"prep":"","cook":"Time 40 minutes","active":"","inactive":"","ready":"","total":"Time 40 minutes"},"servings":"Serves 6","image":"https://cdn.jamieoliver.com/recipe-database/medium/158950017.jpg"}