{"name":"Tahini Monster Cookie Bars","description":"Gooey monster cookie bars filled with the best, delicious mix-ins! These gluten free monster cookie bars are also dairy free & SO easy.","ingredients":["Wet ingredients:","2 eggs","1 cup (154g) coconut sugar (or sub brown sugar)","¾ cup (173g) tahini (or sub peanut butter or almond butter)","¼ cup (56g) melted and cooled coconut oil","1 teaspoon vanilla extract","Dry Ingredients:","1 cup (112g) packed fine almond flour","½ cup (48g) rolled oats (if you want them thicker/more oat-y you can do ¾ cup but I prefer ½ cup)","½ cup (43g) finely shredded unsweetened coconut (i use Bob’s Red Mill)","½ teaspoon baking soda","¼ teaspoon salt","For the mix-ins:","½ cup (90g) dark chocolate chunks or chocolate chips (dairy free if desired), divided","½ cup (100g) chocolate candies (I used Unreal brand candies), divided","Fancy maldon Salt, for sprinkling on top"],"instructions":"Preheat the oven to 350 degrees F. Line an 9x9 inch pan with parchment paper. In a large bowl, mix together eggs, coconut sugar and tahini until smooth and creamy. Next add in the melted and cooled coconut oil and vanilla and mix together again until it is very smooth and well combined. This should take at least 30 seconds to mix until smooth, you do not want any oil separation. Add the dry ingredients to the wet ingredients until well combined: almond flour, oats, shredded coconut, baking soda and salt. Finally fold in 1/4 cup of the chocolate chunks/chips and ¼ cup of chocolate candies; you’ll reserve the other half of each for sprinkling on top. Add the dough to the prepared pan and evenly spread out with a spatula towards the edges. Sprinkle the top with remaining ¼ cup chocolate chips and ¼ cup chocolate candies. Bake for 20-25 minutes until the edges are BARELY golden brown. The trick with these blondies is to slightly underbaked them so they stay nice and fudgy and gooey. Once done baking, sprinkle with sea salt. Allow blondies to cool for 20 minutes before cutting into so they don’t fall apart. Cut into 16 squares.","tags":[],"time":{"prep":"15 minutes minutes","cook":"20 minutes minutes","active":"","inactive":"","ready":"","total":"35 minutes minutes"},"servings":"16","image":"https://www.ambitiouskitchen.com/wp-content/uploads/2022/08/Monster-Bars-FB.png"}