{"name":"Tart Cherry Pie Bars with Oatmeal Crumble (vegan and gluten free)","description":"Tart cherry pie bars made with a homemade tart cherry filling and topped with an oatmeal crumble. Vegan, gluten free, and easy to make!","ingredients":["For the crust and crumble:","1 ½ cups (138g) gluten-free oat flour (or sub all-purpose or whole wheat pastry flour)","1 cup (95g) old-fashioned rolled oats, gluten free if desired","½ cup (77g) coconut sugar (or brown sugar)","½ teaspoon ground cinnamon","¼ teaspoon baking soda","¼ teaspoon salt","½ cup (113g) butter or vegan buttery stick, melted","2 teaspoons vanilla extract","¼ teaspoon almond extract","For the filling:","2 ½ heaping cups (350g) frozen tart cherries","3 tablespoons pure maple syrup","1 tablespoon cornstarch or arrowroot starch, plus 1-2 teaspoons more if necessary","⅛ teaspoon almond extract","Pinch of salt"],"instructions":"Preheat oven to 350 degrees F. Line an 8x8 inch pan with parchment paper and generously spray with nonstick cooking spray. Set aside. Make the base + topping: In a large bowl, use a fork to mix together the oat flour, oats, coconut sugar, cinnamon, baking soda and salt. Add in melted butter, vanilla extract and almond extract and stir until a nice crumble forms and dough begins to clump together. Place 1 ½ cups of the mixture into the prepared pan and place the remaining mixture into the fridge (the remaining mixture will be used for the topping). Use your hands to evenly press the dough to the bottom of the pan. Next make your cherry pie filling: place a medium pot over medium heat. Add in tart cherries, maple syrup, almond extract, cornstarch (or arrowroot) and salt. Use a wooden spoon to press down and break down the cherries just a bit. Bring to a boil, then reduce heat and cook for 5 more minutes until mixture is thickened up and nicely coats the back of a spoon without being too drippy. If it’s too drippy stir in 1-2 teaspoons more cornstarch or arrowroot. Pour mixture over the crust and use a spoon to evenly spread. Take the remaining topping out of the fridge. By now there should be some nice crumbles that have clumped together. Sprinkle the topping over the tart cherry filling. Bake for 30 minutes or until filling is bubbly and topping is golden. Allow bars to cool completely on a wire rack before transferring to the fridge to chill. Bars are delicious served at room temperature or straight out of the fridge. Use a sharp knife to cut into 16 bars before serving.","tags":[],"time":{"prep":"15 minutes minutes","cook":"30 minutes minutes","active":"","inactive":"","ready":"","total":"45 minutes minutes"},"servings":"16","image":"https://www.ambitiouskitchen.com/wp-content/uploads/2019/06/cherrypiebars-5long.jpg"}