{"name":"The New Go-To Kale Salad","description":"Grab the recipe for this life changing Salmon Kale Salad that you'll want to make for breakfast and lunch forever and ever!","ingredients":["▢ 3 bunches lacinato kale Tuscan kale or cavolo nero, thick ribs cut out","▢ 2 garlic cloves finely chopped","▢ ⅓ cup finely grated Pecorino Romano cheese plus more to finish","▢ Extra-virgin olive oil","▢ Juice of 1 lemon","▢ ¼ teaspoon dried chile flakes","▢ Kosher salt and freshly ground black pepper","▢ Lemon wedges for serving on the side of the salad","▢ 2 teaspoons everything bagel seasoning","▢ 1-2 avocados sliced","▢ 1 lb salmon cut into 4 4-ounce filets","▢ kosher salt and freshly cracked black pepper","▢ 1 tablespoon olive oil","▢ ½ cup panko breadcrumbs","▢ 2 tablespoons butter"],"instructions":"Stack several kale leaves on top of one another and roll them up into a tight cylinder. With a sharp knife, slice crosswise into very thin, about 1/16 inch, ribbons. Put the kale in a salad spinner, rinse in cool water, and spin until completely dry. Pile the kale into a bowl.Put the chopped garlic on a cutting board and mince it even more until you have a paste. Transfer the garlic to a small bowl, add the pecorino, a few tablespoons of olive oil, lemon juice, chile flakes, salt, and plenty of black pepper, and whisk to combine.Pour the dressing over the kale and toss well to thoroughly combine. Taste and adjust with more lemon, salt, chile flakes, or black pepper. Let the salad sit for about 5 minutes so the kale softens slightly. Top with the toasted breadcrumbs, avocados, more cheese, and drizzle with more oil and the everything bagel seasoning. For the salmon Sprinkle the salmon filets with salt and pepper. Heat a nonstick pan over high heat. Add the oil to the pan and then add the fish. Cook the salmon about 2-3 minutes until there’s a golden crust. Then flip the salmon and cook another minute or two on the skin side. Remove the salmon and add on the salad as needed For the breadcrumbs Melt the butter in a small non stick skillet. Add the panko breadcrumbs and toast for 1-2 minutes until fragrant. Remove from heat and set aside.","tags":["American"],"time":{"prep":"15 minutes mins","cook":"10 minutes mins","active":"","inactive":"","ready":"","total":"25 minutes mins"},"servings":"4 servings","image":"https://whatsgabycooking.com/wp-content/uploads/2018/10/WGC-Go-To-Salmon-Kale-Salad-2-copy.jpg"}