{"name":"The Best Zucchini Brownies You'll Ever Eat","description":"The BEST healthy zucchini brownies are paleo, gluten free, naturally sweetened, fudgy, and the perfect way to bake with zucchini.","ingredients":["1 medium zucchini shredded and squeezed of excess moisture with a paper towel (1 cup shredded zucchini)","1 large egg","1/2 cup tahini*","¼ cup pure maple syrup","½ cup coconut sugar","1 teaspoon vanilla extract","½ cup high quality cocoa powder (or cacao powder)","2 tablespoons coconut flour","½ teaspoon baking soda","½ teaspoon salt","2 tablespoons melted and cooled coconut oil","⅓ cup chocolate chips, dairy free if desired","Optional: ½ cup chopped walnuts","For the topping:","2 tablespoons chocolate chips, dairy free if desired","1/2 teaspoon coconut oil","Fancy sea salt, for sprinkling on top"],"instructions":"Preheat oven to 350 degrees F. Line an 8x8 inch pan with parchment paper and spray with nonstick cooking spray. First, measure out 1 heaping cup of shredded zucchini, then place shredded zucchini in a paper towel or cheese cloth and squeeze out all of the moisture/water. This is very important! Next add in egg, tahini, maple syrup, coconut sugar and vanilla; stir until smooth. Gently stir in cocoa powder into the batter, mixing until well incorporated. Next add in coconut flour, baking soda, salt and finally the melted coconut oil. Stir until well combined. Fold in chocolate chips (and walnuts if you are using). Pour into prepared pan. Bake for 30-35 minutes or until toothpick inserted into center comes out with just a few crumbs attached (it should not be completely wet, but a little gooeyness is just fine). Allow to cool completely. This will be tough, but it’s the best way to make sure the bars stay together perfectly since they will be moist. Once ready for the chocolate drizzle: Add 2 tablespoons chocolate chips and coconut oil to a small microwave safe bowl. Microwave in 30 second increments, stirring in between, until chocolate is melted. Drizzle over zucchini brownies. Sprinkle with a little fancy sea salt (trust me, it’s good!). Cut into 16 squares.","tags":[],"time":{"prep":"15 minutes minutes","cook":"30 minutes minutes","active":"","inactive":"","ready":"","total":"45 minutes minutes"},"servings":"16","image":"https://www.ambitiouskitchen.com/wp-content/uploads/2021/07/Zucchini-Brownies.png"}