{"name":"Thumbprint Cookies","description":"These thumbprint cookies offer classic shortbread flavor with dazzling jam centers. Almond flour makes them gluten free and extra delicious!","ingredients":["2 ¼ cups (191 grams) fine blanched almond flour, spooned and leveled","6 tablespoons (80 grams) unsalted butter, melted but not overly hot","¼ cup (80 grams) maple syrup ","1 teaspoon vanilla extract","¼ teaspoon fine salt","2 tablespoons sugar, for rolling ","6 tablespoons jam or preserves of choice (raspberry recommended), well stirred"],"instructions":"Preheat the oven to 350 degrees Fahrenheit. Line a large, rimmed baking sheet with parchment paper to ensure that the cookies don’t stick to the pan. In a medium mixing bowl, combine the almond flour, melted butter, maple syrup, vanilla extract, and salt. Stir until the dough is uniformly blended and smooth. Pour the sugar into a small bowl and set it aside. Use a small cookie scoop (size 70 portioner) or scoop 2 teaspoons of the dough with measuring spoons. Gently roll the dough into a ball between your palms. Drop the ball into the bowl of sugar and roll it around until lightly coated all around. Gently roll it into a ball once more and place it on the cookie sheet. Repeat with the remaining dough, keeping the balls about 2 inches apart. To make indentions for the jam, use the rounded back of a teaspoon or your thumb to gently press an indentation in the center of each cookie dough ball. If the dough cracks around the edges, take the time to gently smooth it back together. Fill each indentation with a level ½ teaspoon of jam (no more!). If the jam is too firm to work with, gently warm it in the microwave for a few seconds, just until it’s easy to stir. Bake the cookies for 13 to 15 minutes, until they start to turn lightly golden around the edges. Remove the cookies from the oven. Let the cookies cool on the pan for 10 minutes before transferring them to a rack to cool completely. Store these cookies in an airtight container at room temperature, ideally in a single layer, for up to 7 days. They become a little more tender as time goes on, so I wouldn’t suggest shipping these.","tags":["baked goods","Christmas","cookies","egg free","fall","Game Day","gluten free","Halloween","Independence Day","pantry friendly","recipes","soy free","spring","summer","Thanksgiving","tomato free","winter"],"time":{"prep":"20 minutes","cook":"14 minutes","active":"","inactive":"","ready":"","total":"34 minutes"},"servings":"24 cookies","image":"https://cookieandkate.com/images/2024/02/thumbprint-cookies-recipe.jpg"}