{
  "name": "Tofu Meatballs in Burst Tomato Sauce",
  "description": "We paired these easy tofu meatballs with a simple, summery tomato sauce that cooks as they bake, but you can flavor them any way you like.",
  "ingredients": [
    "2 Tbsp. extra-virgin olive oil, plus more",
    "1 14-oz. package extra-firm tofu, drained, patted dry",
    "1 large egg",
    "7 garlic cloves, 3 finely grated, 4 thinly sliced",
    "1 cup panko breadcrumbs",
    "1 tsp. dried oregano",
    "¼ tsp. crushed red pepper flakes",
    "1 oz. Parmesan, finely grated (about ½ cup), plus more for serving",
    "2½ tsp. Diamond Crystal or 1½ tsp. Morton kosher salt, divided, plus more",
    "1 large shallot, halved, thinly sliced",
    "2 Tbsp. double-concentrated tomato paste",
    " Freshly ground black pepper",
    "1½ lb. cherry tomatoes (about 3 pints), halved if large"
  ],
  "instructions": "Place a rack in middle of oven; preheat to 400°. Grease a rimmed baking sheet with extra-virgin olive oil. Place one 14-oz. package extra-firm tofu, drained, patted dry, in a large mixing bowl. Using your hands, squish into a coarse meal (it should be the consistency of ground meat). Add 1 large egg, 3 garlic cloves, finely grated, 1 cup panko breadcrumbs, 1 tsp. dried oregano, ¼ tsp. crushed red pepper flakes, 1 oz. Parmesan, finely grated (about ½ cup), and 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt. Mash and mix with your hands to combine, breaking up tofu more (unlike ground meat, tofu won’t get tough when mixed vigorously). Roll tofu mixture into golf-ball-size balls (you should have about 16) and place on prepared baking sheet. Drizzle with oil, then turn to coat. Bake tofu balls, turning once, until lightly browned and crisp, about 30 minutes. Meanwhile, heat 2 Tbsp. extra-virgin olive oil in a medium Dutch oven or other heavy pot over medium-high. Add 1 large shallot, halved, thinly sliced, and cook, stirring occasionally, until softened, about 3 minutes. Add 4 garlic cloves, thinly sliced, and cook, stirring often, until slightly softened, about 1 minute. Add 2 Tbsp. double-concentrated tomato paste and remaining 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt; season generously with freshly ground black pepper. Cook, stirring often, until tomato paste is darkened in color, about 2 minutes. Add 1½ lb. cherry tomatoes (about 3 pints), halved if large, and 2 cups water. Cook, stirring occasionally and pressing down on tomatoes with a potato masher or wooden spoon to help burst, until sauce is thickened, 15–20 minutes. Remove from heat if meatballs aren’t done yet. Season with salt and black pepper. Add meatballs to sauce and reduce heat to medium-low (or return to heat). Bring to a bare simmer, stirring occasionally; cook just to heat through. Ladle into shallow bowls and top with more Parmesan. Do Ahead: Tofu meatballs can be formed 3 months ahead; freeze on a baking tray. When solid, transfer to a sealable airtight container. Bake from frozen, adding 5–10 minutes to the cook time.",
  "tags": [
    "dinner",
    "main",
    "weeknight meals",
    "vegetarian",
    "nut-free",
    "quick",
    "meal prep",
    "cherry tomato",
    "tofu"
  ],
  "time": {
    "prep": "",
    "cook": "",
    "active": "",
    "inactive": "",
    "ready": "",
    "total": ""
  },
  "servings": "",
  "image": "https://assets.bonappetit.com/photos/663949ef4a60535939adf863/16:9/w_1280,c_limit/BA-DIS_Tofu-Meatballs_WEB.jpg"
}
