{"name":"Vegan No Bake Chocolate Peanut Butter Oatmeal Bars","description":"Vegan no bake chocolate peanut butter oatmeal bars made with simple ingredients. Healthy, gluten free and make the best easy snack or dessert!","ingredients":["1 cup (256g) creamy natural drippy peanut butter* (just peanuts + salt)","½ cup (173g) packed pitted Medjool dates (about 6-7 large pitted Medjool dates)**","1 teaspoon vanilla extract","1 tablespoon chia seeds","1 tablespoon flaxseed meal (or sub hemp seeds or leave out)","¾ cup (71g) old fashioned rolled oats, gluten free if desired","1 (3 ounce) dark chocolate bar (around 70%), dairy free if desired","Maldon sea salt, for sprinkling"],"instructions":"First soak the dates in warm water for 10 minutes before using in this recipe. This helps them become soft and the perfect consistency for blending with the peanut butter and oats. After 10 minutes, drain dates. Add peanut butter, soaked dates, vanilla, chia seeds and flaxseed to the bowl of a food processor and pulse until well combined. You want to process until the dates are somewhat smooth; there can be a few chunky pieces but not too many! Add in oats and pulse a few times until oats are somewhat combined into the dough. You may need to scrape the dough down the sides of the bowl. Press peanut butter oat mixture into an 8 ½ x 4 1/2 inch loaf pan lined with parchment paper. Make the chocolate layer by adding 3 ounces of dark chocolate to a small saucepan and melting over low heat until completely smooth. Pour the melted chocolate over the peanut butter layer and tilt the pan so that the chocolate covers the peanut butter layer entirely. Place in the fridge for at least 1 hour before slicing into 10 squares. Sprinkle with sea salt if desired. Store covered in the fridge until ready to eat. Bars will keep for up to two weeks. Bars can also be frozen for up to 2 months.","tags":[],"time":{"prep":"1 hour10 minutes hourminutes","cook":" ","active":"","inactive":"","ready":"","total":"1 hour10 minutes hourminutes"},"servings":"10","image":"https://www.ambitiouskitchen.com/wp-content/uploads/2020/03/Vegan-No-Bake-Chocolate-Peanut-Butter-Oatmeal-Bars-7long.jpg"}