{"name":"Vegetable tartlets","description":"A puff pastry vegetable tart that's great for using up veg that you might have around. Treat this recipe as a template for vegetarian puff pastry recipes.","ingredients":["1 x 500 g block of ready-made puff pastry","plain flour , for dusting","4 teaspoons pesto","1 handful of mixed, ripe cherry tomatoes","8 asparagus spears","4 baby courgettes","2-3 jarred roasted peppers","½ a bunch of fresh basil","olive oil","8 black olives , optional","1 x 100 g ball mozzarella","20 g Parmesan cheese , optional"],"instructions":"Turn on the oven to 200ºC/gas 6. Carefully cut the pastry block in half with a table knife. Wrap the other half and refrigerate or freeze for later. Dust some flour onto a clean work surface and, using a rolling pin, roll out the pastry into a square, measuring 26cm x 26cm. Cut into 4 equal squares. Place the pastry squares on a baking tray, leaving a space between each. Using the back of a spoon, spread the centre of each square with pesto, but don’t spread it onto the edges. Squash the tomatoes into a large mixing bowl, then snap the asparagus spears into 3cm pieces. Keep the lovely pointy tips and a little of the stalk, but discard the end 3cm. Using a speed peeler, carefully shred the courgettes into ribbons. Tear the roasted peppers into strips and add to the bowl. Pick the basil leaves, reserving the pretty ones for later. Place the large ones in the mixing bowl. Mix the vegetables together in the bowl, adding a splash of oil. Pile a little of the mixture on each pesto-smeared tart and top with two olives (if using). Break up the mozzarella and place little bits on top of each tart – this will make it gooey like a pizza. Grate over some Parmesan (if using). Bake for 15 to 20 minutes, until the pastry is golden and the cheese is all bubbly. Once the tarts are ready, allow to cool slightly. Sprinkle with the reserved basil leaves and serve with a nice salad for lunch.","tags":["Jamie Magazine","Vegetables","Alfresco","Mother's day","Wimbledon","Mains"],"time":{"prep":"","cook":"Time 35 minutes plus cooling","active":"","inactive":"","ready":"","total":"Time 35 minutes plus cooling"},"servings":"Serves 4","image":"https://cdn.jamieoliver.com/recipe-database/medium/9Kr816-247w8BMBS2aMCW3.jpg"}