{"name":"Vibrant Lime Bars","description":"Vibrant lime bars with a delicious shortbread base and a perfectly sweet and tart lime custard filling. Easy to make gluten-free & dairy-free!","ingredients":["For the lime base:","1 cup (200g) granulated sugar","2 tablespoons lime zest","½ cup (100g) fresh squeezed lime juice (you’ll need 6 to 10 limes, depending on how big the limes are)","4 large eggs","¼ cup (30g) all-purpose flour*","2 tablespoons salted butter (or vegan butter), at room temperature","1 to 4 drops of artificial dye-free green food coloring (optional, to get a bright green color)","For the shortbread base:","1 ½ cups (168g) fine blanched almond flour","3 tablespoons melted coconut oil (or sub melted vegan butter or regular butter)","2 tablespoons pure maple syrup","1 teaspoon vanilla extract","¼ teaspoon salt","For serving:","Powdered sugar, for dusting","Additional lime zest, optional"],"instructions":"Preheat the oven to 350 degrees F. Line an 8x8 inch square pan (DO NOT USE 9x9 inch as it will be too big). NOTE: It’s important to use an 8x8 inch as a 9x9 inch pan may be too big. In a medium pot, add the sugar and lime zest and use clean fingers to rub the mixture together for about 30 seconds so the lime releases into the sugar and infuses it with flavor. Next, add the lime juice, eggs, and flour and whisk together until the mixture is well combined and no streaks of egg remain. Do not add in the butter or food dye yet. Set the pot aside. In a medium bowl, add the almond flour, coconut oil, maple syrup, vanilla extract and salt. Mix together with a fork until it forms a nice thick crumb texture. Add to the pan and use your fingers to evenly press down into the pan. Bake for 8-9 minutes until the crust is slightly golden brown on the edges. Remove from the oven and set aside to cool for 5 minutes. Keep heat in the oven. While the crust cooks, place the pot over medium-low heat and whisk constantly until the mixture thickens and coats the back of a spoon, about 6 to 8 minutes. Once the mixture has thickened, remove from heat. Place a sieve (fine mesh strainer) over a medium bowl. Pour mixture into the sieve and use a spoon to work and mash down the filling through the stainer. In the bowl with the warm lime filling, stir in the butter until melted and a few drops of green food dye to achieve a vibrant green color, if desired. Immediately pour the mixture over the warm crust and tilt the pan or spread with a spatula to evenly distribute the lime filling. Place the pan back in the oven and bake for another 8 to 11 minutes until the filling is set and barely jiggly when the pan is gently shaken. Allow bars to cool at room temperature for 1 to 2 hours, then transfer to the fridge and chill for at least 6 hours or up to 2 days. Dust with powdered sugar and cut into 16 bars using a clean, sharp, wet knife. Clean and wet the knife after each cut. Annoying, but it helps to get the perfect cut! Add a little extra lime zest on top if you want a little extra zing. To store: Place leftover bars in an airtight container and place in the fridge for up to 4 days. If you are stacking the bars, add a sheet of parchment paper in between the layers to prevent sticking. You will likely need to add additional powdered sugar on top of the bars before serving as it may dissolve into the bars in the fridge.","tags":[],"time":{"prep":"20 minutes minutes","cook":"20 minutes minutes","active":"","inactive":"","ready":"","total":"7 hours40 minutes hoursminutes"},"servings":"16","image":"https://www.ambitiouskitchen.com/wp-content/uploads/2024/07/Lime-Bars-7long.jpg"}