{"name":"Watermelon Salad with Herbed Yogurt Sauce","description":"This watermelon salad recipe is SO delicious and refreshing! It features ripe cubed watermelon over mint-basil yogurt sauce, with cucumber and fresh herbs.","ingredients":["Watermelon salad","3 pounds ripe seedless watermelon (about ½ small round watermelon or 4 cups cubed), cut into ¾″ cubes","2 mini cucumbers or 1 small cucumber, thinly sliced into rounds","½ cup thinly sliced shallot (1 medium-to-large shallot)","3 tablespoons sherry vinegar or red wine vinegar","¼ teaspoon fine sea salt","2 tablespoons extra-virgin olive oil","Small handful fresh mint and basil leaves, torn if large, for garnish","Flaky sea salt or kosher salt, to taste","Freshly ground black pepper, to taste","Herbed yogurt sauce","1 cup Greek yogurt","⅓ cup lightly packed combination of fresh basil and fresh mint leaves","1 tablespoon extra-virgin olive oil","1 teaspoon honey or maple syrup","Pinch of fine sea salt"],"instructions":"In a small bowl, combine the sliced shallot with the vinegar and ¼ teaspoon salt. Toss to combine, and place in the refrigerator to lightly pickle while you prepare the rest of the salad. Make the yogurt sauce: In a food processor, combine the yogurt, fresh herbs, olive oil, honey, and a pinch of salt. Blend until the herbs are broken into tiny pieces and the sauce is pale green. (If you don’t have a food processor, finely chop the herbs and whisk the ingredients together in a bowl.) Swirl the yogurt sauce (all of it) over the base of a large serving platter. Scatter the cubed watermelon on top, followed by the cucumber. Arrange the pickled shallot on top, and spoon the leftover vinegar over the salad. Drizzle 2 tablespoons olive oil on top, sprinkle generously with fresh herbs, and season with salt and pepper, to taste. If you won’t be serving immediately, place the salad in the refrigerator to stay chilled. This salad is best served within an hour or two.","tags":["egg free","gluten free","Independence Day","Mediterranean","naturally sweetened","nut free","recipes","salads","soy free","summer","tomato free"],"time":{"prep":"30 minutes","cook":"","active":"","inactive":"","ready":"","total":"30 minutes"},"servings":"6 servings","image":"https://cookieandkate.com/images/2019/08/best-watermelon-salad-recipe-1.jpg"}