{"name":"Wine-braised chicken","description":"This recipe for chicken in a white wine sauce from Jamie Oliver is simple to make, and the roasted grapes are sweet and delicious.","ingredients":["olive oil","1 x 1.5 kg whole free-range chicken","4 onions","4 carrots","2 cloves of garlic","½ a bunch of fresh rosemary","1 heaped tablespoon plain flour","300 ml white wine","200 ml organic chicken stock","600 g potatoes","2 handfuls of red and green grapes","a few sprigs of fresh flat-leaf parsley"],"instructions":"Preheat the oven to 190ºC/375ºF/gas 5. Joint the chicken into 8 pieces. Heat a lug of oil in a large saucepan over a medium heat. Season the chicken, add it to the pan in batches, and fry until golden all over. Set aside on a plate. Peel and cut the onions into wedges, chop the carrots, then peel and finely chop the garlic. Add the veg to the pan and gently sauté for about 15 minutes over a medium-low heat, or until soft and sticky but not coloured. Return the chicken to the pan. Pick, finely chop and add the rosemary, then stir in the flour. Turn up the heat to medium-high and leave to colour for a few minutes. Pour in the wine and bring to the boil, then lower the heat and let it reduce by half. Roughly chop and add the potatoes, pour in the stock, and bring it back to the boil. Transfer everything to a roasting tin and cook in the oven for 30 minutes, or until the potatoes are tender and the chicken is falling off the bone. Place the grapes in a small roasting dish, drizzle with a little oil and cook these in the oven for the last 20 minutes, or until caramelised. Stir the grapes into the chicken, finely chop and scatter over the parsley leaves, and serve.","tags":["Jamie Magazine","Chicken","Dinner Party","Sunday lunch","Mains","Chicken thighs"],"time":{"prep":"","cook":"Time 1 hour 15 minutes","active":"","inactive":"","ready":"","total":"Time 1 hour 15 minutes"},"servings":"Serves 4","image":"https://cdn.jamieoliver.com/recipe-database/medium/46264861.jpg"}