{"name":"Your Best Grilled Burger","description":"Grilling can be intimidating, but achieving a perfect backyard burger is very attainable! We're sharing our simple recipe with 10 tips for success, from what kind of beef to buy to how to keep burgers juicy on the grill.","ingredients":["1 1/3 pounds (21 ounces) cold ground beef (80 percent lean)","1 1/2 teaspoons fine salt","1 teaspoon freshly ground black pepper","4 sesame burger buns","4 to 8 slices American cheese, optional","Optional toppings: mayonnaise, leaf lettuce, sliced tomato, sliced onion, pickles"],"instructions":"Gather the ingredients. Heat a gas grill on high for 10 minutes with the lid closed or prepare a hot charcoal grill fire. Meanwhile, divide 1 1/3 pounds (21 ounces) cold ground beef (80 percent lean) into 4 equal portions and shape the meat into patties that are wider than your buns (the burgers will shrink a bit during grilling). If you have two deli lids, use those to form the patty. Otherwise, form the patties so there is a depression in the center with an approximately 1/2-inch wide rim around the edge. Handle the meat as little as possible. Season the burger patties with 1 1/2 teaspoons fine salt and 1 teaspoon freshly ground black pepper on both sides. When the grill is ready, place the burgers over direct heat and let sit without flipping or moving until nicely charred and the patties release easily from the grill grate, 4 to 5 minutes. The burgers should release easily from the grill. If you try to flip them and they’re sticking, wait another minute or so. Flip the burger patties and cook, undisturbed, for 4 to 5 minutes more or until cooked to your liking (use a thermometer if needed: the internal temperature should be 135 F for medium-rare burgers or 145 F for medium). In the last minute or so of cooking, place 4 sesame burger buns on the grill to toast and place 1 or 2 slices of the 4 to 8 slices American cheese, if using, on top of each burger patty to melt. Serve the burgers right away on the toasted buns with your choice of optional toppings: mayonnaise, leaf lettuce, sliced tomato, sliced onion, and/or pickles.","tags":["Your Best Grilled Burger","grilled burgers","burgers","ground beef"],"time":{"prep":"5 mins","cook":"10 mins","active":"","inactive":"","ready":"","total":"15 mins"},"servings":"4 servings","image":"https://www.thespruceeats.com/thmb/9XmBoNfcoL8q7pvFYFcOsxw5IUM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/SES-your-best-grilled-burger-recipe-7511041-hero-A-909fca5125c14e889001e7d62a63777c.jpg"}