{"name":"Zucchini With Crispy Rice and Lime","description":"Turn summer squash into a delightfully textural side dish inspired by Thai crispy rice salad—featuring a lime and fish sauce dressing and lots of fresh herbs.","ingredients":["3 Tbsp. fresh lime juice","1 Tbsp. chili crisp","1 Tbsp. fish sauce","1 Tbsp. soy sauce","2 tsp. sugar","2 cups chilled day-old cooked white rice","2 Tbsp. rice flour","¼ cup plus 2 Tbsp. vegetable oil","3 zucchini, quartered lengthwise, halved crosswise","½ small red onion, thinly sliced"," Kosher salt"," Basil leaves and mint leaves (for topping)"],"instructions":"Whisk 3 Tbsp. fresh lime juice, 1 Tbsp. chili crisp, 1 Tbsp. fish sauce, 1 Tbsp. soy sauce, and 2 tsp. sugar in a large shallow bowl to combine. Set dressing aside. Spread 2 cups chilled day-old cooked white rice out on a rimmed baking sheet, breaking up any clumps with your hands. Sprinkle with 2 Tbsp. rice flour and gently toss until rice is well coated and no flour remains on baking sheet. Heat ¼ cup vegetable oil in a medium Dutch oven or other heavy pot over medium-high. Add rice; reserve baking sheet. Gently toss with a heatproof rubber spatula to coat rice with oil and cook, tossing occasionally and breaking up any clumps of rice with spatula, until crisp and golden, 10–12 minutes. Transfer crispy rice to reserved baking sheet and spread out into an even layer. Heat remaining 2 Tbsp. vegetable oil in same pot over medium-high. Add as much of 3 zucchini, quartered lengthwise, halved crosswise, as will fit in an even layer, arranging cut side down. Cook, undisturbed, until well browned underneath, about 2 minutes. Toss, then add remaining zucchini (cooking will have shrunk them slightly, making more space; it’s okay if they don’t all fit in a single layer). Cook, turning occasionally with tongs and transferring pieces to bowl with reserved dressing as they are done, until deep golden brown on cut sides, 3–4 minutes. Add ½ small red onion, thinly sliced, and crispy rice to bowl with dressing and zucchini and toss to coat. Taste and season with kosher salt. Top with basil leaves and mint leaves.","tags":["dinner","side","summer","dairy-free","nut-free","zucchini","rice"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":""},"servings":"","image":"https://assets.bonappetit.com/photos/66574ca322b55c927df0bcf1/16:9/w_1280,c_limit/240426%20MVP2122.jpg"}