{"name":"Zucchini Butter Spaghetti","description":"This is a favorite simple summer pasta, just a heap of zucchini cooked until it has melted into a puddle of butter and garlic, laced with a little heat, then tossed with basil, parmesan, and spaghe…","ingredients":["1 1/2 teaspoons kosher salt, plus more for pasta water, and to taste","8 ounces (225 grams) spaghetti, cooked al dente","1 cup (235 ml) pasta water, reserved","1 1/4 pounds (570 grams) zucchini, trimmed, coarsely grated","6 tablespoons (85 grams) unsalted butter","4 garlic cloves, minced","1/4 teaspoon red pepper flakes, or more to taste","1/2 cup (45 grams) grated parmesan","Handful fresh basil leaves, cut into thin ribbons",""],"instructions":"Boil your spaghetti in well-salted water until it’s 1 minute shy of fully cooked. Before you drain it, reserve 1 cup of the pasta cooking water and set it aside. Melt butter in your empty pan over medium-high heat and add the garlic, stirring it into the butter for one minute before adding the zucchini, salt, and red pepper. Cook the zucchini, stirring from time to time, for 13 to 15 minutes. It will first let off a puddle liquid, the liquid will cook off, and the zucchini will become soft and concentrated. If the zucchini begins to brown, reduce the heat slightly. Stir frequently for 2 more minutes, chopping it down into smaller bits with the edge of your spoon or spatula, until it reaches an almost spreadable consistency. Pour in 1/2 cup of the reserved pasta water and stir up anything stuck, then add drained pasta, and cook together for 2 minutes. Use tongs or two forks to pull up the zucchini butter sauce into the pasta strands, tossing frequently, and adding some or all of the remaining pasta water as needed to loosen. Toss in half of the parmesan and basil and mix, then transfer to a serving bowl. Finish with remaining parmesan and basil.","tags":["Dinner","Pasta","Summer","Vegetarian","Weeknight Favorite","Zucchini"],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":"25 minutes"},"servings":"2 generously or 4 petite-ly","image":"https://i0.wp.com/smittenkitchen.com/wp-content/uploads/2021/06/zucchini-butter-spaghetti-1-scaled.jpg?fit=1200%2C800&ssl=1"}