{"name":"Zuppa Toscana","description":"Zuppa Toscana is a creamy, filling, and flavorful soup with Italian sausage, potatoes, and kale. Just like The Olive Garden's, but made from scratch!","ingredients":["1/2 lb. Italian Sausage, hot or mild","1 yellow onion","2 cloves garlic","1  15 oz. can Great Northern beans","1/2 tsp smoked paprika","3 cups chicken broth*","1 cup water","2 cups half and half**","1 lb. red potatoes","1/2 lb. kale, chopped","1 pinch red pepper flakes, optional","freshly cracked black pepper, optional"],"instructions":"Add the sausage to a large soup pot and sauté over medium heat, breaking it up into small pieces as it cooks. The sausage should contain enough fat to keep it from sticking, if not add a touch of olive oil. It’s okay if a small amount browns on the bottom of the pot. While the sausage is cooking, dice the onion and mince the garlic. Add the onion and garlic to the pot and sauté until the onions are softened. The moisture from the onions should help dissolve any browned bits of sausage off the bottom of the pot. Drain and rinse the can of beans. Add the beans, smoked paprika, chicken broth, one cup water, and half and half to the pot. Place a lid on the pot and let it come up to a simmer over medium heat. While the pot is heating, cut each potato into quarters lengthwise, then slice across into thin, 1/8-inch thick slices. Add the potatoes to the pot along with the pre-chopped kale. The kale will fill the pot when it’s first added, but the heat from the liquid will wilt it within a few minutes. Stir it occasionally to help the wilting process. Let the pot simmer over medium heat for about 15 minutes, or until the potatoes are tender. Season with red pepper flakes and freshly cracked black pepper if desired.","tags":[],"time":{"prep":"15 minutes mins","cook":"30 minutes mins","active":"","inactive":"","ready":"","total":"45 minutes mins"},"servings":"8","image":"https://www.budgetbytes.com/wp-content/uploads/2018/09/Zuppa-Toscana-eat-1200.jpg"}